[
  {
    "ID\tQuote": "1-A\t\"8 years ago yesterday",
    "__parsed_extra": [
      " I was diagnosed with Autoimmune Hepatitis. I’m feeling pretty emotional about my journey with this chronic disease. Throughout the years I’ve had endless blood draws",
      " too many doctors appointments",
      " new diagnoses",
      " so many bad days",
      " & much much more. The past 8 years have been such a journey. "
    ]
  },
  {
    "ID\tQuote": "I’ve always felt embarrassed about having the diagnosis I do - do people believe me? Do they think I’m faking it? Hidden diseases are a struggle and can make you feel crazy. "
  },
  {
    "ID\tQuote": "But",
    "__parsed_extra": [
      " instead of letting those thoughs fill my head",
      " I’m choosing to feel grateful. Grateful that I have a diagnosis! Grateful for the wonderful healthcare I receive! Grateful that I can be an advocate to others about their health! Grateful that I can do hard things!"
    ]
  },
  {
    "ID\tQuote": "I have done so much over the past 8 years that I honestly never thought I’d do - I’m graduating college next week! I have an amazing job working in youth sports with great people surrounding me! I continue to travel",
    "__parsed_extra": [
      " go to concerts / events",
      " and get out of my comfort zone! My 14 year old self would not believe it. "
    ]
  },
  {
    "ID\tQuote": "Make the Dr appointment",
    "__parsed_extra": [
      " get the colonoscopy",
      " do the bloodwork",
      " do it all. Take care of yourself & never take your health for granted !!\""
    ]
  },
  {
    "ID\tQuote": "2-A\t\"Yes hello. 👋 AIH with cirrhosis. Diagnosed in April. It was a complete surprise. Any symptoms that something was wrong aligned with parenting small children",
    "__parsed_extra": [
      " and it wasn't until a blood test for an unrelated medication that my liver enzymes returned through the roof."
    ]
  },
  {
    "ID\tQuote": "\n2-B\t\"Just got diagnosed with Autoimmune Hepatitis at age 22. Anyone else out there with this that can talk me through not crying a lot lol? I started on prednisone and that other pill to suppress the prednisone yesterday and my family and friends are worried of the long-term effects of prednisone, anyone had issues with it or anything?\n\nAlso just looking for support :/"
  },
  {
    "ID\tQuote": "2-C\t"
  },
  {
    "ID\tQuote": "2-D\t"
  },
  {
    "ID\tQuote": "3-A\t\"My mom was just diagnosed with autoimmunte hepatitis; she has questions",
    "__parsed_extra": [
      " and she's not familar with reddit. So:"
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "I will be on Imuran indefinitely for autoimmune hepatitis.  Do I wear a mask all the time?  Can I still get vaccinated (flu",
    "__parsed_extra": [
      " covid",
      "Etc)  How has it affected your lifestyle?  Are you able to have a drink every now and then?"
    ]
  },
  {
    "ID\tQuote": "\n3-B\t\"I do think all of these questions can be contingent on how severe your AIH is so take what you get with a grain of salt. And, from what I've heard on other posts, doctors also say different things about what you can or can't do/have.\n\nI don't wear a mask unless I go somewhere that has a lot of people that are sick. I have a small child so I do catch things from them very easily, though. I wash my hands a lot to try to keep down those chances, and it works. I have only caught things when she sneezed/coughed right in my face.\n\nYou can get any vaccine that isn't live. For example, if someone asks about getting an MMR, you can't because it's live.\n\nI'm not sure about the lifestyle question. I do suffer from pretty terrible fatigue and that could be the AIH, the med, or another condition that I have. There are also certain foods I was told to avoid: sushi, oysters, deli meat, and only eat well done steaks. Others have said their doctors told them different things regarding foods.\n\nI drink very seldomly. Like a drink every couple of months."
  },
  {
    "ID\tQuote": "3-C\t\""
  },
  {
    "ID\tQuote": "I never wear a mask."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "You can I guess",
    "__parsed_extra": [
      " I have never been vaccinated for flu. I did get covid vaccines a few years ago",
      " I will not get them again."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Diagnosis has not affected my life."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "For me",
    "__parsed_extra": [
      " yes I do drink.\""
    ]
  },
  {
    "ID\tQuote": "4-A\tHi from New Zealand:) I have had Autoimmune Hepatitis Type 2 since I was 7 - 20 years this year- and over the last few years it has become refractory and not responding to treatment so my specialist has recommended rituximab. 🙂 I have had screening and start in two weeks- they have to order it in. 🙂 because of being already immunosuppressed from cell cept and tacrolimis which surpress both T and B cells",
    "__parsed_extra": [
      " and now overlapping with Rituximab",
      " until I can be weaned off I know I am going to be heavily compromised.. I am just wondering what precautions you take (3-6 month isolation seems to be recommended) as we are entering Winter months here. 😊"
    ]
  },
  {
    "ID\tQuote": "4-B\t\"Are you able to also receive IVIG Immunoglobins? I receive the Rituxan every 6 months as well as IVIG monthly (Gammagard Liquid) as it boost immunity. I also get injectable vitamin shots like B12 and other mixtures to boost my immunity. I eat a clean diet free of dairy",
    "__parsed_extra": [
      " gluten",
      " sugar and very limited processed food that is mostly organic. My diet is mainly fruits",
      " vegetables",
      " fish and occasionally I have a small portion of chicken. I eat a lot of salads and I use oil & vinegar."
    ]
  },
  {
    "ID\tQuote": "\n5-A\t\"I was diagnosed with autoimmune hepatitis in September 2024, today I am taking prednisone, ursocel and azatropine. Can medication cause hallucinations?\n\n"
  },
  {
    "ID\tQuote": "5-B\t\"Yes for me it does. I was taking prednisone at 60mg before and im not even kidding you",
    "__parsed_extra": [
      " me and my husband keeps fighting because i dont understand his point - literally anything ",
      " even if he tries to explain stuff to me I dont understand them and it gets me mad real quick (which is very unusual for me and for us cause we tend to always see eye to eye) but when I was taking such high dose",
      " i cant seem to grasp everything and i cried a lot.The worst part is hallucinations - specifically same as that movie “Smile”. I tend to feel like im seeing some person in the dark living room ",
      " or i feel like someone is smiling at me from the back",
      " or when im in our terrace i feel like someone is staring at me and smiling. Gosh that was scary. Dark thoughts all around. I really thought I was going crazy! I was even scaring my sister who is with me because i keep telling her i feel like someones watching me. And i am not the type who gets scared easily before."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Here’s my advise: I know its tough",
    "__parsed_extra": [
      " God its tough but always make sure that you have good support system. You need someone to remind you that everythings okay and that someone you can confide to with your thoughts. Stay strong and make your mind extra stronger. When I stopped prednisone and transitioned to solely azathioprine today",
      " those thoughts are gone.\""
    ]
  },
  {
    "ID\tQuote": "5-C\t\"I will share my experience with steroids. They affect neurotransmitters and influence specific brain parts",
    "__parsed_extra": [
      " including the hippocampus. The effects vary from person to person. In my case",
      " I experienced severe mood swings",
      " which were quite distressing. While I didn't have hallucinations",
      " the steroids disrupted my sleep cycle and caused insomnia",
      " leading to strange dreams and nightmares. Additionally",
      " as I struggled with these issues",
      " my feelings and emotions were significantly impacted."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "The good thing is that the moment I tapered off steroids",
    "__parsed_extra": [
      " all went away in a few weeks."
    ]
  },
  {
    "ID\tQuote": "\n6-A\t\"Hey ! Im a 24 year old female , diagnosed with autoimmune hepatitis and cirrhosis of the liver 5 years ago. Beside everything elsee , I haven’t had my period for like 5-6 years. I was told it probably is secondary amenorrhea caused by hormonal disbalance bc of my cirrhosis or the medication. I wanted to ask other females here if they had the same problem and how did they deal with it? Also if they had any problems getting pregnant bc of cirrhosis?\n"
  },
  {
    "ID\tQuote": "6-B\t\"I’m 24 and I was diagnosed 8 years ago! I hadn’t had a period in years",
    "__parsed_extra": [
      " was diagnosed with pcos andI was prescribed metformin for it. I also got pregnant super easily. The pcos makes it a little different but for what it’s worth"
    ]
  },
  {
    "ID\tQuote": "\n6-C\t\"I need to follow up with my doc about this. I’m on birth control now, and haven’t had a period anyway- but I had some weird symptoms and my doc said I had basically gone through menopause because of my condition. At the time I didn’t ask anymore.\n\nI don’t want kids anyway, but I am interested to see what he says again.\n"
  },
  {
    "ID\tQuote": "6-D\t\"I (33f) haven’t been on birth control in over 10 years previous partner had a vasectomy. I did lose my period for almost an entire year after losing 70 pounds. My period came back after I gained back 40 pounds. Also I lost my armpit and leg hair during that time. Me and my current partner have been less than responsible but we are convinced neither of us can have children. He had reproductive issues with an ex he had. My period is aggressive when I do have it. I go immediately anemic and I’ve been a heavy bleeder. It’s hard to say but considering my type of luck as soon as I say I’m never having my own kid I’ll probably end up knocked up."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "\n6-E\t\"I’ve been thinking about all of this too. I’m a 43-year-old woman and had frozen eggs and embryos when I was 39/40.\n\nI was recently diagnosed with “early” cirrhosis by my hepatologist, though my GI thinks it’s still just fibrosis. I haven’t had a biopsy yet, but I’ve done full blood work, an ultrasound, FibroScan, and an endoscopy—likely due to NAFLD.\n\nNow I’m unsure how to move forward. I still want to become a mom, but I’d be doing it on my own, and I worry about the risk of leaving a child without a parent.\nI know this doesn’t help much, but you aren’t alone in all of this."
  },
  {
    "ID\tQuote": "6-F\t\"Im already decompensated",
    "__parsed_extra": [
      " my AIH was pretty silent and fast working so it was already late when we discovered it. Its been a wreck as u said it and with autoimmune hepatitis u never know what the next day will bring so its pretty difficult in my case . The doctors have said its pretty risky for me to even think of a pregnancy",
      " if i can even get one by stimulating my periods. I cant even do that bc estrogen will damage my liver even more so."
    ]
  },
  {
    "ID\tQuote": "\n6-G\t\"Darn! Well if children are your dream, AIH doesn't have to stop you! My mom is adopted and had the most loving, incredible family. If I ever have children I will also adopt.\n\nI'm queer, so a lot of my friends go through IVF, surrogacy, and other processes for children so I'm around a fair amount of non-traditional pregnancies and I can assure you there are so many options! One of my lesbian friends was implanted with her partner's egg and successfully carried their kid to term since her partner has a medical condition that makes pregnancy riskier.\n"
  },
  {
    "ID\tQuote": "7-A\t\"I wanna start off by saying I am not asking for a diagnosis just some insight since I think I might have autoimmune hepatitis."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Got blood work done in September and it came back with elevated liver enzymes AST: 74 and ALT 177 I was told I have fatty liver and just eat better but no heavy exercise because I’m close to being underweight."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "I got referred to a GI this month and they did some more test my AST:149 and my ALT:353 so it got worse and I’ve been eating a lot better",
    "__parsed_extra": [
      " not perfect but a ton better."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "On top of that my Immunoglobulin G is 1",
    "__parsed_extra": [
      "815.2 which is high and my ANA was positive. I also have a week positive for Smooth Muscle Antibody."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "My liver ultrasound found no permanent damage but it is mildly damaged."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Idk if it matters but I’m 21F"
  },
  {
    "ID\tQuote": "\n7-B\t\"Your story sounds very similar to how mine started. I had mildly elevated liver enzymes last November and was also told probably fatty liver. I lost weight and really focused on healthy eating. When labs were rechecked in January, they were 10 times the normal values. This led to positive ANA and ultimately a liver biopsy, which gave me the diagnosis of AIH in April. Igg was 1200, and all other markers were normal. At the start of my treatment in April, both my AST and ALT were over 1900, and alk phos, total, direct, and I direct bilirubin were all elevated, too. I'd recommend asking to be referred to a hepatologist if you haven't already. Wishing you all the best.\n"
  },
  {
    "ID\tQuote": "7-C\t\""
  },
  {
    "ID\tQuote": "I had a routine bloodwork at a doctors office",
    "__parsed_extra": [
      " and my ALT was 300+. It happened once before during a stint in the hospital for something else. They did a ton of testing and found a rare tumor on my liver that requires seeing a hepatologist 2x a year and having MRIs yearly for monitoring. They eventually gave me a liver disease unspecified diagnosis bc my LFTs were such a roller-coaster. When they finally were 300-400 for 6 months",
      " they did a biopsy. I got a Stage 0 AIH diagnosis bc the damage was so minimal. I just got..... lucky(?) that one doctor did bloodwork",
      " and I ended up seeing a liver doc for that tumor. I didn't have a fatty liver in 2020 when I got my biopsy",
      " but I do now."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "My mom also has an autoimmune disease that can go with AIH so they figured I would get one from the beginning. It just took 5ish years for it to progress to that. And",
    "__parsed_extra": [
      " I was advised that I will likely end up with hers as well."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "\n7-D\t\"I was diagnosed last year in November around Thanksgiving. I started with symptoms of fatigue. I noticed yellowness in my eyes but ignored it as a lack of sleep or something. I experienced bloating, and my GP gave me antibiotics, which made things worse for me. I got my blood work done, and my liver enzymes were off the charts. My ALT was 1200, and my AST was 800. My bilirubin was 8. My ultrasound and CT came back clean. I was admitted to the hospital because they wanted to run tests and find out the reason.\n\nI was in the hospital for seven days, and they performed all possible tests. I tested negative for all viruses, and my enzymes continued to rise. They finally performed a biopsy and diagnosed me with autoimmune hepatitis. I was immediately prescribed 40 mg of prednisone. I stopped taking steroids about four months ago and am now on 50 mg of Azathioprine. All my parameters are now normal.\n\nI have made significant changes to my lifestyle. I am more mindful of my diet and exercise regularly.\n"
  },
  {
    "ID\tQuote": "7-E\t\"45M. I had no symptoms. I volunteered for the omicron vaccine trials in the summer of 2022 and they made me do a blood draw before I could be approved. Called me back the next day and said I needed to go see my pcp. My liver enzymes were highly elevated. Took a little while to get a conclusive AIH diagnosis after that."
  },
  {
    "ID\tQuote": "\n7-F\tJuly I went to urgent care cause I thought my toe was broken. It was swollen and painful. Turned out to be a staph infection. The next day the radiologist thought I might have osteomyelitis and told me to go to the ER. I did that. They did blood work. I had elevated liver enzymes and high blood sugar. Got an appointment to my PCM who also had blood panels done. Still had high liver enzymes so got a referral to a gastroenterologist the end of August. They also did blood work. Had positive ANAs. Went in for an ultrasound mid Sept. Got sent for a liver biopsy 3 weeks ago. Saw a hepatologist Monday who confirmed AIH. But fortunately no scarring at all and no current need for steroids. They did more blood work and am now waiting for that in order to get a prescription. If I hadn't injured my toe who knows how long it would've been before I found out.\n7-G\t\"Had some pain and stiffness in my legs one day, then had months of testing; getting shuffled from specialist to specialist. One day, rheumatology figured out what was going on, but sent me to GI. Abruptly, the GI doctor came into the room and told me I had autoimmune hepatitis and primary sclerosing cholangitis. Rheumatology never told me what was going on before they sent me away 🤷‍♂️\n"
  },
  {
    "ID\tQuote": "7-H\t\"I stopped eating for 2 weeks and turned banana yellow. Took years to get diagnosed. Apparently aLl GiRlS mY aGe Go ThRoUgH tHiS. Turns out Drs just like to tell women they're crazy as often as possible. My alt was like 1500 or something crazy. The first time they just thought I tried to overdose on Tylenol despite saying repeatedly my household only takes Motrin. The only real way to get a diagnosis is a biopsy."
  },
  {
    "ID\tQuote": "\n8-A\t\"How many treatments has everyone had. Im at 8.\n"
  },
  {
    "ID\tQuote": "8-B\tI have had 2 now"
  },
  {
    "ID\tQuote": "8-C\t\"Around 22"
  },
  {
    "ID\tQuote": "\n8-D\t\"Had one today...get them every 12 weeks...2 years ago it was every 8weeks. Started Rituxan in 2018. It is for Myastenia Gravis\n"
  },
  {
    "ID\tQuote": "9-A\t\"I wanted to post it because I’m spending Christmas in the hospital because of Rituxan. My rheumatologist didn’t check my cortisol level or my kidneys or my heart. I ended up with what they thought but first was a heart attack but then since then I found out that Rituxan caused my liver to be enlarged a lot. It’s huge not only that that caused my bile duct to be enlarged. I’m here in the hospital. Getting shots in my stomach shots everywhere CAT scans ultrasounds you name it. "
  },
  {
    "ID\tQuote": "My advice to anyone it should make sure before you take a dish that your rheumatologist has checked your liver your kidneys",
    "__parsed_extra": [
      " your heart",
      " your bile ductsyour blood",
      " I have it",
      " but if you’ve ever been exposed",
      " I’ve been around hepatitis B",
      "or C can bring it on and active."
    ]
  },
  {
    "ID\tQuote": "    Not trying to make anyone nervous not saying it will happen just saying the wise thing to do will make sure that all those tests I’ve been run before you take it I didn’t\""
  },
  {
    "ID\tQuote": "10-A\t\"Hello. Hello. Okay. Erin kind of already introduced me. My name is Caitlin Percoccia. I'm from California. I'm 22 years old. I'm 23 years old. Sorry. My birthday was this week",
    "__parsed_extra": [
      " so still getting used to that part. And shout out to my mom",
      " my dad",
      " and my two cousins here for supporting me. Okay. Okay. So I was a normal 17-year-old girl having a great life. I was the captain of my soccer team",
      " varsity soccer team",
      " taking four honors classes and had an active social life. And what I didn't realize is even at 17",
      " I was super stressed out all the time. And it started with losing my menstrual cycle and feeling tired. And that wasn't unusual for someone who was an intense athlete and who was in her junior year of high school",
      " studying for the SAT",
      " taking AP classes",
      " thinking about college applications. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "So I wasn't that concerned about it. And I also had an exchange student staying with me to add to my stress load. And at that point",
    "__parsed_extra": [
      " something flipped. I began to feel itchy at night all over my body so terribly that I went to a dermatologist. And that turned into blood work. And that turned into something that would change my life forever. So within a week or so of that initial dermatology visit",
      " my primary care doctor sent me to Stanford Hepatology",
      " where they told me that they suspected AIH and they would need to do a biopsy to confirm. And I felt shock",
      " horror",
      " disbelief. I felt like my body had turned against me",
      " like I couldn't trust it. And I'm sure many of you have felt those feelings as well. And up until that point",
      " I had this belief system that no matter what happened",
      " I would be safe. I would get better. And my parents could tell me that. But now I was being told that I had a chronic illness",
      " that there's no cure. There's just treatment and hope of getting into remission and then staying in remission",
      " which caused huge amounts of stress for me on top of what I was already feeling. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "And so I undergo the biopsy. The biopsy confirms it. And I start treatment at Stanford with prednisone. So despite the diagnosis",
    "__parsed_extra": [
      " kind of similar to Brooke",
      " I was determined to keep doing all the things I had done before. And it was two weeks no contact after the biopsy. So I started going to the weight room. And in the weight room",
      " I introduced myself. I'm like",
      " hi",
      " I'm Caitlin. He's a lift coach. He's like",
      " why are you here? You've never been here before. And I said",
      " I just had a biopsy. And I can't do contact. And he goes",
      " wait",
      " are you so-and-so's girlfriend? So-and-so is in the last slide next to me in the hospital. And I said",
      " yes. How did you know? He said",
      " well",
      " he missed. Click the screen. Oh. Yeah. Sorry. I haven't been changing slides. Okay. So-and-so right there in the hospital. And he's like",
      " yeah",
      " so-and-so missed lift last week to go visit his girlfriend in the hospital who was getting a biopsy. So he put two and two together because in a school of 500 kids",
      " obviously",
      " "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "I was the only one getting a biopsy that weekend. So that was just a funny story. And this lift coach ends up being a big mentor to me. And 18 days after the biopsy",
    "__parsed_extra": [
      " I play in the soccer game versus our arch rivals. So that's me with my dad and my sister and me hugging the girl who scores the winning goal. And that was just a huge moment because it was like",
      " yeah",
      " like I came back despite the odds and still showed up for my team. Like I was captain. I had to be there. And so then a few months later",
      " spring 2018",
      " I transferred my care to UCSF",
      " as my dad has mentioned",
      " because at Stanford",
      " our doctor didn't have a lot of experience. We were feeling kind of uneasy in her hands. And I guess I wasn't getting better. I don't remember that part. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "But we ended up getting placed with the head of pediatrics",
    "__parsed_extra": [
      " gastroenterology slash hepatology. And she made me feel so confident in the possibility of recovery and in her care. But despite feeling and better care",
      " I was extremely stressed out",
      " felt anxiety about a lot of things. You know",
      " if any little thing happened",
      " I thought it could be something big because I thought something little like fatigue was nothing. And then it was something huge. And I started therapy and medication",
      " but I still had stress. And I thought it was normal. And in addition",
      " my doctor had me on a two-week blood draw schedule. And I was extremely scared of needles",
      " which I'm sure a lot of people can understand. And so here's a little aside with how I kind of overcame this hurdle. So what basically happened was I started with little steps. First",
      " I had everything to comfort me with me. So I had a loved one",
      " my mom or my sister who's up there with me. They would hold my hand. I would do jumping jacks and push-ups",
      " drink water",
      " ask for the heating pack on my arm",
      " ask for the baby needle",
      " do all the stuff. And then as I started to gain more confidence",
      " I slowly peeled each of these things away until I was doing it by myself",
      " eyes open",
      " able to talk to the phlebotomist. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "And eventually it just became a task. And I'm fine with it now. Like you saw",
    "__parsed_extra": [
      " I got the acupuncture needle in. And I started to make it funny. So I put these fake tattoos on that says",
      " insert here. And they'd be like",
      " roll up your sleeve. And it's there. And the phlebotomist and I would just have a great laugh. And it kind of made it like a little highlight of my day rather than an onerous task. So those are just some tips I have for that. And now AIH and going to school. So I felt like I kept up with life and school pretty well. But I got called into the dean's office for too many excused absences. The dean accused me and my mom of working together",
      " my mom creating fake doctor's appointments so that I could cut class and cheat the system. Whether you choose to share your diagnosis or not is your choice. And I chose not to share with everyone. I mean",
      " I was still excelling in sports",
      " excelling in school. And I told my teachers and coaches at the time to create a more safe environment. But I didn't feel the need to tell everyone what was going on. And I really did not want to explain myself to this man after being so harshly accused. But I was forced to. I had to tell him about my doctor",
      " about my situation. And we had no personal connection. So that was just a really uncomfortable moment. And just sometimes people suck. And you're going to have to deal with it",
      " which is kind of part of the disease. And so I end up graduating high school",
      " won the CCS championship",
      " which is just our section. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "And it looked like I had overcome my disease kind of from the outside. And I got into my dream college. But I still felt very stressed. And it felt like a struggle to exist at the pace of life that I was trying to exist at. And then during my sophomore year of college",
    "__parsed_extra": [
      " some health complications arose. So I was diagnosed with Hashimoto's. And I started the thyroid medication. And I was on Nexium to protect my stomach from the steroids. But I was off steroids at this point. I was just still on the Nexium. And so we moved the Nexium to nighttime. Thyroid medication in the morning so they don't mess with each other. And all of a sudden",
      " my acid reflux starts acting up. And we're unable to rein it in. And my GI suggests upping the Nexium. Because if you have too much acid in your stomach",
      " that would",
      " in theory",
      " help. Because Nexium is an acid reducer. And then I see my new adult primary care or internist. And she suggested that the fact that I had been on Nexium long term could have been a huge problem for me if too much acid wasn't the issue that I was having. And it could decrease your stomach lining and bone density and all this other stuff. So that I was like",
      " oh my god. Like",
      " what? So it was at this point that I realized that I was kind of in this problem-solution-problem cycle that I'm sure many people can understand or have been through themselves. And for me",
      " it kind of went like this. So problem number one was getting diagnosed with AIH. Solution number one was getting the steroids. Problem from steroids is a lot of things",
      " such as stomach lining issues",
      " bone density issues",
      " glaucoma possibly. So then new solution... Oh",
      " how do I go back? We're just going to wait there. Okay",
      " new solution was that Nexium. But chronic Nexium usage may have adverse effects on your gut barrier",
      " your digestive capabilities",
      " and as well could have contributed to a lower bone density. So solution three at the time was kind of a misdiagnosis",
      " was more Nexium. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "And another problem that I was undergoing that maybe others in here have experienced is you lose your menstrual cycle when you're going through a disease like this. The solution was birth control. And the problem with that is that it suppresses your pituitary",
    "__parsed_extra": [
      " and you're not really cycling. It's just artificial. And for me",
      " I didn't want that. I wanted to actually be healthy because it's a vital sign in women. You know",
      " if you're cycling",
      " that's a sign that you're healthy. And so I thought",
      " how do I solve these problems without creating more problems? And as you'll see",
      " still had to live my life. I was about to go study abroad",
      " so I did not explore this",
      " and I just stuck to my regimen until symptoms became unbearable",
      " and I got an endoscopy there. But that revealed no quick diagnosis",
      " just chronic",
      " non-specific gastritis. But I could still have a great time in Italy while experiencing terrible symptoms. So it was kind of like a dual experience for me. And so I come home",
      " repeat liver labs. Labs look good",
      " but I don't feel good. So I start to try things on my own to fix the acid reflux and stomach issues. And these things helped somewhat",
      " but I was still suffering a lot. And at last",
      " I get off the wait list for Dr. Stephanie Daniel",
      " a functional medicine doctor who has a practice in San Francisco. And she said that I have this bad bacteria in my system",
      " explains how that can be the linchpin for symptoms such as reflux in my case. And I decided to trust her to help her",
      " or trust her to help me on my healing journey. So I start her protocol",
      " stop the birth control",
      " and for the first time since I was 16 years old",
      " I got my period naturally. So I'm like",
      " whoa",
      " this lady knows what she's talking about. And all of a sudden",
      " my reflux starts to improve. And the labs are improving. And I feel like I'm starting to get my life back",
      " because that pain was pretty debilitating. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Then next on the list is I graduate college. Woo! It might seem normal and like the thing you're supposed to do",
    "__parsed_extra": [
      " but especially with a disease like this",
      " I wanted to take a moment to celebrate this accomplishment and encourage everyone here to celebrate all their accomplishments that they're achieving despite their current situation and their diagnosis. So after grad",
      " I kind of hit a plateau. I felt like my stomach discomfort and reflux was getting worse again",
      " and I was just feeling stuck. And my functional medicine doctor suggested that it was likely due to stress",
      " and I would need to retrain my brain and unwind the years of stress that I had been experiencing since my diagnosis. And so she recommended this program called Primal Trust",
      " and I'm happy to talk more about it on the panel. And also",
      " I started using this app called the 5-Minute Journal to practice gratitude. I just find it super easy. It's free",
      " so I put it up there as well. And so gratitude",
      " primal trust",
      " EFT or tapping therapy",
      " acupuncture",
      " meditation",
      " I start doing all these things",
      " and I feel like it's helping. Like my digestion's far better than it was when I came to her upset. And am I completely cured now? No. But I'm managing it",
      " and I'm managing my stress far better than I was before. And will my stress ever go away? "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "No. No. No one's stress just goes away",
    "__parsed_extra": [
      " but your capacity to handle the stress will increase. And the more your capacity increases",
      " or at least for me",
      " as my capacity to handle stress increases",
      " the more well I feel. So my takeaways. My story",
      " like many others",
      " is full of ups and downs",
      " one step forward",
      " two step back. But what I've learned from this journey since 2017 is that I am responsible for my health. And I'm not saying that we are responsible for what happened to us. We don't deserve getting this diagnosis",
      " but we are the only ones who can make that decision to change our outlook",
      " to decide that we want to get better. No one else can make that decision but you",
      " and no one can unwind your stress for you. You have to do that work yourself. And so for me",
      " the functional medicine doctor",
      " the primal trust",
      " the EFT",
      " the meditation",
      " those are all things that work for me. And I wish I could say that this is the solution and that everyone here should do this. But I know that everyone is different and you're going to have to try things on your own and learn what works for you. "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "And the best I can do is share my experience and hope that it inspires you to do so. And another important thing that I learned is that we don't have to marry our disease or our symptoms. We have to talk about it at events like this and with our doctors to manage them. But if we give them too much energy",
    "__parsed_extra": [
      " they can consume our thoughts and become our identity and something we hide behind. But you don't have to be your diagnosis. You can just be you and that can be a part of you that you're working on. And this stuff is hard. I did it in high school and college when a place where self-care is not valued and drinking is highly valued. And I would just have to remind myself that prioritizing my health is going to pay off so much more for my future. And I'm just different. And everyone's got stuff going on and this just happens to be my stuff. And I've also found that you can be the life of the party without partying. So the image I chose for this last slide is my dad and I at a sports bar together in Australia pregame for the U.S. Women's National Team. And I ordered a pot of tea. And that's me with my teacup and my dad cheering. And I ordered the tea. I walk out from the bar with my pot and my cup. And everyone's like looking at me like",
      " what the hell? Like",
      " what's going on? "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "And I'm like",
    "__parsed_extra": [
      " yep",
      " that's right. Got my tea. And it just kind of like shows you can bring that silliness and that fun to a setting like a sports bar without consuming alcohol",
      " without partying",
      " per se. And so to conclude",
      " I am still living an amazing life. It just looks different now. Thank you.\""
    ]
  },
  {
    "ID\tQuote": "11-A\t\"Hello. Hi",
    "__parsed_extra": [
      " everyone. My name is Arisha McCray. And I was diagnosed with AIH in 2017. I have been suffering for quite a while",
      " from like six to eight months. But I'm a registered nurse. And I know I have some registered nurses out there. And you just tend to",
      " you know",
      " just kind of diagnose yourself. And you try to",
      " you know",
      " keep going and you keep going. But it had gotten so intense",
      " the fatigue",
      " the nausea",
      " the vomiting",
      " the loss of weight. I think I lost about 40 pounds",
      " you know",
      " in a couple of months."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "I wasn't interested in doing anything. And I had three grandsons at the time that was staying with me. My husband",
    "__parsed_extra": [
      " he's on the road all the time. So it was just",
      " you know",
      " it was me and",
      " you know",
      " trying to take care of them. And anyway",
      " to make a long story short",
      " I thought I was having gallbladder issues. And I was like",
      " oh",
      " crap. I'm going to have to go have my gallbladder out. So my mom",
      " you know",
      " I used to call my mom in the morning time and I'd tell her how bad I felt. I would get to work and sit in the parking lot and cry because I felt so bad. And",
      " you know",
      " I went to my primary doctor. They drew some labs. They called me back the next day. They told me",
      " go to the hospital right now. Don't stop for anything. Don't get a bag. Don't eat. Just go to the hospital. I got to the hospital. They were waiting on me. I had labs",
      " AST. They were in the thousands",
      " two thousands. But I was still smiling. I was laughing because I'm a nurse",
      " you know",
      " and you just have to continue to go on and you have to put on this facade that",
      " you know",
      " everything's okay. And they were like",
      " you can't be smiling. You can't be laughing. I know you feel bad. And I did. I felt really",
      " really bad. And hence",
      " after a lot of labs",
      " a lot of tests",
      " liver biopsy",
      " I was diagnosed with AIH."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "My disease is very hard to treat. I've tried. I've been on the azathioprine. I've been on the budesimide. Didn't work for me. You know",
    "__parsed_extra": [
      " I take it. Flare up. High doses of prednisone. As high as 120 milligrams of in the hospital. Very high doses. Kind of wean it down. As we're weaning down",
      " get to a certain milligrams of prednisone and everything goes back up. Right now",
      " I am on prednisone. I am on tacrolimus. I am on methotrexate 3. And",
      " you know",
      " nothing really. And I've also been on rituximab",
      " the injections and everything. Nothing. Nothing just really works for me. I'm just. I tell my doctor I'm his problem child because",
      " you know",
      " if something can go wrong",
      " something will go wrong with me. I might float",
      " you know",
      " start on the medicine",
      " float for a little while",
      " be doing fine",
      " you know",
      " feeling okay except for the fatigue and everything. And then",
      " boom",
      " I just kind of plummet. So",
      " yeah",
      " I've had those."
    ]
  },
  {
    "ID\tQuote": "My mom",
    "__parsed_extra": [
      " who's",
      " she's not here today",
      " but my mom",
      " she is a big advocate of",
      " you know",
      " supplements and",
      " you know",
      " diets. You know",
      " she does. She was like",
      " okay",
      " there's this avocado thing. Let's try the avocado",
      " you know. Let's try this beet diet. They say beets",
      " you know",
      " have so many properties. And then mushroom and then ginger. She's",
      " you know",
      " she's just kind of",
      " you know",
      " old-fashioned. And",
      " you know",
      " she's one. She's also a registered nurse",
      " too. And she hates to take medicine",
      " antibiotics",
      " anything. So",
      " you know",
      " she's tried me on so many. She's even tried me. She's like",
      " take this. It was like a little droplet. I forget what it's called. But it was supposed to promote energy for me. Oh",
      " my God. I forget what it was. But",
      " yeah",
      " she's always researching and",
      " you know",
      " trying to find something else besides",
      " you know",
      " the medicines that I take."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "I am going to try the Kezar",
    "__parsed_extra": [
      " the Portola study",
      " because I speak with my doctor all the time. And",
      " you know",
      " I tell him I want to get off prednisone. I'm just tired of it. I'm sick of it. So",
      " for a couple of months before",
      " he",
      " you know",
      " he talked to me about the study and everything. And",
      " you know",
      " I thought about it. I thought about it. And he said",
      " you know",
      " I'll just give you time to think about it and everything. And",
      " you know",
      " there's nothing that's really working for me. So",
      " you know",
      " I have to try to take the next step. And",
      " you know",
      " he was telling me about this study. And my mama",
      " she researched everything. She researched the company. She researched the medicine. You know",
      " she gave me this packet of about 100 pages on Kesar and the Portillo study. And she's like",
      " I think this would be wonderful for you. I think you should try it. So",
      " she was very instrumental in me",
      " you know",
      " even thinking about trying this study. Yeah. Do you have any fears about being in a clinical trial? I do. My number one fear is",
      " you know",
      " in the trial",
      " they explain to you that it's a double-blinded study and that you would",
      " you know",
      " you have a possibility. It's a two-to-one. So",
      " you have a possibility of getting the placebo versus the medicine. I mean",
      " I want to get the medicine",
      " you know",
      " up front. Because if this medicine helps me",
      " if this medicine works for me",
      " off the top",
      " I don't want to get the placebo. But I want to get the medicine",
      " you know",
      " and",
      " you know",
      " try to see if this is one that can help me. And",
      " you know",
      " basically that can just help me get some of my life back. Because my life has just been turned upside down with this AIH. And",
      " yeah",
      " that's my concern there.\""
    ]
  },
  {
    "ID\tQuote": "12-A\t\"I was diagnosed with Autoimmune Hepatitis last Friday. What a crazy few months it's been since my initial elevated liver enzymes",
    "__parsed_extra": [
      " to MRCP",
      " to biopsy",
      " and now this diagnosis. I am starting on 20mg of Prednisone with the hopes that it's enough",
      " I'll be re-evaluated in two weeks to see if the dosage needs to be altered. Reading so much about Prednisone has made me incredibly worried",
      " I have no idea how to feel about all of this but it honestly feels like this is my last day being \"\"normal\"\" if that makes sense. I take my first tablet tomorrow morning",
      " any tips before I start my treatment",
      " any experiences?"
    ]
  },
  {
    "ID\tQuote": "\n13-A\t\"Be gentle with yourself. Moods tend to destabilize and you can reach extreme ends of the mood spectrum faster than you used to be able too. So, be gentle to yourself and understand that\n\n"
  },
  {
    "ID\tQuote": "14-A\t\"I felt like I had such rage that I felt like I could control my emotions like my 2 year old. I finally started Zoloft. I have a history of anxiety and depression and it made it much worse. It sucks. I want to go on the immune suppressants but I’m going to try for a baby soon and I feel like from my research prednisone is the safest for pregnancy. Once Im done breastfeeding after the pregnancy I’m going to try and go on immunosuppressants"
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "\n15-A\t\"I also unfortunately cannot lose weight. I have been doing Orangetheory 3x a week for over 6 months (which burns 500-600 calories) and I’ve gained a few pounds and somehow lost muscle. I keep trying to tell myself if I wasn’t working out I would be heavier. I’m only on 10mg at most and typically at 5mg for the past year.\n"
  },
  {
    "ID\tQuote": "16-V\t\"Watch your weight carefully",
    "__parsed_extra": [
      " and if you ever taper down do so at a snails pace. I was on steroid for a year and a half. It caused my adrenal gland to stop producing cortisol. Now that I am off steroids I have been diagnosed with adrenal insufficiency",
      " which is a life changing diagnosis and very dangerous"
    ]
  },
  {
    "ID\tQuote": "\n17-A\t\"I am so sorry to hear that, it seems like medical conditions keep piling up with autoimmune diseases. I was in shock when I got the call and can't really remember what was said, but I do remember my hepatologist mentioning 2 years of prednisone and eventually Imuran treatment. I don't understand how that's possible considering the long-term injury of prednisone.\n"
  },
  {
    "ID\tQuote": "18-A\t\"I was a rage-filled monster",
    "__parsed_extra": [
      " but I was taking 40-50mg a day for about 9 months.   "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "The best you will feel is while you are on steroids",
    "__parsed_extra": [
      " in terms of joint pain and energy levels",
      " so enjoy it while you have it.  That was the last time I felt like my old self",
      " the morning after my first dose.  The pain was gone and energy galore.  Quoth the raven",
      " \"\"Nevermore.\"\"  LOL"
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Take as early in the day as possible",
    "__parsed_extra": [
      " to try to sleep at night",
      " and enjoy your clean house and energy.  "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Find things you lime to eat that are healthy and low cal",
    "__parsed_extra": [
      " because you may be ravenous.  "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Wean incredibly slowly off",
    "__parsed_extra": [
      " like I was going by .5 for week or two at a time once I got below 7.5.  Took MONTHS to get to zero.  "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Honestly",
    "__parsed_extra": [
      " prednisone is a tool and not the worst thing to happen.  "
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "\n19-A\t\"I was on 40mg a day when I first got diagnosed and it was pretty terrible but that was just short term while I adjusted. I have been on prednisone for 17 years now and I don't notice it too much unless I have to adjust my meds. Right now I'm only on a maintenance level of 5mg with a much stronger Imuran level though (and this is what I've been on the majority of the 17 years). I would say my worst symptoms are difficulty sleeping, weight gain (if I'm not paying close attention), and irritability (if my dosage changes).\n\nPrednisone is a very common medicine! It's used for a lot of different treatments but a lot of people go on high amount treatments for very short times which causes the more severe reactions. Once you adjust and taper off it won't be so bad!\n"
  },
  {
    "ID\tQuote": "20-A\t\"Has anyone changed to IVIG Infusion after Retuximab did not work?"
  },
  {
    "ID\tQuote": "I was in a trial for"
  },
  {
    "ID\tQuote": "4yrs. 2 doses every 6 months."
  },
  {
    "ID\tQuote": "Contracted long-term covid Covid Oct 2023. My situation deteriorated. Did not take the Infusion scheduled in January 2023."
  },
  {
    "ID\tQuote": "My rheumatologist is suggesting I try IVIG."
  },
  {
    "ID\tQuote": "Any one should improvement after Retuximab did not work?\""
  },
  {
    "ID\tQuote": "21-A\tRituximab put me in like 80% remission / improvement but the IVIg has taken me to full remission. It’s a pain to get monthly",
    "__parsed_extra": [
      " but it’s been really worth it. I will say my immune system has been super strong",
      " so at the very least you can use it for that. (This is for pemphigoid.) I’m at the infusion center for 4 days a month."
    ]
  },
  {
    "ID\tQuote": "22-A\t\"I do both as well. I was actually on IVIG prior to Rituxan though"
  },
  {
    "ID\tQuote": "\n23-A\t\"Hi all! I’m new to this group! I’m in a trial at Stanford and going to start \nR squared next week after a relapse within the year.  I’ll be on Revlimid pill and Rituxan…any one else doing this regimen or know if there’s a group for the R squared? I searched but couldn’t find one.  TIA! "
  },
  {
    "ID\tQuote": "24-A\tI don’t know the answer to your question",
    "__parsed_extra": [
      " but wish you the best with the trial! Rituxin antibody therapy has been like a miracle drug for me in keeping GPA under control. I hope this combo works for you"
    ]
  },
  {
    "ID\tQuote": "25-A\tLisa Morris how is it going on R squared? We were just told about this treatment. Any info you are willing to share is greatly appreciated."
  },
  {
    "ID\tQuote": "26-A\t\"Michele Dellegrazie Hahn I finished in June and was in remission as of April. I had to keep decreasing my Revlimid because I was having side effects and then they took me off since I was in remission and just had 2 more months of Rituxan."
  },
  {
    "ID\tQuote": "\n27-A\t\"Anyone else doing the Canopy/ Invivyd trial?  If you are interested let me know and I can give you a number to call to join the trial.  I’m participating and got my first dose this week. \n"
  },
  {
    "ID\tQuote": "28-A\t\"Michael Gilkey this is the information I was given for anyone new wanting to see if they qualify. If you join please let me know."
  },
  {
    "ID\tQuote": "\n29-A\t"
  },
  {
    "ID\tQuote": "Michael Lubbering this is a good slideshow discussing VYD222 https://investors.invivyd.com/.../b2a480a0-3f62-48c3-b93b...\""
  },
  {
    "ID\tQuote": "30-A\t\"I’ve been going through diagnosis for almost a year (had extreme migrating joint swelling consistent with RA after having Covid a year ago",
    "__parsed_extra": [
      " but tested negative for RA but coincidentally found high liver enzymes). My ANA was borderline and my biopsy was not specific to AIH and I don’t have the typical makers like high globulin."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Then my liver levels just dropped back to normal",
    "__parsed_extra": [
      " and since I was kind of a borderline case anyways we did a watch and see. Fast forward",
      " and my liver levels started to very slowly inch up (like 15-30 points over 4 months) so my Hep started me on CellCept."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Despite being on CellCept",
    "__parsed_extra": [
      " my levels continued to rise and actually the rate of increase was a little higher with the CellCept."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "My Hep seemed a little confused and a lot concerned."
  },
  {
    "ID\tQuote": "So I’m doing a round of steroids and increasing my CellCept dose."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "Is it possible that some people just cannot be treated / don’t respond to treatment?\""
  },
  {
    "ID\tQuote": "31-A\tFirst in its class drug currently under trial for the treatment of AIH (Zetomipzomib) https://kezarlifesciences.com/pipeline/zetomipzomib"
  },
  {
    "ID\tQuote": "32-A\t\"Interesting! I hope the trials end up being promising! 🤞"
  },
  {
    "ID\tQuote": "\n33-A\t"
  },
  {
    "ID\tQuote": "there are currently some other in development",
    "__parsed_extra": [
      " too."
    ]
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "https://ichgcp.net/clinical-trials-registry/NCT03217422"
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "VAY736 Amber Study seams similar.\""
  },
  {
    "ID\tQuote": "34-A\t\"Yea I’ve heard of this one. It’s also called Ianalumab. I’m excited about the results of this one … it should be wrapping up soon."
  },
  {
    "ID\tQuote": "\n35-A\t\"Wow. No immunosuppressive medication works for me aside from high dose steroids. I hope this new drug is promising.\n"
  },
  {
    "ID\tQuote": "36-A\t\"My hep is currently running an arm of this trial for AIH and believes I may be a good candidate. I’ve read some of the results from the Lupus trials and they seemed semi promising."
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": ""
  },
  {
    "ID\tQuote": "\n37-A\t\"Dang this would be a game changer, hoping it gets on the market.\n\n"
  },
  {
    "ID\tQuote": "38-A\t\"Has anyone heard of ZETOMIPZOMIB? I’m a 41 year old male who’s had this disease since I was 14."
  },
  {
    "ID\tQuote": "\n39-A\t\"I posted on here a while back about if I should move my infusion to after a concert and I did which I think was the right choice! \nIt went way better than I expected. I have an IV phobia, so that was the worst part. I could feel the medicine going in and could also feel it when the dosage increased, that was PAINFUL! \n8am till 1:30pm. My next one is in two weeks and they said will be faster, if my body can handle it of course!\n**Next day update. So far no side effects, but did start a lower dose of prednisone to ween off and man that is causing me a lot of back pain. Ugh. And peeing like crazy as usual, but today it feels like more than ever.\n"
  }
]