[
  {
    "Entry": "1",
    "Thread": "a",
    "Quote": "This is good news. Hopefully it will be approved for PV in 2026. A better treatment option for folks with PV who need too many phlebotomies.",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Phlebotomy",
    "Sentiment": "Entirely Positive",
    "URL": ""
  },
  {
    "Entry": "2",
    "Thread": "a",
    "Quote": "Here's my story. 12 years to diagnosis so it's a doozy.\n\nI still have the 2009 handwritten note from my primary care physician that my blood test showed high platelets. I call this primary care physician the Magic Doctor because he would do a magic trick for his patients at every visit. I found it weird and awkward at the time, but it makes me laugh now. Anyway, he referred me to Hematologist #1.\n\nHematologist #1 said, \"What are you doing here?\" I told him, I don't know, wasn't my idea, my doctor sent me. He said, \"I need to have a talk with your doctor about that.\" He ran some blood tests - I have no idea which.\n\nThe Magic Doctor ran another CBC, a bit higher, and sent me back to Hematologist #1. The same routine occurred.\n\nThen I was sent to him a third time. At this visit, I had my husband with me (so of course I was taken more seriously) and I asked him - what is the magic number? He said 600. (Btw, even though this was 2009, that wasn't following the WHO diagnostic criteria, it was 450 in the 2008 revision.)\n\nIn 2009, there was zero info online about MPNs. At that time, MPNs had only been recently reclassified as a blood cancer, and the CalR mutation hadn't even been discovered yet. I think I was only able to find a couple people online with high platelets - but they had extreme thrombocytosis, like 2 million, and were getting plateletpheresis (removing platelets from the blood - btw, it doesn't work in the long run because in MPNs, your bone marrow cranks out a bunch more immediately). But when I saw their blood counts were that high, I thought: well I was told not to worry by a hematologist, and my count is only 500....So I promptly forgot about it.\n\nAt every single annual physical I had, my CBC was done and my platelets were high. I had 2 subsequent primary care physicians. With both of them, I'd ask about the high platelets and they'd tell me - \"That's just the way you are.\" The only medical record I have from this period is in 2017, my platelets were in the 600s.\n\nIn 2017, I had total knee replacement surgery (TKR). TKR has a very high risk of blood clots. My platelets were in the 700s. Those pre-op reports are viewed by the surgeon, anesthesiologist, and other medical professionals and no one said a word to me about my platelets. Thank God I was given lovenox (blood thinner) after the surgery.\n\nAround that time - it's hard to pinpoint - I started having a lot of symptoms. I feel like my MPN reached some sort of tipping point. Like one year I was asymptomatic, and the next I had a boatload of symptoms. And they were debilitating. By far the worst was fatigue and headaches. I saw neurologists, a zillion physical therapists, pain management, acupuncture, you name it - nothing helped with the headaches. I never once complained about fatigue because I thought - what are they gonna do? Tell me to drink more coffee? My primary didn't know - and he was shocked when I told him about my symptoms later on.\n\nIn 2019, I had a Patient Portal! After my annual physical, I looked at my CBC and my platelets were at 1,000 and some other blood counts were high too - hematocrit, basophils, monocytes. My primary had marked it as \"normal\". I wrote him a message in the portal and said, \"my platelets have never been so high, I think something is wrong.\" He apologized to me for overlooking it and referred me to Hematologist #2.\n\nHematologist #2 was my husband's oncologist. She ran the mutation test and it came back positive for JAK2. After that, she left her position and literally vanished. Didn't take another job, just disappeared. Weird.\n\nBy this time, I've communicated with a Facebook group and was told to get an MPN Specialist, so I found one and made an appointment. In the meantime, I kept the appointment with Hematologist #2's replacement, Hematologist #3. Heme #3 wasn't too thrilled that I already had an appointment with the MPN Specialist, but I had so many questions. He told me I had ET. I asked him if I should have a bone marrow biopsy. He said no. (Wrong. ) I told him I was extremely tired and had lots of debilitating headaches. He told me that MPNs have no symptoms. (Wrong.) After he answered my questions, he'd say in a snarky tone: \"Why don't you ask Dr. ___ that?\" Turned out he'd done residency with her and I think he was jealous since she was in a much more prestigious hospital and position. Ironically, he's now the director of the cancer center at that local hospital.\n\nIn 2020, I finally see my MPN Specialist. She did a bone marrow biopsy on the first visit. And she noted that my hematocrit was high (although it wasn't incredibly high and had only recently gotten high). I brought my husband to that visit too, and he told her how sick I was. I just expected not to be believed, but she believed me.\n\nLo and behold, my BMB report comes back and my diagnosis is not ET - it's PV. My PV is weird and my platelets predominate. Because it took so long to get diagnosed, I'll never know whether I had ET that progressed to PV, or had PV all along. I'm in a clinical trial on the maximum dose of Jakafi which has more or less given me my life back, but my stubborn platelets remain in the 800s.\n\nAll told, it was roughly 12 years from the first record of a high blood count to misdiagnosis to correct diagnosis. Fortunately, I'm an outlier when it comes to this. Most people on this sub are getting diagnosed fairly quickly (even if they don't see it that way).\n\nI asked my MPN Specialist - how could this happen? How could so many doctors miss this? She said, \"I don't know.\" I started thinking a lot about it, and I realized - if it's one doctor, that's just an incompetent doctor - but when it's lots of doctors, it's a systemic problem. They don't know about MPNs. They don't know it was reclassified as cancer. They only worry when blood counts are low, not high. I have no way of changing how doctors think, but it occured to me that I could try to empower other patients. So this led to me becoming the mod here, writing the Wiki, and now the upcoming website. It's all just paying it forward. We have to have the knowledge. We have to advocate for ourselves.\n\nP.S. This is also why - unlike other medical subs - I allow diagnosis questions. I know they can be annoying, but I don't want this to happen to anyone else if I can help it. I try to answer every single one, whether I feel like it or not.",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Misdiagnosis",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1jhct4f/tell_us_your_diagnosis_story/"
  },
  {
    "Entry": "3",
    "Thread": "a",
    "Quote": "Here’s my story. In 2015, my platelets started going up, and it was the first time I had hit the “high” range. Didn’t think anything of it.\n\nFast forward to 2022 (I’m 35 going on 36). I tear my labrum in my shoulder. Doctor gives me a steroid injection and a 7 day dose of prednisone. Little did I know, they carry an increased clot risk. I start the prednisone, and I start getting a headache. Headache gets worse and worse as the week goes on. Finally, on like day 5 or 6, it’s unbearable. I still think it’s just a headache.\n\nI have a beer league softball game that night. I normally play outfield, but because of my shoulder, I pitch. I barely get through the game. I luckily only live about 3/4 mile from the complex. I get home, and my wife is trying to get our 6 month old son to sleep. At this point, it feels like a bomb has gone off in my head. I sit on the stairs for about 30 minutes in the fetal position. I finally say fuck it and power through a shower and flop down on the bed.\n\nAlmost immediately, I feel the urge to vomit. So I go throw up everything in my stomach. And my body still won’t stop retching. It goes on and on. I spend the rest of the night shaking not really sleeping. My wife decides something is wrong, finds someone to watch our son, and tries to get me to the hospital. She said I couldn’t get my pants on or walk down the stairs.\n\nShe gets me to the hospital, and they tell me I have a migraine and they try to send me home with some medicine. My wife says hell no, scan his head. They say ok, and come back and ask her if I hit my head because I am having a brain bleed…aka a stroke. The headache was the clot forming. The bleed started right after my softball game when I felt like a bomb went off in my head.\n\nI’m transported to another hospital, and my wife happens to tell the hematologist that I have elevated platelets. So a light bulb goes off, and they put me on blood thinners and do some testing. Platelets were only around 650 at this time. They find out I have ET JAK2+. Spent 8 days in the ICU.\n\nThat’s how I found out I had ET. ICU doctor wanted to put me on HU. But me and my wife read about the side effects, especially around fertility, and we both said hell no. And I got a referral to my current hematologist, who got me on Pegasys (my wife, god bless her, actually found this doctor). And I’m so thankful. Pegasys has been great. My platelets are down to 299, and my allele burden is 1.7% (1.4% is undetectable), down from 6% at initial diagnosis.\n\nPrior to diagnosis, I was in excellent physical shape. I worked out every day, and was in very good cardiovascular shape. Not trying to brag or anything, but I just bring it up because that is what likely saved my life (in addition to who I married). The doctor credited my quick recovery to me being in excellent shape. Protocol for a stroke was 14 days in the ICU, but I was able to get out in 8. And with my particular type of stroke, 1/3 of people die, 1/3 have debilitating effects, and 1/3 have minimal effects. I fall into that last third.\n\nI’ve commented on parts of my story, but I’ve never actually spelled it all out before and given the full story. Thank you so much for creating this topic. Writing this out (and really this entire community) has been very helpful to me.",
    "User Name": "u/No-Employment2539",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Misdiagnosis",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1jhct4f/tell_us_your_diagnosis_story/"
  },
  {
    "Entry": "4",
    "Thread": "a",
    "Quote": "Love reading everyone's stories here! As much as it sucks, it's comforting in a weird way to know about others struggling with the same thing.\n\nFor me, it really started in 2020 (23 at the time) I believe, I just hadn't realized it yet. I was on my computer one night in November 2020 and saw a large blind spot with scintillating scotoma (flashing colorful zig-zag patterns in periferials). This was the first time it had happened to me so obviously was freaked out. I told my girlfriend at the time about this but she was rather dismissive and as it began to resolve without other symptoms I began to calm down. Did more research shortly after and realized this was a classic migraine aura symptom, but scheduled a doctors appointment to be sure.\n\nFast forward a few weeks, at the doctors, had blood work and head MRI ordered. Everything was normal except my platelets (740) and HCT (52%). I even messaged my doctor about the platelets being so high in particular but he was dismissive about it and assured me everything was fine. Looked like it was just migraine with aura coinciding with starting a new job at the time and all the stress associated with that.\n\nLife went on as normal for the next 4 years, I'd have occasional migranes and itching after showers (assumed it was just dry skin, had been that way for as long as I can remember) but nothing else worrying. So assuming I was young and healthy I didn't go to the doctor at all over that period of time. This would change soon though.\n\nOctober 2024, I'm on a 3 week long work trip to Montreal. I'm out being a tourist one weekend when I notice more bloating than usual after eating. The next day I wake up, and after stopping by a cafe on the way to a museum for a pastry get very bad lower back and epigastric pain.\n\nAssume I just got some stomach bug and my lower back is tired from doing so much walking or lifting the wrong way at the hotel gym etc. Over the next couple of days this gets a bit better and I had back home to Chicago.\n\nHowever, it keeps flaring up again. Especially after eating, get back/epigastric pain and bloating. Finally decide after a month of this that I should go to the ER.\n\nFindings? Platelets and HCT about where they were the last time I had bloodwork in 2020 still. alkaline phosphatase is elevated (low 200s). CT is normal besides enlarged spleen at 15cm. Get sent home with a GI referral.\n\nI feel somewhat relieved, but there's still so many questions that didn’t quite add up. On top of that, symptoms continue to get worse and worse, I'm barely eating at this point because of how much pain I'm in afterwards. Manage to get an appointment with a GI a week early that my mom knew (she works in hospital administration). He orders a liver ultrasound and additional bloodwork. Go the same day for both. Now almost all my liver enzymes are elevated on bloodwork, not just alk phos. Get a call back right away after the ultrasound saying I have portal vein thrombosis, enlarged liver/gallbladder/pancreas/billary duct and to go to the ER immediately.\n\nTrying to shorten this already excessively long story: I spent a total of 3 weeks in the hospital. This is where I finally had a MPN panel done showing JAK2+ with 24.5% VAF. TIPS procedure to relieve portal hypertension and subsequent thrombectomy to clear things out. Liver biopsy to make sure that was normal as it became enlarged and appeared cirrhotic on CT from portal hypertension (still SO thankful it came back normal)\n\nIt's odd that despite all this I feel greatful it's \"just\" an MPN. I'm especially grateful I had the right people to help me figure out what was going on before it got worse. Intervential radiologist especially was such a huge advocate for me at the time. But when cirrhosis/liver failure and malignant tumors are in the differential diagnosis, it's kind of a relief that its \"just\" a chronic blood cancer and complications from it being untreated for so long.\n\nI recently posted my BMB results here because they were a bit confusing and go to follow up with my MPN specialist Tuesday. The bone marrow pathology notes they favor a diagnosis of ET, but my MPN specialist thinks it's PV based on blood work. So still waiting on \"final\" diagnosis as it's not too clear cut.\n\nIf you made it this far thanks for reading, really ended up typing way more than I thought I would. It was therapeutic to put it all down though regardless.",
    "User Name": "u/WhaleSmacker17",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Misdiagnosis",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1jhct4f/tell_us_your_diagnosis_story/"
  },
  {
    "Entry": "5",
    "Thread": "a",
    "Quote": "\nHi there, first time posting and wondering if anyone has had a similar experience and might be able to guide me in the next direction. I'm 44/f living in the USA.\n\nMy WBC/RBC/Hematocrit/Hemaglobin levels have been elevated for a few years now, but my PCP never saw cause for concern (another story there…he’s a doctor I’m not going to anymore!) After eating healthier and working out for a while, I raised this concern again with another doctor when my bloods came back with WBC at 12.4, RBC 5.56, HGB 16.4 and HCT 47.8 (platelets were within normal range, 369). I booked an appointment with a haematologist after this pcp suspected Polycythemia Vera. I don’t know how we got to that conclusion with such vague bloodwork but I went for the follow up. I’d been drinking a LOT more water and herbal tea before my haematologist appointment, and my levels dropped a bit: WBC 11.3, RBC 5.45, HGB 15.5, HCT 45.4, platelets 335. Right at the start he said he strongly felt this might be secondary Polycythemia based on my levels dropping from hydration and ran the further tests that required external labs. Ferritin came back normal (32), EPO 3.9, for the most part everything normal. JAK2 negative however that blood test did return an RUNX1 gene mutation result (under “unknown clinical significance”). Seeking advice on what my next steps would be. A bone marrow biopsy has not been run. I was left sort of hanging, to figure out what is causing the raised levels on my own, and I don't know what the RUNX1 mutation is about.\n\nDoes this require further exploration with an MPN specialist? I do experience fatigue, very frequent migraines, burning/tingling in the fingertips sometimes (running them under hot water seems to alleviate this), and chest pain (chest pain is not a regular thing, only happening occasionally…baby aspirin seems to help). Thanks, and apologies for the long post!\n\n*To add to this, I do not smoke/never have, no sleep apnea (I'm pretty sure!), I rarely eat meat, haven't drank alcohol in over 7 years!\n\n\n\n",
    "User Name": "u/greatredditname212\n",
    "Channel": "Reddit",
    "Demo": "44 F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Pre-diagnosis",
    "Topic 3": "Community Support",
    "Sentiment": "Neutral",
    "URL": "https://www.reddit.com/r/MPN/comments/1bgh9yq/prediagnosis_megathread_comment_here_if_you_are/"
  },
  {
    "Entry": "6",
    "Thread": "a",
    "Quote": "Brisk walking 45min + daily helps me too. I can tell when I miss it. I also know that if I have a really busy day, I'll be tanked the next day, so I plan around it (busy day followed by a rest day) whenever possible. Naps sometimes help, but not always. I prioritize the most important tasks on any given day, and anything else I get done is gravy. Every day I re-assess/prioritize my tasks. Simplifying my life and saying \"no\" as much as I need to is also very helpful.\n",
    "User Name": "u/katiespecies647",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Symptom Management ",
    "Topic 2 ": "Excercise ",
    "Topic 3": "Fatigue",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1czlgxh/fatigue_i_need_your_tips/"
  },
  {
    "Entry": "7",
    "Thread": "a",
    "Quote": "I find that at least 40 minutes of moderate exercise each day keep my symptoms at a minimum. This includes fatigue. Running or brisk walking works the best for me. 47M, PV (JAK2, high platelet count), Pegasys + Jakavi.\n",
    "User Name": "u/ToreKjellow",
    "Channel": "Reddit",
    "Demo": "48 M",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Symptom Management ",
    "Topic 2 ": "Excercise ",
    "Topic 3": "Fatigue",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1czlgxh/fatigue_i_need_your_tips/"
  },
  {
    "Entry": "8",
    "Thread": "a",
    "Quote": "ChatGPT is not allowed to say \"I don't know\" because people perceive that as unhelpful, so it will make a guess instead and pass that off as factual. I have seen it give so many wrong answers to people about MPNs. I figured out a way to prevent this somewhat by giving it permission to say \"I don't know\".\n\nI'm not thrilled about ChatGPT for medical questions, but this is the real world and telling people not to use it is like telling them not to Google. They're gonna do it anyway. IMO it can be a good tool for coming up with a list of questions for your next doctor visit, but it cannot be a substitute for a real doctor.\n\n",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Digital Experience",
    "Topic 2 ": "AI",
    "Topic 3": "Community Support",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1ltwy41/if_you_must_use_chatgpt_heres_a_trick_always/"
  },
  {
    "Entry": "8",
    "Thread": "b",
    "Quote": "Great advice. Large language models that power chatbots like ChatGPT aim to please, so they’ll give an answer but it may not be accurate.\n\nSimilarly, when asking a question, don’t share what you think the answer is because it will try to respond with something similar to what you suggested, even if it’s not the best answer. You’re better off giving as much context as possible without sharing assumptions. It’s not perfect either so it’s also worth checking the sources from the response to ensure ChatGPT correctly interpreted the source.\n",
    "User Name": "u/brennanx1",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Digital Experience",
    "Topic 2 ": "AI",
    "Topic 3": "Community Support",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1ltwy41/if_you_must_use_chatgpt_heres_a_trick_always/"
  },
  {
    "Entry": "8",
    "Thread": "c",
    "Quote": "And it doesn't have a good track record for medical sources. I shared one study a while back that showed only 40% of the sources were relevant. I think Google's search AI is the worst when it comes to that.\n",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Digital Experience",
    "Topic 2 ": "AI",
    "Topic 3": "Community Support",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1ltwy41/if_you_must_use_chatgpt_heres_a_trick_always/"
  },
  {
    "Entry": "9",
    "Thread": "a",
    "Quote": "I'm in NM and the healthcare system here, overall, is an embarrassment to the profession. Thru all my health issues, working has been hard & I'm now on medicaid. Any clue how to get them to pay for NGS & or going out of state to see a specialist?  If not, any idea who is most affordable near NM or \"scholarships/grants\" for low income?\n",
    "User Name": "@jenniferfuertes2668",
    "Channel": "Youtube",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Access to Care",
    "Topic 2 ": "Financial Coverage",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Entirely Negative",
    "URL": "A Conversation with an MPN Specialist: Polycythemia Vera - YouTube"
  },
  {
    "Entry": "10",
    "Thread": "a",
    "Quote": "Looks like the trial is getting good results and even helped with symptoms. Rusfertide is not chemo. It's a hepcidin mimetic. Hepcidin is a hormone that helps regulate iron. Iron is needed to create red blood cells, so this drug slows the release of iron into the bone marrow for red blood cell production and lowers hematocrit. I've yet to hear anything bad about this drug from trial participants.\n\nIf you are tired of phlebotomies, check out the trial. https://www.polycythemiavera-clinicaltrial.com/\n",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "10",
    "Thread": "b",
    "Quote": "I check on this drug everyday….waiting on its approval\n",
    "User Name": "u/OrangeChicknTender\n",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "10",
    "Thread": "c",
    "Quote": "Have you seen the latest trial info? A lot more locations.\nhttps://clinicaltrials.gov/study/NCT05210790",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "10",
    "Thread": "d",
    "Quote": "I guess I get it, but not gonna say it didn’t hurt a little.\nYes. I’ve emailed protagonist therapeutics to try and get into a trial. My husband needs to iron out before he can receive a BMT. The senior vice president emailed back and said there was no trial for him. That was it, no other information or any suggestions were given. I guess I get it, but not gonna say it didn’t hurt a little.",
    "User Name": "u/OrangeChicknTender\n",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Access to Care",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "11",
    "Thread": "a",
    "Quote": "Doctor just asked me if I want to go this trial and he hopes I get rux as my hct is going up again plus white cells and I’ve got very low iron prob due to phlebotomy my ferritin level was 13 and interferon have noticed that I’m feeling down more days than not also I have enlarged spleen at 14.9 cm last time it was checked just wondering what’s ppls thoughts",
    "User Name": "u/Mission-Cancel609",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Clinical trial consideration",
    "Topic 2 ": "Ruxolitinib",
    "Topic 3": "Novartis",
    "Sentiment": "Neutral",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "11",
    "Thread": "b",
    "Quote": "\nIs this the one? https://www.birmingham.ac.uk/research/crctu/trials/mithridate\n\nI'd say go for it. Make sure you talk over all your concerns, of course. The decision is a deeply personal one. But to me, this looks like a well designed trial. It will be an interesting experience, and you might end up getting some tangible benefits.",
    "User Name": "u/WhisperINTJ\n",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "11",
    "Thread": "c",
    "Quote": "Yes that is the one I’m just worried if I get put in the hydoxy group\n",
    "User Name": "u/Mission-Cancel609",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "11",
    "Thread": "d",
    "Quote": "In a lot of trials, once the trial reaches its end date, you have the option of going on the trial drug.\n\nFor example, in the Rusfertide trial, for 8 months one group received current treatment plus Rusfertide and the other group received current treatment plus placebo. At the end of 8 months, patients were free to receive Rusfertide only or Rusfertide plus their current treatment (known as a crossover trial).\n\nSo ask whether you would get that option if you ended up in the hydroxyurea group.",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "12",
    "Thread": "a",
    "Quote": "I am a 38-year-old male based in Denver, Colorado USA who was recently diagnosed with ET by the first hematologist I saw and with PV by the second (Condition was discovered when I went to the ER with an enlarged spleen, I have platelets in the 800 - 900 range but also have hematocrit of 50 and hemoglobin of 16-16.5, leading the second doctor to suspect PV).\n\nI am scheduled to see a local MPN specialist and will likely start an interferon soon to reduce symptoms and hopefully fibrosis over time. My insurance (United Healthcare) requires you to try Pegasys first and will only approve Besremi if you have an adverse reaction to Pegasys. The did deny our prior authorization request for Besremi. I have two questions for you all about this:\n\nAre there reasons to prefer Besremi other than its more favorable side effect profile and the need to administer it just once every two weeks?\n\nDoes anyone have strategies for getting your insurance company to cover Besremi from the start if they deny it initially?\n\nThank you all—very glad to have found this community.\n\n",
    "User Name": "u/nelophonecall",
    "Channel": "Reddit",
    "Demo": "38 M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Diagnostic Jounrey",
    "Topic 2 ": "Insurance Coverage",
    "Topic 3": "Pegasys",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1c8c433/getting_insurance_to_cover_besremi/"
  },
  {
    "Entry": "12",
    "Thread": "b",
    "Quote": "Hey! I have United Healthcare and my doctor is switching me to Besremi from Pegasys. United Healthcare wouldn’t pay for it even with the pre authorization, so the manufacturer ended up paying for it, $0 out of pocket.\n\nHave you tried Pegasys? It worked really well for me.\n\n\n\n",
    "User Name": "u/Origamishi",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Insurance Coverage",
    "Topic 3": "Pegasys",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1c8c433/getting_insurance_to_cover_besremi/"
  },
  {
    "Entry": "12",
    "Thread": "c",
    "Quote": "If you are diagnosed with PV, Besremi was made a first-line treatment last year at the American society of Hematology conference, and was then put into the 2024 NCCN guidelines (the NCCN makes all the official protocols for diagnosis and treatment of cancer in the USA). Most of the work is done by your doctor. They need to fight it out with United but insurance companies usually abide by the NCCN guidelines.\n\nI also recommend contacting the manufacturer, they will give you a case manager to help you get approval and help with costs. https://www.pharmaessentiasource.com/\n\n",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Insurance Coverage",
    "Topic 3": "Pegasys",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1c8c433/getting_insurance_to_cover_besremi/"
  },
  {
    "Entry": "13",
    "Thread": "a",
    "Quote": "I recently had an ultrasound of my liver done & the results came back showing damage to my liver. Has anyone else struggled with their liver being on Besremi? What was the game plan with your doctor? I’m currently on 250 every 2 weeks. I would hate to have to stop the besremi since it has helped with my symptoms SO much, but I don’t want to cause permanent damage to my liver.\n\n",
    "User Name": "u/States_",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Besremi",
    "Topic 3": "Liver impact",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1lufpj1/et_on_besremi_liver_concerns/"
  },
  {
    "Entry": "13",
    "Thread": "b",
    "Quote": "My husband had liver toxicity so he unfortunately cannot handle Besremi. They switched him to Jakafi instead as his ET progressed to PV. Before Besremi he was on anagrelide with ET and that was helpful in managing his symptoms. Hope that helps!",
    "User Name": "u/bawdy-awdy-awdy-awdy",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Caregiver",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Besremi",
    "Topic 3": "Liver impact",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1lufpj1/et_on_besremi_liver_concerns/"
  },
  {
    "Entry": "13",
    "Thread": "c",
    "Quote": "I’ve been taking a milk thistle supplement when my enzymes got high from Besremi. Went in about a month later and my enzymes are perfect again. I asked my MPN specialist if it’s okay to take and she wasn’t against it. They shouldn’t be taken daily consistently, so I’m stopping for a while and I’ll start up again. Maybe ask your MPN specialist if that’s okay for you too. Also, avoid alcohol.\n",
    "User Name": "u/z_iiiiii",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Besremi",
    "Topic 3": "Liver impact",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1lufpj1/et_on_besremi_liver_concerns/"
  },
  {
    "Entry": "14",
    "Thread": "a",
    "Quote": "Thank you for this MPN journal. Using the tool helps with my anxiety. \n",
    "User Name": "u/Epeeist_Esquire",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Digital experience",
    "Topic 2 ": "Journal app",
    "Topic 3": "Mental Health",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1lxyd71/mpn_journal_endorsed_by_ruben_mesa/"
  },
  {
    "Entry": "15",
    "Thread": "a",
    "Quote": "In the MPN Journal app, 50% of patients report experiencing considerable or extreme difficulty due to their fear of disease progression or worsening of their MPN. Half of these patients rate these concerns as 8 out of 10 or higher. This issue receives little attention, yet its impact is therefore enormous. What are your experiences? Is this ever discussed during consultations? Is any action taken there?",
    "User Name": "u/johnhoogland",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Fear RE: Progression",
    "Topic 2 ": "Mental health",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1lsv0lh/comment/n1zjzrw/?context=3"
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "16",
    "Thread": "a",
    "Quote": "Does anyone use a home hematocrit testing kit? And if so what brands and how well do they work? I’m looking at buying one because my hematocrit level was 45.7 yesterday so I went to get a phlebotomy today and my hematocrit level was down to 38. So I want to start monitoring it at home.",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Home Tests",
    "Topic 2 ": "Device Preference",
    "Topic 3": "Hematocrit",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "17",
    "Thread": "a",
    "Quote": "So went to specialist on Thursday, I'm in the clinical trial for my Polycythemia Vera. Got my first injection then.  \nWent to work today feeling pretty good, possible side effects; flu like symptoms for a couple days? Went home at lunch feeling a little achy. Thought I would take a quick nap, woke up 7 hours later. Felt better though.",
    "User Name": "Monica Crowe",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical Trial",
    "Topic 2 ": "Participant Experience",
    "Topic 3": "",
    "Sentiment": "Somewhat positive",
    "URL": "https://www.facebook.com/profile/100000258958181/search/?q=trial"
  },
  {
    "Entry": "18",
    "Thread": "a",
    "Quote": "I’ve experienced hair loss / hair thinning and my vision has gotten a bit worse. This happened after being on 500mcg for 2-3 months and injecting every 2 weeks. The first couple months I didn’t experience any side effects and honestly felt super normal besides the occasional migraine since my platelets were still super high. When my platelets took the first big drop based on my lab results, I remember feeling weird and having flu like symptoms. I would note down side effects you run into and bring them up with your doc as needed. I’m taking minoxidil and finasteride to try and combat the hair loss but still a work in progress.\n\nI started with 50mcg and increased by 50mcg every 2 weeks as long as my blood work looked normal. I always double checked with my doc to make sure I was in the clear to increase dosage. Once I reached 500mcg, I stayed on the dosage injecting every 2 weeks. When I ran into the side effects mentioned above, I told my doc and I’ve switched to injecting monthly only.\n\nPrior to starting treatment, my spleen size was normal per the screening so I can’t say for sure if it has decreased at all since I haven’t had to get it checked again.\n\nLuckily I haven’t had to travel with it. The besremi website has some helpful tips on how to prepare if you do need to. Injecting every month has been game changer since I don’t need to worry about injecting too often. There’s a helpful besremi support group on Facebook that I would recommend joining too! It’s named “besremi support” and the group image is a peacock.\n\n\n",
    "User Name": "u/renoka",
    "Channel": "Reddit",
    "Demo": "30s M",
    "Persona": "Patient ",
    "Country": "USA",
    "Topic 1": "Treatment",
    "Topic 2 ": "besremi",
    "Topic 3": "Self-administration",
    "Sentiment": "Mostly positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1hdgciw/comment/m22jqyt/?context=3"
  },
  {
    "Entry": "19",
    "Thread": "a",
    "Quote": "recently found this group and wanted to share. I’m 32M and just self-administered my first dose of Besremi this morning. my PV/MPN journey started in July 2023 when I was hospitalized with a major abdominal blood clot that had clotted my portal vein and splenic vein. I was told it was a 7/10 in severity, and could have been fatal had I waited a few more weeks. I began taking Eliquis 2x per day and eliminated alcohol. I had quarterly CTs to monitor the clot, and had regular blood tests to try to figure out what was going on. I tested JAK2+ in the spring of 2024, at which point my hematologist believed I had an MPN. Got a second opinion in July, and then BMB confirmed PV in September. it’s been a journey, and this is just the next step in that journey, but I’m trying to stay hopeful and optimistic about beginning to attack the root cause. my spleen is also still chronically clotted, and is enlarged, so I’m hopeful my spleen size will reduce as well.\n",
    "User Name": "u/benhpage",
    "Channel": "Reddit",
    "Demo": "30s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Diagnostic Jounrey",
    "Topic 2 ": "Blood clot",
    "Topic 3": "Initial treatment",
    "Sentiment": "Somewhat positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1hdgciw/started_besremi_today/"
  },
  {
    "Entry": "20",
    "Thread": "a",
    "Quote": "I've (34F) been on hydroxyurea for...probably 6 years. I have PV and thrombocytosis. In the past year I've had horribly reactive reynauds in all weather types. Doc says \"i dunno, wear gloves.\" Some preliminary research shows correlation with small vessel damage and long term HU use. This new doctor is obsessively pursuing my platelet numbers which is not what I'm used to and it's driving me crazy as she increases my dose every month. She told me there's \"no limit to the amount we can go up as long as your WBCs are safe.\" Uuuhhh.....news to me. And she HATES Jakafi.\n\nMy PV symptoms are nonexistent and platelets are 550.\n\nHow is everyone else doing? Do you get this symptom or have any resources saying similar vessel risks? What dosage are you on, or peaked at?\n",
    "User Name": "u/noll_ravar",
    "Channel": "Reddit",
    "Demo": "34 F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment",
    "Topic 2 ": "hydroxyurea",
    "Topic 3": "Vessel risk",
    "Sentiment": "Mostly negative",
    "URL": "https://www.reddit.com/r/polycythemiavera/comments/1m4v8dg/hydroxyurea_long_term/"
  },
  {
    "Entry": "20",
    "Thread": "b",
    "Quote": "I haven't heard about blood vessel risks with hydroxyurea. (Be careful when researching that you aren't looking at studies on people with sickle cell disease.)\n\nThere is a limit to hydroxyurea dosage. I think the top is 2,500 mg, but I haven't come across anyone on more than 2,000. If your platelets remain uncontrolled (for 3 months iirc) on 2,000 mg, then it's officially considered a failure of hydroxyurea and your treatment should be switched. However, most doctors are more flexible about switching before it reaches that point. The above failure criteria is what's in the American NCCN guidelines.\n\nBesremi interferon might be a problem for you due to the Reynaud's. Interferons can exacerbate autoimmune disease. It is now the official preferred treatment for PV instead of hydroxyurea. If you have a rheumatologist, you might want to ask them about it, as well as the hematologist.\n\nWhy does your hematologist hate Jakafi when it's a common treatment for PV and the mainstay of MF treatment? I hope she's not putting her MF patients on hydroxyurea only. Jakafi is well tolerated, helps with symptoms and decreases allele burden in some people. Main downside is the cost/insurance.\n\nIs she an MPN specialist on this list (USA only)? https://mpncancerconnection.org/mpn-experts/.\nIf not, I'd consider switching.\n",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "20",
    "Thread": "c",
    "Quote": "As far as I know, there is no blood vessel risks when using HU. I also have PV, thrombocytosis and Reynauds. But my podiatrist just said, wear socks. I'm cool with that, honestly, I don't want to take any more medication.\n\nI only notice in winter. I am pregnant now and not on HU, and my platelets average about 1 million when unmedicated. My platelets are the lowest they have ever been at 650K.\n",
    "User Name": "u/Csherman92",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "21",
    "Thread": "a",
    "Quote": "I usually don’t feel frustrated by this, but just got labs done and am feeling a little defeated. Not yet on medication. I have a lot of other medical issues I am working through so balancing out medications has been a challenge Please let me know if anyone has experienced this and if you needed to get more frequent phlebotomies because of it. Maybe I am just overthinking it, but 50 days post #1 my numbers were still lower than pre #1. But now about 100 days post #2 and this is the highest my numbers have EVER been. I have another phlebotomy scheduled next Monday. I have been experiencing extremely intense fatigue for the past two weeks, unsure if related.\n",
    "User Name": "u/purrfectlybrewed",
    "Channel": "Reddit",
    "Demo": "30s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Phlebotomies",
    "Topic 2 ": "Fatigue",
    "Topic 3": "Treatment search",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "21",
    "Thread": "b",
    "Quote": "I started with 6 phlebotomies in 6 weeks, then every 2, then once a month until meds finally stabilized my numbers. Not had any in over a year now.\n\nDoc wanted my HCT 48 or less AND hemoglobin 15 or less.\n\nHang in there. It will get better.\n",
    "User Name": "u/ARLibertarian",
    "Channel": "Reddit",
    "Demo": "30s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "phlebotomies",
    "Topic 2 ": "Treatment search",
    "Topic 3": "",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "21",
    "Thread": "c",
    "Quote": "8.5 years since diagnosis. Stay strong, my levels were all over the place whilst on initial phlebotomies and trying out different medication - from what I recall it took 18 months for things to reach a happy place and level out. ",
    "User Name": "u/Falcon_Capable",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "phlebotomies",
    "Topic 2 ": "Treatment search",
    "Topic 3": "",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "22",
    "Thread": "a",
    "Quote": "Diagnosed late 2019, then told mid 23 due to the WHO wide widening criteria, the doctor said I didn't have, but a month ago I was told, I should have never been told this, as I do. Crazy stuff\n",
    "User Name": "u/u/Feeling-Interview-65",
    "Channel": "Reddit",
    "Demo": "50s M",
    "Persona": "Patient",
    "Country": "IRE",
    "Topic 1": "Diagnostic Journey",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "Somewhat positive",
    "URL": "https://www.reddit.com/r/polycythemiavera/comments/1h2ndy3/how_long/"
  },
  {
    "Entry": "23",
    "Thread": "a",
    "Quote": "Anyone on rusfertide trials? How do you feel on it and has your iron improved? I know it’s applied for fda approval but trying to research it. Thanks\n",
    "User Name": "EW Ranch",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.facebook.com/groups/223321691158606/search/?q=clinical%20trial"
  },
  {
    "Entry": "23",
    "Thread": "b",
    "Quote": "I also am following this and researching it. I’ve talked to a couple of ladies who are in the trial and both have told me of mild symptoms. Low grade fever for a few days and injection site irritation. Both have not had to have any phelbotomy since starting it and both told me they plan to continue with it after the trial. I am praying this is the answer so many of us are needing and hoping for. Keep us posted with what you find out. I very much am hoping to get on board with it.",
    "User Name": "Sally Woldring Cooper",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "23",
    "Thread": "c",
    "Quote": "Hey Sally -- gosh me too! My liver enzymes went to 265 ish for both alt and ast after 3rd dose of interferon. Not sure if doctor will let me keep taking. I’ll see next Tuesday. I was responding so well. I hope it helps us!",
    "User Name": "EW Ranch",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "23",
    "Thread": "d",
    "Quote": "EW Ranch the benefit of interferon is the ability to slow disease progression, I’ll stay on besremi as long as I can",
    "User Name": "Brandi Walker",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "23",
    "Thread": "e",
    "Quote": "Brandi Walker they don’t yet know if Rusfertide will slow progression as no one in the clinical trials had been on it long enough to give that information but I am hoping it will as it has far fewer side effects than any of the current meds.",
    "User Name": "Sally Woldring Cooper",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "23",
    "Thread": "f",
    "Quote": "I’ve heard a few top drs talk about it recently and they made it sound to be more beneficial as a combination therapy to allow for lower doses of other meds. I’ve also heard it referred to as a phlebotomy by medicine.\nMy dr has a couple patients that’s been on it for a while from early trials and while it works well with little side effects, they can’t stop or their counts rise. Sounds like it happens if they miss a dose too.\nI guess time will tell. I also wonder how expensive it will be.",
    "User Name": "Steven Ames",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "23",
    "Thread": "g",
    "Quote": "blood levels? My PV is a bit complicated, and I've still not got my bloods completely controlled.\nInitially, the dose of pegasys i was on, didn't change my numbers, only elevated my liver enzymes, and then once my dose was halved, my levels began coming down.\nThen it was increased, i did phlebotomy, and my numbers blew out of the water. If i get a really bad virus, my immune system seems to over ride the pegasys, and i watch my hands get red, in a matter of days. I don't understand it, and my haematologist doesn't seem to either. I've had weird things happen, and i don't think he's experienced them with anyone before. Blood test today, so I'll be interested to see my numbers on Tuesday, but not looking forward to his comments.\nInitially my hb was 199, and pegasys brought it down to 181, and venesections since then, i got it down to 143, but always, 3.5 weeks after venesection, it goes back up 5 points, so last blood test, it was 148. It's only my red cells which are elevated. All other bloods, are completely within normal range now, including liver.\n",
    "User Name": "Donna German",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "23",
    "Thread": "h",
    "Quote": "Hi Donna German -- sorry I was referring to liver enzymes. That’s awesome so it did eventually come down. I hope you can get your numbers controlled. I seemed to respond quick but my liver enzymes has me scared they will boot me from the med. I feel same. My dr doesn’t seem to know a lot about pv. I am getting central apneas when my ferritin is low and they look at me like cross eyed. Also when my ferritin is low my periods stop and sends my body in artificial menopause and of course they don’t believe that either. I’ve been doing this long enough to know how my body reacts to low ferritin. They act like I am full of sh*t. I just really need Besremi to work for me and enzymes to go down. I wish you the best of luck. Pv is non stop roller coaster\n",
    "User Name": "EW Ranch",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "24",
    "Thread": "a",
    "Quote": "Yes, I have been on the trial for years. I have not had a phlebotomy since I started on it, iron levels are great. My only side effect is injection site and that mostly went away with time. I highly recommend it if you can get in a trial.",
    "User Name": "Catherine Kelly",
    "Channel": "Facebook",
    "Demo": "61 F",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "24",
    "Thread": "b",
    "Quote": "Hi Catherine Kelly -- and do you have energy? Have you taken it all that time? I thought i read somewhere that it would only be used for 6 months at a time.",
    "User Name": "Donna German",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "24",
    "Thread": "c",
    "Quote": "Energy depends on the day if you know what I mean. I am 61 and have likely had PV for many years but wasn't diagnosed until about 6 years ago. As a result of treatment and control of my HCT by MD Anderson I haven't had chest pain or a debilitating migraine for years. I started on the trial at the beginning and love it. I am retired and we travel all over in our motorhome and I don't have to get weekly blood work and 2-3 phlebotomies a month. It can be difficult when you are in a different state monthly! My energy has improved since I started the trial, likely from not having phlebotomies so often, they can really wear you down.",
    "User Name": "Catherine Kelly",
    "Channel": "Facebook",
    "Demo": "61 F",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "25",
    "Thread": "a",
    "Quote": "I was not in the PTG300 study, but Sapablursen the other trial drug that involves hepcidin. Absolutely controlled HTC, but no recovery of iron whatsoever. I felt horrible on that drug and stopped using after 9 months.",
    "User Name": "Steve Szumuski",
    "Channel": "Facebook",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Sapablursen",
    "Topic 3": "",
    "Sentiment": "Entirely negative",
    "URL": ""
  },
  {
    "Entry": "26",
    "Thread": "a",
    "Quote": "Hi everyone, I was diagnosed with PV 3 years ago, am 33 years old, I have been doing phlebotomy every 2 to 3 months and taking aspirin almost daily.\nI have been following a new drug called Rusfertide (being developed by Protagonist Therapeutics) it’s currently in phase 3 clinical trials and is on track to be filed for FDA approval by end of 2025, it’s showing really promising results in managing PV !\nAnyone here by chance is participating in such clinical trails ? I would love to know more details !",
    "User Name": "Mustafa Mohammed",
    "Channel": "Facebook",
    "Demo": "50s M",
    "Persona": "",
    "Country": "",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "",
    "Sentiment": "Neutral",
    "URL": ""
  },
  {
    "Entry": "26",
    "Thread": "b",
    "Quote": "I was diagnosed with PV 4 yrs ago. Jumped into Pegasys as a treatment (to hopefully delay MF and AML). My JAK2 allelle burden became undetectable last year. And we significantly lowered the dose of medicine from 90mcg weekly to 72mcg every other week currently, significantly reducing the side effects along the way. I'm not against rusferitide, but for a young person like yourself (I'm 46 -- relatively young too), pegasys is a strong option to delay disease progression.\nVideo: https://www.youtube.com/watch?v=R4SdF6FrnbE&t=1s\nReferences: https://mylongevityjourney.blogspot.com/.../interferon.html\nMy Dr (Jason Gotlib) offered Rusfertide, as he's part of the team running clinical trials. I put more weight on disease progression than just eliminating phelebotomies (though that's valuable too!!).\nYour best chance is to find a Dr who's part of the Phase III clinical trials, who can add you to the trial if it's still recruiting.",
    "User Name": "Gokhan Can",
    "Channel": "Facebook",
    "Demo": "46 M",
    "Persona": "Patient ",
    "Country": "USA",
    "Topic 1": "Clinical Trials ",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "26",
    "Thread": "c",
    "Quote": "They talked about it last fall at the NYC MPN Patient Conference and said it showed great success and seem to be the future phlebotomy alternative and thought to used in combination when other treatments. I’m sure it’s going to be expensive too and it will be interesting if insurances will pay for it, along with another expensive meds.\n",
    "User Name": "Steven Ames",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "26",
    "Thread": "d",
    "Quote": "I've been told that when the trials are over & it's available for prescription that it will cost over $17 thousand a month, which is nearly Jakafi prices. ",
    "User Name": "Patti Willard",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "27",
    "Thread": "a",
    "Quote": "On 9/20/23 I heard those words nobody wants to hear. You have cancer.! \nBut I got into a drug trial and things seem to be working very well. I haven't had phlebotomy since 3/25. I got to go 5 weeks before seeing cancer team. Numbers are almost all in normal range, lost some weight. Having more good days than bad ones. Don't see them again till 7/25. Should get the rest of the drugs then. Next time I see them after that will be after bone marrow & complete labs for news on what's next!",
    "User Name": "Monica Crowe",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "28",
    "Thread": "a",
    "Quote": "Besremi made a humongous difference for me. I was on another interferon injectable prior (Pegasys), and I was very happy with it. However, Besremi has completely changed the game for me so far. I happen to tolerate it well which is not the case with everyone. I hope you’ll see benefits soon. It takes a little while.\nBesremi has a different molecule than Pegasys or so it was explained to me. Its molecule is more effective in the sense that not only it has a slower release so it doesn’t have to be injected weekly, but it also works in a different way rendering better results. For people that experience side effects with Pegasys, there are fewer with Besremi. Why I love it: I inject once a month so I can travel longer with no meds in my purse; no symptoms of PV to speak of anymore; undetectable Jak2 at a molecular level (fingers crossed it will stay this way for a long time).\n",
    "User Name": "Mirela Padurean",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Besremi",
    "Topic 3": "Side effects",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "29",
    "Thread": "a",
    "Quote": "I'm being offered to participate in a trial for an at home self injected medication that will eliminate the need for phlebotomies. The trial is in stage 3. Have you heard of this? Thought? Concerns?",
    "User Name": "Michal Gilmore",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "Study consideration",
    "Sentiment": "Neutral ",
    "URL": ""
  },
  {
    "Entry": "29",
    "Thread": "b",
    "Quote": "I'm thankful that they are researching more options than phlebotomy and hydroxurea, which only kills off cells. Iron deficiency is no joke, especially when you are older.",
    "User Name": "Lisa Millhouse",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "29",
    "Thread": "c",
    "Quote": "I tried to get into this trial but just missed out with the qualification requirements. I was only diagnosed last April and had several back to back phlebs that were too close together to \"count\", so I ended up being one short of the required minimum. I don't do phlebs well (very intact vagal response so I get \"shocky\" and pass out easily) and they take my iron/ferritin too low (down to 5 for each after my last round) so I was very interested in the study showing how this drug protected iron stores to prevent extreme pleb induced anemia. If you do participate, please keep us updated.\n",
    "User Name": "Michelle Cochet-Trippel",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Phlebotomies",
    "Topic 2 ": "Anemia",
    "Topic 3": "Fatigue",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "29",
    "Thread": "d",
    "Quote": "Hi Michelle Cochet-Trippel -  I'm sorry you are phlebotomy-dependent. It seems in my experience over the last 2 years hemocs. are moving away from this treatment because of the iron deficiency. My iron was also 5 from repeated phlebotomies and I was so tired I could barely function. Did they suggest Jakifi or Besremi? Pegasys?\n",
    "User Name": "Lisa Millhouse",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Phlebotomies",
    "Topic 2 ": "Anemia",
    "Topic 3": "Fatigue",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "29",
    "Thread": "e",
    "Quote": "Hi Lisa Millhouse - I'm on Pegasys and it's working well for me esp around symptom burden (headaches/itchiness/muscle & joint pain). My numbers were starting to come down but then my Hemo put me on a temporary break from Dec-Feb o recover from some sort of RSV like thing I picked up. Just started back on it again a few weeks ago.",
    "User Name": "Michelle Cochet-Trippel",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Pegasys",
    "Topic 2 ": "Symptom Management",
    "Topic 3": "Treatment search",
    "Sentiment": "Somewhat positive",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "Go for it. I've heard nothing but good things about Rusfertide.\nHere's MPN specialist Dr Kuykendall talking about it:",
    "User Name": "Laura Roberts Landino",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Caregiver",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Rusferitide",
    "Topic 3": "",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "30",
    "Thread": "a",
    "Quote": "So went to Dr yesterday for interferon drug trial. Got the full dose, was told it normally takes about 6 months to get to full dose, 6 weeks is how long I've been in trial. Shot every 2 weeks. No side effects. Actually I feel pretty good. They pulled 6 tubes of blood, ran lots of labs, lots of levels are coming down. Even got to cancel phlebotomy scheduled for today! I will take it!",
    "User Name": "Monica Crowe",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Interferon",
    "Topic 3": "Site visit",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "30",
    "Thread": "b",
    "Quote": "Went to my specialist yesterday, I'm in the clinical trial. Got the first injection, I'm in the group that they are trying to get me to full injection faster. No real reaction to dose.  Most common side affects; flu like symptoms. Went home for lunch feeling a little achy, thought a nap might help. Woke up 7 hours later. Feel better though. Next dose is 2 weeks, the day I leave for vacation.",
    "User Name": "Monica Crowe",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Interferon",
    "Topic 3": "Site visit",
    "Sentiment": "Somewhat positive",
    "URL": ""
  },
  {
    "Entry": "30",
    "Thread": "c",
    "Quote": "It’s gets better over time. I was on 500 mcg (the full dose of Besremi) for almost a year. In total I’ve been a n it for 22 months. My HTC was controlled the first dose and platelets a few months later. More importantly I have not needed a phlebotomy since starting.\nMy worse was about 2-3 months after the max dose, I felt really bad but it went away after about 2 days. Then really started feeling better and just feel tired for a few days afterwards. I’m now on a monthly dose so it’s even better.",
    "User Name": "Steven Ames",
    "Channel": "Facebook",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Interferon",
    "Topic 3": "Drug tolerance",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "31",
    "Thread": "a",
    "Quote": "I’m in and out in this group but I haven’t seen anyone talk about Rusfertide. I just started a trial for it and my doctor calls it a “slam dunk”. Got me pumped like a Pv patient fresh outta phlebotomy.. I tell you hwhat!",
    "User Name": "Mike Matukewicz",
    "Channel": "Facebook",
    "Demo": "40s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Rusferitide",
    "Topic 3": "Drug impact",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "32",
    "Thread": "a",
    "Quote": "This is the study I’m on and it’s been a game-changer for me. Nearly all symptoms have ceased (I also eat a clean diet and don’t drink alcohol). No phlebotomies for 3 years.\nI just noticed they’re accepting new people im the study again so I thought I’d share in case any of you want to speak to your specialist about it.",
    "User Name": "Anne Thrive",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Rusferitide",
    "Topic 3": "Drug impact",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "33",
    "Thread": "a",
    "Quote": "Looking for specific advice on drugs to lower Hematocrit and platelets. I've had polycythemia vera for about 8 years. I have been able to manage it with low dose aspirin and phlebotomies about every 2 months. \nBut it seems my HCT has been creeping up higher, today it's 51 and platelets at 1.2 mil. \nUsually my HCT lowers to 43 -46 after a phlebotomy but I just had one 6 weeks ago and the numbers haven't changed much so it's time to consider a more powerful drug than low dose aspirin and phlebotomies.\nI've tried to hold off on the drugs for as long as I could and my MPN specialist said I would most likely have to go on the drugs when I turn 60. I just turned 59. \nI'm pretty active 6 ft, 180 lb. Semi-retired actor. I'm involved in two sports leagues, flag football and softball. I try to get in 10,000 steps a day walking 3 to 5 mi. Despite my polycythemia Vera, I usually feel in decent shape. I have the side effects that come with this disease like numb feet, aches and pains in my body pretty much all the time, sporadic lethargy etc, and manage it \nbut I think it's time to try the drugs. I don't want to have a stroke. \nMy question is some of the drugs have side effects and one of them is suicidal thoughts. I'm not sure which one that is but I want to stay away from that drug. I had someone in my family who committed suicide so who knows, I may be susceptible. Thankfully I've never had any of those issues, but I'd like to stay away from any drug that has that side effect. Any advice on drugs that people have taken at around age 60 would be very helpful. \nThank you so much!\nBtw, I'm thinking of doing a documentary on polycythemia Vera to shine some light on it. So in the future I may be reaching out to people willing to speak about it.\nCheers,",
    "User Name": "Doug Olear",
    "Channel": "Facebook",
    "Demo": "50s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trials",
    "Topic 2 ": "Side effect concerns",
    "Topic 3": "Trial consideration",
    "Sentiment": "Neutral",
    "URL": ""
  },
  {
    "Entry": "33",
    "Thread": "b",
    "Quote": "I can’t wait to be an interferon! Just recently diagnosed but the ONE thing I do not want is progression! My HCT was at 59and my platelets are 978. I’m absolutely happy to be on HU right now. Both of my parents ( mom died 49, dad 61) died early. I don’t want to die of an cardio event!!!! I am asymptomatic but hair loss and bruising on HU. I have a high Ana titer for Lupus, aggressive SPRAC(?) , and my ab is at 53. Percent. No telling how long I’ve had it. I’m much healthier as a whole now that I’m eating vegan, exercising, and watching my health…. With a few hiccups. Besremi is supposed to be the one with suicidal tendencies….. I’m in if they put me on that one. But I think my tests at COH are testing my blood for something else;(\n",
    "User Name": "Cecilia Grantham",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Interferon",
    "Topic 2 ": "Disease progression",
    "Topic 3": "Comorbities ",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "33",
    "Thread": "c",
    "Quote": "Every patient is different. Your dr has an obligation to disclose any possible side effects; no matter how infinitesimal the chance of having it. If you have any side effects such as depression you can take a med vacay and restart. Many of us have done this. The benefit of control of this cancer is worth trying.\nRemember hat phlebotomy as treatment is temporary, does not treat, does not help alleviate symptoms, does not shrink spleen, does not stop the possible progression to myelofibrosis/leukemia. It can cause platelets to rise which further complicates control of the cancer.\nPlatelets at 1.2 million is dangerous as it greatly increases the risk of stroke and heart attack.",
    "User Name": "Shelley Herman-Sonnenberg",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Disease progression",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "33",
    "Thread": "d",
    "Quote": "i took interferon called pegasys and it worked but the side effects were awful! my bones felt like they were slitting and I DID have suicidal thoughts and it was as easy as reading off my grocery list.\ni kept it to myself because i thought i was crazy but then i told my husband and ive never seen him so scared.\ni was switched over to Anagrelide and that was a God send.\nmy numbers have been stable for 3 years. its been 1.5 yr since last phlebotomy and I dont feel like a cancer patient.",
    "User Name": "Sara Gardner",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Pegasys",
    "Topic 2 ": "Anagrelide",
    "Topic 3": "Side effects",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "33",
    "Thread": "e",
    "Quote": "My specialist has told me the meds currently out all have negative side effects but HU is the one with the fewest. I am in my 60’s and doing fine with phelbotomy every 4 months and baby aspirin. The topic of meds comes up frequently between my doctor and me but since I feel quite well with no symptoms I am not in favor of going on a med which could make me feel unwell. The med Pegasus and Besremi work well for many but it can cause depression especially in older adults. It also has the ability of causing a fast heart rate. My cardiologist is very against this medication. Jakafi too has many side effects but again works well for a lot of people. It has the ability to cause pancreatitis, urinary infections and urinary issues and weight gain. If you need a med at this time I would consider HU as it goes to work quickly and then watch for one of the new meds in clinical trials to become available. Rusfertide is due out soon and showing a few mild side effects like injection site redness. You are never stuck on any med and there are always advances and new meds on the horizon. Best of luck. PV is just so different for all of us.\n",
    "User Name": "Sally Woldring Cooper",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "Treatment satisfication",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "a",
    "Quote": "I’m at one phlebotomy every two weeks at the moment. \nMy doctor, who I really like, says it’s a course of treatment he’d like to maintain and that it’s going well all things considered. I’m not working and sleeping an average of 13 hours a day. \nI’m a dark humored lass and haven’t been able to get this King of the Hill episode out of my head so I just did what my sick little mind needed to do about it.",
    "User Name": "Stephanie Strange",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Phlebotomies",
    "Topic 2 ": "Side effect concerns",
    "Topic 3": "Fatigue",
    "Sentiment": "Somewhat negative",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "b",
    "Quote": "I also had frequent plebs when first diagnosed. It will wreck you. After 3 1/2 years on Besremi, my AB has gone from 44% to 5% , no more plebs and I feel like a million bucks. Don’t take no for an answer. Get yourself an MPN and get on the road back to a good life.",
    "User Name": "Brenda Burdick Behnken",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Phlebotomies",
    "Topic 2 ": "Besremi",
    "Topic 3": "Treatment consideration",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "c",
    "Quote": "I love your dark humour. But quite seriously medication is the answer, not frequent phlebotomy. You need to advocate for yourself, and by that I mean you need to be a pushy b&&tch. Get a good mpn specialist and get yourself onto Besremi or Pegasys pronto. Don't take the bullsh$$ they will try to serve you. Best of luck!",
    "User Name": "Sally Drake",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Caregiver",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Access to care",
    "Topic 3": "",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "d",
    "Quote": "I'm not on medication yet. Doc just told me HU is on the table. I’d rather get on Besremi from what I’ve heard but he didn’t present that as an option. Not sure why yet, but you know the dance with doctors. Trying to get to an answer 6 months at a time.",
    "User Name": "Stephanie Strange",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Access to care",
    "Topic 3": "Besremi",
    "Sentiment": "Somewhat negative",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "e",
    "Quote": "I started the Hu and baby aspirin.. I was literally able to stop doing phlebotomy. Starting low with one 500 mg per day. hu has regulated my labs to nearly normal numbers taking it at night reduces and almost eliminates side effects. And no phlebotomy, phlebotomy just causes a whole bunch of new problems like anemia and other things. Starting out and staying on hu for as long as possible is recommended by MPN Specialist because we have very few options after that and depending upon your age you may need treatment for decades so starting on the most logical least invasive therapy and staying on it as long as possible is in your best interest",
    "User Name": "Denise Cooper",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Phlebotomy",
    "Topic 3": "Treatment satisfaction",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "f",
    "Quote": "Hi Denise Cooper - I can second that.\nMy phlebotomy got up to as frequently as once a week.\nI went on Hydroxyurea eventually.\n500mg. Started off with once a day.\nI'm now on 10 doses per week.\nHaven't had phebotomy in quite a while.\nI haven't noticed any side effects.\n",
    "User Name": "James Tapscott",
    "Channel": "Facebook",
    "Demo": "50s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Phlebotomy",
    "Topic 3": "Treatment satisfaction",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "g",
    "Quote": "Hi Stephanie Strange HU is the cheaper drug for this condition,insurance companies usually require it first . I could not tolerate,I am on Pegasus. Phlebotomy tanked my iron to 2 ,it takes years to recover .",
    "User Name": "Kimberly Denman",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Insurance",
    "Topic 3": "Phlebotomy",
    "Sentiment": "Somewhat positive",
    "URL": ""
  },
  {
    "Entry": "34",
    "Thread": "h",
    "Quote": "Hematologists don't understand all the nuances of our cancer. You need to start seeing an MPN specialist. If you're in the states PVReporter.com has a great list by state. There are meds that will get you to a point where you don't need Phlebotomy and increase quality of life ten fold. \n",
    "User Name": "Jennifer Marshall",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Specialists",
    "Topic 3": "Phlebotomy",
    "Sentiment": "Somewhat negative",
    "URL": ""
  },
  {
    "Entry": "35",
    "Thread": "a",
    "Quote": "I have a type of blood cancer with a projected lifespan of two years without treatment.\nI was diagnosed a little over three years ago and have been lucky enough to have the best medical care in the country.\nWith bare bones treatment, I can expect 20+ years. Minimal treatment costs $1,300-$5,300  twice a month. Chemos and new drugs that are in high demand and would give me a longer life of higher quality are thousands of dollars for one dose.\nI’m on OHP. Due to fatigue and illness from my disease, I’m not able to work a regular consistent kind of job. I do the best I can, pulling jobs together as I’m able. Some days I sleep 13 hours and hardly move. Some days I’m like my old self.\nAnd I’m scared. Looks like I have a little time to figure this out before it’s implemented.\nOregon is my home and has been the safest place in the country for me to live with a condition like mine. I’m hopeful that lawmakers here in Oregon will keep us safe. \nI don’t know what to do right now or what’s gonna happen, but I felt like it was important to share this, whereas I haven’t felt compelled to spell it out so plainly in the past. I don’t want pity I don’t want money and I know I’ve got a solid community of people who love me. \nMy feed is made up of people who care about other people, so this might be screaming into the void, like I see so many people doing these days.\nBut just in case you felt disconnected from the effects of this administration, or felt like people are overreacting, I’m throwing my scream in, for the record. \n",
    "User Name": "Stephanie Strange",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Medicaid",
    "Topic 2 ": "Insurance",
    "Topic 3": "Access to care",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "36",
    "Thread": "a",
    "Quote": "Hi. I have a question. I have iron deficiency with my Ferritin lefel at 5 and my iron store a 6. I need to take iron supplements because though my oncologist said not to. I am just so tired that I seem to go from bed to bathroom to couch. My iron levels keep falling and my platelets, keep rising.",
    "User Name": "Cynthia Rebottini",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Iron supplements",
    "Topic 2 ": "Anemia",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "37",
    "Thread": "a",
    "Quote": "I was doing aspirin and phlebotomies only. Diagnosed with ET in 2017, then confirmed it had transitioned to PV in August of 2023. I’ve been in the Rusterfide study since October 2023 and have not had a single phlebotomy since (I was having them about every 6 weeks) To say this drug has been life changing is an understatement. It’s given me my life back. ",
    "User Name": "Ranesa Riley Bodine",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Drug impact",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "37",
    "Thread": "b",
    "Quote": "I still have bad days but NOTHING like I did before. I’m very afraid of what is going to happen once this gets FDA approval. Will it become unaffordable? Will insurance cover it? Many unknowns.",
    "User Name": "Ranesa Riley Bodine",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Treatment cost",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "37",
    "Thread": "c",
    "Quote": "Good news for those of us who only have high RBC. Unfortunately it doesn't affect high platelets.",
    "User Name": "Mel Fox",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Platelet levels",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "37",
    "Thread": "d",
    "Quote": "I had a cardiologist appointment this morning. Just a yearly checkup as I have Supra ventricular tachycardia which makes my heart sometimes beat too fast. My cardiologist is also a pharmacist and has been very helpful when I have questions regarding any meds I might be on. We talked for a bit about my PV diagnosis which came just 6 months ago. So far I am just doing phelbotomy as needed and baby aspirin but have not needed a phelbotomy in the last 4 months as my hematocrit has been holding in the low 40’s. We talked a great deal about the current meds available to treat PV as well as meds in clinical trials. His suggestion to me was to continue on like I am for as long as I can but if or when it came time to add in a med Rusfertide was his pick of a med for me. Rusfertide has got my vote if and when I need it. I am very hopeful that it will do well at controlling symptoms for many and that these new meds in the clinical trials will be the way to go in treating PV. The current meds all include too many side effects for my liking. \n\ninterferon is one I cannot do. Both my hematologist and cardiologist have told me it is not recommended for me with my SVT heart condition. I was on HU for a very short period but ended up in the ER with stomach cramping and nausea so bad I thought it felt like I was passing kidney stones. Jakafi has the side effect of causing pancreatitis. I have had idiopathic pancreatitis meaning they can’t locate a cause 6 times. I have scaring in my pancreas. If I need to start a med it will need to be Rusfertide. From those I have talked with about this med it has very mild to few side effects. For now doing phelbotomy a few times a year is working for me. I hope to continue along this path for as long as I can. If I needed to do phelbotomy more often than that and my iron level starts causing me issues such as you mentioned I of course will jump on board with a med and pray my body can handle any of the side effects it might come along with.\n",
    "User Name": "Sally Woldring Cooper",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Treatment consideration",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "37",
    "Thread": "e",
    "Quote": "I wonder how much it'll cost. ",
    "User Name": "Paul Cheruibini",
    "Channel": "Facebook",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Treatment cost",
    "Sentiment": "Mostly negative",
    "URL": "skepticism"
  },
  {
    "Entry": "37",
    "Thread": "f",
    "Quote": "No wonder on the cost of this drug? Anyone know if they've released the information?",
    "User Name": "Steven Ames",
    "Channel": "Facebook",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Treatment cost",
    "Sentiment": "Mostly negative",
    "URL": "skepticism"
  },
  {
    "Entry": "38",
    "Thread": "a",
    "Quote": "Does anybody know when rusfertide is due out? \nI’ve never experienced such fatigue, but my doctor doesn’t want to put me on medication since I’m 42 with no cardiac events. \nWe’re both looking forward to Rusfertide coming out but I am having to cancel work and not sure what I’m gonna do here.",
    "User Name": "Stephanie Strange",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide ",
    "Topic 2 ": "Upcoming approval",
    "Topic 3": "Treatment consideration",
    "Sentiment": "Neutral",
    "URL": ""
  },
  {
    "Entry": "39",
    "Thread": "a",
    "Quote": "Yeah I had one of those before I switched to an MPN specialist she would just walk in the room look at my labs and tell me just to keep doing what I'm doing or we need to up it or we need to lower it and that was it never asked how I'm doing how I'm feeling what am I symptoms nothing. Now that I've switched to an MPS specialist I feel like I'm getting a exact opposite effect with lots and lots of questions some that I don't understand why they're asking but they all mean something",
    "User Name": "Denise Cooper",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Specialist",
    "Topic 2 ": "Care team",
    "Topic 3": "Treatment satisfaction",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "39",
    "Thread": "b",
    "Quote": "what is a MPS specialist? I was just diagnosed and referred to a MPN. Now I ask TONS of questions... so even if they try to leave I'd stop them lol. But not sure which specialist is best?",
    "User Name": "Angelle Ferrer",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Self-advocacy",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "Somewhat negative",
    "URL": ""
  },
  {
    "Entry": "39",
    "Thread": "c",
    "Quote": "here is a link for specialists.. they are few and far between I see Dr gerds in Cleveland but I live 3 hours away. I had to make my initial visit to him but now that I'm established I go get Labs here locally and he sees me for Telehealth. So it makes it very convenient even seeing someone hundreds of miles away",
    "User Name": "Denise Cooper",
    "Channel": "Facebook",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Specialist",
    "Topic 2 ": "Care team",
    "Topic 3": "Telehealth",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "40",
    "Thread": "a",
    "Quote": "What I think all we sufferers of PV need to acknowledge is that we have something that is still so rare it doesn't interest the medical profession, nor the financial backers of the necessary research (read: drug companies), in terms of  revenue  generation and delivery to shareholders.\n For now, we're pretty much on our own - riding the tidal wave between bleeding, and, eventually, chemo.  \nOur best hope, in my view - as an aged but still competent communications professional of 40+ years standing - is to create global awareness  of and insistence on research into and advice about our rare condition that goes 'way  beyond what is currently available. \nPV is no respecter of age, race, gender, or anything else. We need the global medical research fraternity to wake up and acknowledge this - and to take us seriously. \nOr face the consequences of even more adverse publicity than they currently have on their plates. \nAnd, for so long as I continue to draw breath, to, the extent  I  can, I will be part of that process.\nAnyone interested in joining me in a global PV \"outing' campaign?\nSuch is the misery of my life at the hands of PV, I feel NOTHING about putting my name to and contributing to a global campaign that starts to recognise our current  dilemma. If your feel the same, please do contact  me.\nFacebook\n",
    "User Name": "James Duncan",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "40",
    "Thread": "b",
    "Quote": "I am really new to this disorder in me, though I suspect I have had it a long time, just not as bad. So much to know and understand. I like this PV info site but sometimes overwhelmed by the multitude of things to learn.",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "40",
    "Thread": "c",
    "Quote": "In Australia they don't like taking the blood, too time consuming and keep pushing the chemo option (that I refuse) unfortunately still no really effective treatments that do not have scary repercussions\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "Many countries only have access to chemo as it's cheap and the health service/government won't fund anything else because if the extortionate cost of alternatives that many in the US have access to. That's what upsets me and the problem lies with the pharmaceutical companies.",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "It’s terrible in Canada. I would totally support a global campaign.\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "I also have Elhers Danslo Syndrome, and PV. A lot have never heard of EDS. It is hard to get diagnosed. Both chronic illnesses I have had all my life. Finally a DX at 58 years old on both. I am now 60. I have suffered all my life and still do. And no one not one Dr knew why. I had to study and present to them my conditions. All drs and it has been a lot all said. Oh yeah we touched on that in school. I screamed in the beginning to the top of my lungs about both and no one cares. Also from my EDS. I have a mirial valve leak in my heart which is the most threatening. They can't operate because of my PV. You help me find a platform and I will help. I understand exactly what you are saying. I'm in.",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "I would like to join one of these studies. I wish they would offer telehealth visits since they aren't in my area.\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "41",
    "Thread": "a",
    "Quote": "Hi everyone, I am happy to see that there is a community of people with the same rare condition, as even the GP can seem confused about what it is.\n\nI’m 42 and recently diagnosed with Polycythaemia vera (PV), it explained a lot in regard to my persistent health issues, and it’s a bitter-sweet thing. I am happy to finally know what is wrong with me, but I wasn’t expecting a type of blood cancer. Then again, from what I understand, ‘if you could pick a cancer and had to pick one, Polycythaemia vera (PV) is not so bad as some’.\n\nI’ve been having weekly venesections to get my haematocrit down to 0.45- and I’ve become very anaemic (Ferritin 6 ug/L), they say treatment has been working great so, I feel lucky about that. I am nearly at the haematocrit 0.45 mark (one or two more weeks) and I’ve been told to go to an every 14 day venesection.\n\nGoing over some of the posts here, I see some people are on medication, seemingly with some bad side effects. And I was hoping some of you could share some of your experience with me.\n\nIf you’re being treated with Venesections, how often do you need to go now? How did it all go for you? How are you about it emotionally?\n\nIs it possible to have treatments beyond every month, or every month and a half? What are your experiences?\n\nDespite my optimism, I am not sure what to expect really. I had plans to go travelling for a long period of time, and I have some ideas on how to do this with Polycythaemia vera (PV). But there isn’t a lot of concrete information out there and neither am I interested in going through Facebook for obvious reasons.\n\nThank you for reading and I look forward to your responses.",
    "User Name": "KevM",
    "Channel": "BloodCancer.org.UK",
    "Demo": "40s M",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Recently diagnosed",
    "Topic 2 ": "Treatment search",
    "Topic 3": "Information search",
    "Sentiment": "Mostly negative",
    "URL": "https://forum.bloodcancer.org.uk/t/question-living-with-treatment-polycythemia-vera-pv/11246/2"
  },
  {
    "Entry": "41",
    "Thread": "b",
    "Quote": "\nWhile I was hesitant to take hydroxyurea, being that it’s scary-sounding chemotherapy, my haematologist reassured me that it’s been used for decades by young people with sickle cell disease and research shows they don’t develop a greater incidence of other cancers, so that’s good enough for me! If hydroxyurea stops working so well for me in the future then I’ll change to another. We’re fortunate to have many medicines that disrupt the blood overproduction inherent in Polycythaemia vera (PV). Maybe have a read of the great Blood Cancer UK information about Polycythaemia vera (PV) if you haven’t already: Polycythaemia vera (PV) | Blood Cancer UK\n\nHope that helps! Sorry to go on a bit. I’m intrigued by your plans to travel with Polycythaemia vera (PV), but do wonder how your energy levels will tolerate it, certainly after starting to take cytoreductive medicine. Where might your travels take you? So nosy!\n\nDo please keep us posted @KevM, now that you’re part of the Polycythaemia vera (PV) family!\n\n",
    "User Name": "Duncan",
    "Channel": "BloodCancer.org.UK",
    "Demo": "40s M",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Treatment options",
    "Topic 2 ": "Hydroxyurea",
    "Topic 3": "phelebotomies",
    "Sentiment": "Mostly positive",
    "URL": "https://forum.bloodcancer.org.uk/t/question-living-with-treatment-polycythemia-vera-pv/11246/2"
  },
  {
    "Entry": "41",
    "Thread": "c",
    "Quote": "The idea of self-phlebotomising has crossed my own mind too (don’t tell me off, @Erica!!!) as it was costing me $300+ each time with my previous health insurance here in California! Thankfully it’s now covered and ‘free’, but the expense of such an old-fashioned, literally mediaeval intervention was shocking to me. It’s times like that when I miss the NHS most. Something I do now when I’m venturing a bit further afield is making sure I know where the nearest hospital is, just in case.\n",
    "User Name": "Duncan",
    "Channel": "BloodCancer.org.UK",
    "Demo": "40s M",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "phelebotomies",
    "Topic 2 ": "Treatment options",
    "Topic 3": "Self-administration",
    "Sentiment": "Somewhat positive",
    "URL": "https://forum.bloodcancer.org.uk/t/question-living-with-treatment-polycythemia-vera-pv/11246/2"
  },
  {
    "Entry": "41",
    "Thread": "d",
    "Quote": " get that this could be a confusing and scary time for you. I think we are on the cusp of a greater understanding of our condition with new treatment options/ approaches coming along. Personally, after 2 years of venesection I am on Pegulated Interferon. I suggest reading what yiu can find and staying in touch with people who understand what you are going through.\nI fond this forum to be extremely helpful. I also joined Myeloproliferative neoplasms (MPN) voice on Health Unlocked, which provides an international perspective.",
    "User Name": "DougyW",
    "Channel": "BloodCancer.org.UK",
    "Demo": "50s M",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "41",
    "Thread": "e",
    "Quote": "Hi Duncan Medieval or not, I get some kind of amusement out of it that it’s actually effective for something current. As at the time, they would use it for so many things, sometimes having disastrous effects.\n",
    "User Name": "KevM",
    "Channel": "BloodCancer.org.UK",
    "Demo": "40s M",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "41",
    "Thread": "f",
    "Quote": "I do find that this is a strange cancer to have as it cannot be seen and once friends and family know you have it and get used to it and see you getting on with life they forget you can get tired and need help. Like most women I just get on with it but sometimes it would be nice to just be given help with out having to ask. Moan over it is at least at the moment not life threatening just limiting so I am lucky.\n\n",
    "User Name": "Carolemavis",
    "Channel": "BloodCancer.org.UK",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "41",
    "Thread": "g",
    "Quote": "Hi @Carolemavis I agree with everything you say, but I have realised that other people are not mind readers and see me getting on with it.\nI also realised that I was feeling very resentful.\nHowever once I asked for help when I needed it the situation completely changed.\nI have found that people were pleased to be asked, they understood me better and I felt so much better.\nIt is so difficult with hidden disabilities and with me always being the capable, getter on with it one and the reliable one\nI have also learnt to say ‘No’.\nLook after and be very kind to yourself and let us know how you get on.",
    "User Name": "Erica",
    "Channel": "BloodCancer.org.UK",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "42",
    "Thread": "a",
    "Quote": "Good news! My Mayo MPN recommended this for iron deficient, phlebotomy dependent people like myself. Will also help keep HCT stable. He said the only draw back is the injection site gets extremely irritated and must have injection every week. He said there is a better drug in the works (Disc) that he is hoping to put me in the clinical trial in the fall. Basically does the same thing but much less side effects. He highly recommends this one heading for clinical trials.\n",
    "User Name": "ritaandscooter1",
    "Channel": "Healthunlocked",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Rusfertide",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "Mostly positive",
    "URL": "https://healthunlocked.com/mpnvoice/posts/150834613/rusfertide-for-hct-control-fda-status"
  },
  {
    "Entry": "42",
    "Thread": "b",
    "Quote": "I've come to appreciate how lucky we've been to have the treatments we have. having a condition with none. Every step makes someone's life better.\n",
    "User Name": "",
    "Channel": "Healthunlocked",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "41",
    "Thread": "a",
    "Quote": "I have read through many earlier posts but there isn't anything definitive. As someone struggling with really bad Hu side effects I have the decision to make in the near future. Besremi or Jakafi.\n\nThe thing I don't really get is both treatments essentially are trying to achieve the same thing, but administering them, and their potential side effects are very different. Jakafi has the convenience of Hu and has to be taken daily, whereas Besremi is a fortnightly injection taken at home usually after an initial period taken at the hospital.\n\nAs someone with great eyesight but a slight abnormalality in on eye, noticable hairloss on Hu, and some anxiety, the possible side effects with Besremi might be significant for me. Both eyesight issues, hairloss and mood changes are possible known side effects of Besremi.\n\nBoth have similar warnings in other areas such as stroke, bruising, bleeding, blood count disturbances, allergic responses and heart issues. We all accept there are risks just like with Hu.\n\nAm I missing something here? Perhaps desease progression and reduction of alle burden is significantly different? I don't have much knowledge and perhaps Besremi is more targeted for PV in some way? I really don't know - but hoping the more knowledgeable here can explain in plain english?\n\nTo me, in broad layman's terms, Jakafi looks like a lower risk profile with alot fewer notifiable side effects. Or is that just because Jakafi might be a newer drug? Again I don't know!\n\nSorry, many questions as ever!\n",
    "User Name": "HUanswers",
    "Channel": "Healthunlocked",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Besmeri",
    "Topic 3": "Jakafi",
    "Sentiment": "Neutral",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152174559/why-is-besremi-such-a-popular-choice-for-pv-rather-than-jakafi"
  },
  {
    "Entry": "",
    "Thread": "b",
    "Quote": "In my case I would choose interferon over Rux. at the moment because I need to lose weight and because I have a relevant skin history (so far Interferon hasn’t been associated with increased skin cancer risk whereas I think Rux increases risk a bit). I may ask about Rux (which the MPN Specialist mentioned might be an option but thought for now Interferon was a better fit) or a newer Jak2 inhibitor in the future if Interferon doesn’t work sufficiently for me (it’s taking its time - maybe Rux is quicker).\n\nI’m not sure of the price difference in the UK and it may be that the NHS goes to one before the other due to availability and as you say perhaps how long they have been in use.\n\n",
    "User Name": "RoundTheWorld",
    "Channel": "Healthunlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Besmeri",
    "Topic 3": "Jakafi",
    "Sentiment": "Neutral",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152174559/why-is-besremi-such-a-popular-choice-for-pv-rather-than-jakafi"
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "As I see it Rux has more sides but IFN has the most severe if infrequent sides, consistent with your take.\n\nIFN has been in wide use for MPN only the last three years or so. Pegasys IFN has been in use off label for a long time, but not widely till the large Besremi trials confirmed the category. Rux was approved for MF in ~2011 and PV ~2014, so it has a long record.\n\nWeight gain on Rux is for near all pts. Some report more appetite, others more weight on the same appetite, I'm the latter but I simply cut my intake. Agree with the full vax series the shingles risk should be less, although there are no good large studies I know of. Non melanoma skin cancer is seen, similar to HU.\n\nIFN is the only MPN med with an FDA black box warning. These severe risks are real and are happening on the forum. Since it is a new med, this experience is still evolving. But with careful attention and quick action these infrequent events are usually reversible. If you or family has any autoimmune history this is can be a contra indication, with thyroid being an exception.\n\nFor you the mental health part of the black box merits attention. Some members have had trouble making the connection of IFN to newly worsened mental health, but knowing it is possible should allow proper action (pause or cessation) if it happens.\n\nI've been on all 3 options and all worked on blood counts. Both IFN and Rux have reduced my mutation. I liked the two week dosing of IFN, but the malaise was a drag. Possibly my dose (140) was too high. But I had a worst case outcome, so IFN is over and Rux is now doing well for me.\n\nSome pts don't respond to one or the other. If your blood counts have responded to HU that increases the odds the other drugs will also work on the counts\n\nIn sum IFN may be the best option if it is tolerated. But a substantial number of pts do not tolerate it, and less common worst case outcomes are more severe and potentially permanent as noted on the label. Using a lowest effective dose is a lesson that is accumulating here.\n\n",
    "User Name": "EPguy",
    "Channel": "Healthunlocked",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Besmeri",
    "Topic 3": "Jakafi",
    "Sentiment": "Mostly Positive",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152174559/why-is-besremi-such-a-popular-choice-for-pv-rather-than-jakafi"
  },
  {
    "Entry": "42",
    "Thread": "a",
    "Quote": "I can’t wait for rusfertide to come to USA, I’ve tried all mends for my PV and no of them for the past 13 years have been able to stabilize my counts , I’m hoping this one can, I’m staying positive , have a blessed day everyone",
    "User Name": "ggrana",
    "Channel": "Healthunlocked",
    "Demo": "60s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment consideration",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "HCT",
    "Sentiment": "Mostly Positive",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152071172/rusfertide-update-in-the-wall-st-journal"
  },
  {
    "Entry": "42",
    "Thread": "b",
    "Quote": "It seems to me sort of a specialty MPN drug for after failure of the others. Pts may prefer Rux, IFN and if/when Bomedemstat for their potential to reduce the mutation.\n\nBut for pts on just phlebs it would be great, there must be enough still on phlebs who don't need PLT reductions and don't want HU \"chemo\" to make it interesting. And for IFN pts and others without rapid HCT control it would be really useful, this is a frequent issue here. No doubt the big $ guys have figured it out.\n\nMy guess is Bomedemstat should be a bigger deal if it gets approved since it operates at a deeper level and looks to reduce the mutation. Farther out, we look to the new CALR and Jak2 agents for potential best disease and mutation control.\n",
    "User Name": "EPGuy",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152071172/rusfertide-update-in-the-wall-st-journal"
  },
  {
    "Entry": "42",
    "Thread": "c",
    "Quote": "Well the irony of venesections is that the body will produce increased platelets in response to iron insufficiency that arises from them. So Rusf will hopefully mitigate that as the hepcidin mimetic ‘tricks’ the body into regulating red cell production and stabilises HCT, iron and hemoglobin. It’s an ingenious drug and I suspect the plan is to carve a wedge into health budgets and advocate it as a novel alternative to venesections, or significantly reduce their frequency. I do find the profit motive and the vast sums at stake in all this a bit distasteful — but obvs I’m being ‘naive’ there.",
    "User Name": "MrTrippy",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "42",
    "Thread": "d",
    "Quote": "That is important info, the platelet effect of iron deficiency. I was not aware, although I never required venesections. Maybe you could make a fresh post on this correlation. Some members may also not be aware of this deeper side effect of venesections while suffering these effects.\n\nWe can look fwd to another drugs in this target, it's a gene therapy discussed in prior posts. Divesiran (SLN124).\n\nAgree on the opposing pull of the profits. Esp in the US, we pay the world's highest prices, which some say subsidizes lower prices elsewhere but may be why US gets some drugs earlier. A quick search finds Besremi is ~1/4 to 1/2 the US price in EU, best I can tell, all being extreme.\n\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Clinical trial",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "Side effects",
    "Sentiment": "Mostly positive",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152071172/rusfertide-update-in-the-wall-st-journal"
  },
  {
    "Entry": "43",
    "Thread": "a",
    "Quote": "Hello, Thanks for sharing the article. Here a little update: I am still on the trial of Rusfertide and I am very positive about it. The product gives me no side effects and controls my hematocrit perfectly. I had no venesection for the last 18 months (being diagnosed with PV). At the end of year one it was difficult to get the dose right (with the protocol of the trial being quite strict). Now I am in year 2 and I can alternate the dose, one week 30 mg and the other 45 mg. I would guess that using Rusfertide could also make it possible to start with a lower dose of other medicines (like IFN) and build up those slowly. Enjoy your day!\n",
    "User Name": "AnPV",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "BE",
    "Topic 1": "Clinical trial",
    "Topic 2 ": "Rusfertide",
    "Topic 3": "Side effects",
    "Sentiment": "Mostly positive",
    "URL": "https://healthunlocked.com/mpnvoice/posts/152071172/rusfertide-update-in-the-wall-st-journal"
  },
  {
    "Entry": "43",
    "Thread": "b",
    "Quote": " increase of my platelets happened in the first 4 weeks. My dr is okay with the platelets being at 1 million. For her the upper limit is 1.5 million. With my WBC at 24K and JAK2 at 84% I discussed other treatment options. My dr says RUX should not be a long term choice for me (I didn't ask why, being overwhelmed with all the information she gave) and Besremi is a difficult one because I also have vitiligo. You gave me some advice a few months ago (still grateful for that :-)). I think I am going to take the risk and start IFN. In combination with Rusfertide I could start slowly and see how it goes. But it still keeps my head busy...\n",
    "User Name": "AnPV",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "BE",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "44",
    "Thread": "a",
    "Quote": "Long answer: I know from experience. I am 33. I just had a neuropsych test done prior to starting Pegasys due to its neuropsychological side effects and past diagnosis of bipolar disorder. I will not go into to much detail, as it is a long story that starts when I was 18, but the testing showed no signs of bipolar disorder (we stopped treatment after starting treatment of my PV, and there had been no relapse in 8 years without medication) but it did show a mild cognitive disorder. I, at 33, cannot remember to take my meds, forget requests my wife gives me, forget appointment times, forget where I put items (even if they have a designated place), forget passwords, forget dates, etc. I have to have alarms, reminders, and a planner set up in my phone and have to snooze alarms until I do what they are telling me to do, or I will forget to do them. The psychologist that did my testing said that this is physiological to PV. I think it annoys my wife more then me. It doesn’t get much worse then that though. I don’t find myself losing names of people I see everyday, even though I get tongue tied sometimes. I don’t forget where I live, who the president is, what year it is, or major stuff like that.\n",
    "User Name": "u/Funkualumni07",
    "Channel": "Reddit",
    "Demo": "30s M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Neurological Symptoms",
    "Topic 2 ": "Forgetfulness",
    "Topic 3": "",
    "Sentiment": "Somewhat negative",
    "URL": "https://www.reddit.com/r/polycythemiavera/comments/tian8v/my_mom_may_have_pv_have_a_question_about_its/"
  },
  {
    "Entry": "45",
    "Thread": "a",
    "Quote": "I'm a caregiver for my partner and her experience on it was mixed. She was on pegasys previously and it wasn't controlling counts very well.\n\nBesremi rapidly improved her blood counts, like within a week. Absolutely unbelievable results in that regard. Her high blood pressure was gone in days. Headaches, itching, and other symptoms of her PV evaporated within the first week.\n\nI think there's a misconception that this is just repackaged pegasys, but it can definitely work differently for people in our experience.\n\nUnfortunately the mental health side effects were so incredibly severe she had to discontinue. Panic attacks, executive dysfunction and just despair. She's just now beginning to recover almost a month later.\n\nWe're very jealous of people who can take interfurons and not have side effects....\n\nLet me know if you have any questions and we're happy to answer.\n\n\n",
    "User Name": "u/RedKnights99",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Caregiver",
    "Country": "USA",
    "Topic 1": "Neurological Symptoms",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Besremi",
    "Sentiment": "Somewhat negative",
    "URL": ""
  },
  {
    "Entry": "46",
    "Thread": "a",
    "Quote": "I had Polycythemia Vera almost 20 years. Was taking Hydrea and it was working for me.\nThis is cancer of the blood in the bone marrow.\nThen my spleen got larger and then my liver as well.\nMy CBC numbers changed. My white blood cells (WBC) got low.\nMy Polycythemia Vera has now changed to Myelofbrosis.\nChronic Leukemia.\nI’m now taking Jakafi 5mg twice a day.\nThere are days I am so tried that I take a lot of naps.\nI’m 69 years old.\nJakafi cost is high. It’s $20,000.00 for a month supply.\nI’m lucky that my insurance is paying for all of it except $1,019.00 . My co-pay.",
    "User Name": "sunbird09",
    "Channel": "MayoConnect",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Insurance",
    "Topic 2 ": "Cost of care",
    "Topic 3": "Jakafi",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "47",
    "Thread": "a",
    "Quote": "I remember the panic amongst my loved ones when I was diagnosed in 2022 with PV. Both HCT and platelets were high/very high, but I only did a few phlebotomies before stating medication (Besemi) in 2023. The blood letting did not feel bad, but I wanted a chance to alter the mutations that cause the blood production to malfunction. My medicine caused raised liver enzymes early on and I took a break from the interferon. Then I went back on at a much lower dose. Now I am on the lowest possible dose, injecting only once a month. Either the disease or the meds knock me out sometimes. I have a lot of insomnia and fatigue, and sometimes other side effects. But the medicines are working well at lower dose for the time being. As nightmarish as it is, we have to accept the trial and error method, while always questioning and being honest about quality of life issues. Best of luck to your family.\n",
    "User Name": "treeore",
    "Channel": "MayoConnect",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment search",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://connect.mayoclinic.org/discussion/my-mom-has-pv/"
  },
  {
    "Entry": "48",
    "Thread": "a",
    "Quote": "Hi @nicolek. I completely understand how debilitating fatigue is. For more than 10 years, fatigue was my chief complaint. I went from doctor to doctor for help. Mostly I was given antidepressants. I never seemed to be able to get someone to understand that if I was depressed, it was because of the fatigue, not that depression was causing fatigue. Interesting that my red blood counts were apparently through the roof all this time, but no one said a word about it. I had no energy to do anything. Even watching TV or reading was out because I was so exhausted. It got so bad that I had to give up my job last summer. It was causing strain on my marriage as well because he couldn't understand why I was tired all the time and was starting to take it personally.\nI started seeing a hematologist (not Mayo clinic) in mid-January, who diagnosed polycythemia (cause as yet undermined, so I don't know if it's primary or secondary). I've had 4 phlebotomies since then--the last one cancelled because my hematocrit was in normal limits. (that's the only number my doctor watches)\n\nI will say that after the phlebotomies my energy seems to increase for a day or two, but then it starts to cycle back down. Unfortunately, I haven't found a magic \"fix\" either. All I can say is for you to be as kind to yourself as you can. Do what you HAVE to do (I know being a mom doesn't allow you to crawl in bed) and let the rest go.\n\nI do find it interesting that they wouldn't phlebotomize you due to your ferritin level. My doctor checked mine just twice--before and after the first phlebotomy--it was at 49 (before) and 40 (after) ng/mL. He's never checked it again. When I asked him why he stopped checking it, he told me it wasn't below 30 so he wasn't going to worry about it. I wonder if it's dropped more and that's contributing to my fatigue. hmmmm.... I do know my iron levels have been well within normal range, so I don't know if an iron-based diet/supplement would help. Of course I'm not a doctor, and I don't trust mine...\n\nI do wish you the best. If nothing else, know that you aren't alone.\n\n",
    "User Name": "trillium",
    "Channel": "MayoConnect",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment search",
    "Topic 2 ": "Diagnostic journey",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "49",
    "Thread": "a",
    "Quote": "I can relate to your situation. I feel depressed because i get tired so easily. When I asked my dr he basically ignored my question. So I asked if I should take vitamin B supplements and he said”well it won’t hurt you”. It’s so frustrating when you have a dr that just looks and the numbers and not you as a person who is struggling. At least I’m not alone! Thank you!\n\n",
    "User Name": "randles14",
    "Channel": "MayoConnect",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Mental health",
    "Topic 2 ": "Fatigue",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "50",
    "Thread": "a",
    "Quote": "hope everyone is well!\n\ncan anyone confirm whether Besremi / ropeginterferon-Alfa-2b is approved for first line treatment of Polycythemia Vera on the NHS.\n\nim 41, diagnosed 5years ago, fit and healthy but obviously concerned about the long term progression risk. Having read quite a few articles, it appears some experts are advocating the use of Besremi for young patients irrespective of risk profile due to its potential diseases modifying abilities.\n\nI’ve looked at the costs, and it’s quite expensive.. too expensive for me to fund privately…\n\nwould welcome any insight into anyone currently receiving this on the NHS across the UK.\n\nThanks!\n",
    "User Name": "Steve_Essex",
    "Channel": "HealthUnlocked",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Besremi",
    "Topic 2 ": "Cost of treatment",
    "Topic 3": "Treatment search",
    "Sentiment": "Neutral",
    "URL": ""
  },
  {
    "Entry": "50",
    "Thread": "b",
    "Quote": "Hi, Steve. I think your instincts are right on in terms of considering a drug that may modify the course of the disease, even though you’re feeling good. I was diagnosed with PV at 44 and felt great for years, except for a little anemia due to phlebotomies every few months. Fast forward to age 60, and I had my first bone marrow biopsy since diagnose at age 44. The BMB showed notable disease progression, and I’m now on an interferon. While I was living my life and feeling great, that PV was quietly working away in my bone marrow. If I knew then what I know now about the disease progression capabilities of interferons, I would have given Pegasys a shot.\n",
    "User Name": "GardNerd",
    "Channel": "HealthUnlocked",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Besremi",
    "Topic 2 ": "Cost of treatment",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "51",
    "Thread": "a",
    "Quote": "I can't understand why i can't stay busy without getting super exhausted to the point of being sick.\nI want my life back!",
    "User Name": "Bec Gageler",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Fatigue",
    "Topic 2 ": "Drug Shortage",
    "Topic 3": "Hydrea",
    "Sentiment": "Entirely negative",
    "URL": ""
  },
  {
    "Entry": "51",
    "Thread": "b",
    "Quote": "Due the shortage of Pegasus my haematologist has recommended I look in to going on Hydrea tablets. I’m not sure about this one and wondering if anyone has any information about it please. \nI can’t go on Besremi due to heart palpitations I had with pericarditis when having the Covid vaccine so Hydrea is my only option other than Pegasus\n",
    "User Name": "Bec Gageler",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Pegasys",
    "Topic 2 ": "Drug Shortage",
    "Topic 3": "Hydrea",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "51",
    "Thread": "c",
    "Quote": "I just had my 1st 135mcg of pegasys interferon injection 💉last night and tonight I have pain the ribs and shooting down my arm.... any ideas ",
    "User Name": "Bec Gageler",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Pegasys",
    "Topic 2 ": "First dose",
    "Topic 3": "Side effects",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "52",
    "Thread": "a",
    "Quote": "I take Claritin and Zyrtec and I still can't stop itching all the time my blood numbers are in the normal range so what's going on it's frustrating?!",
    "User Name": "Roseanna Ortiz",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Pegasys",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "52",
    "Thread": "b",
    "Quote": "Even with the caffeine cup of coffee in the morning I struggle through the mornings until afternoon I feel better then I think to myself better late than never everyday I'm 59 I'm retired now had my own business couldn't do the work anymore after 35 years so just doing the best I can with my husband who is my caregiver also..",
    "User Name": "Roseanna Ortiz",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Pegasys",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "52",
    "Thread": "c",
    "Quote": "My potassium is too high, and I really don't know why. I drink a lot of water that is stopping my surgeon from giving me hip surgery.. what can I do?! Tired of living in bone pain on this hip...",
    "User Name": "Roseanna Ortiz",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Pegasys",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "52",
    "Thread": "d",
    "Quote": "Even though my numbers are great without phlebotomies, I still have bone body aches pains headaches dizzy tired nothing takes that away.\n",
    "User Name": "Roseanna Ortiz",
    "Channel": "Facebook",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "53",
    "Thread": "a",
    "Quote": "I have a question how do u all deal with the lethargic side of PV. I've been struggling and can't get things done on a day to day basis ",
    "User Name": "Priscilla Oliver Sickler",
    "Channel": "",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "54",
    "Thread": "a",
    "Quote": "I will be switching to Besremi when my Peg runs out. I'm feeling very apprehensive about it after 6 years on Peg. Let us know how you get on.\n",
    "User Name": "Jazzyb50",
    "Channel": "HealthUnlocked",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Pegasys",
    "Topic 2 ": "Besmeri",
    "Topic 3": "Drug Shortage",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "54",
    "Thread": "b",
    "Quote": "Hi, I've been on Peg Interferon for the last 8 years and been swapped to Besremi due to the Peg shortage. I've done my first Besremi injection today but I don't know if I've done it correctly. I followed all the instructions but couldn't get the blue protective sleeve to fully retract, even though it left an indentation ring mark on my skin. I proceeded to push the button to administer the dose and then removed the pen after waiting 10 seconds. There were droplets of liquid on my tummy and in the end of the pen. I didn't feel the needle go in at all, unlike the Peg needle. Also the lock on the blue sleeve didn't come on straight after the injection. Have I failed? Thanks Jan",
    "User Name": "Jazzyb50",
    "Channel": "HealthUnlocked",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Pegasys",
    "Topic 2 ": "Besmeri",
    "Topic 3": "Drug Shortage",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "54",
    "Thread": "c",
    "Quote": "I too have had problems with the Bisremi pens. They are such a poor design … my first two doses I did exactly as instructed, in fact I did the first with the nurse, yet the levels did not move at all. I returned the pen to the pharmacy and am awaiting to see if was a faulty batch. So frustrating as I have no idea if I actually had the dose at all, but def had a puncture wound from the needle? I still don’t trust the pens as the next pen would not turn to the correct dose. I wish they would redesign the pens as this is an extremely expensive medicine . I cannot open the Austrian video, can someone repost please?",
    "User Name": "Spyglass27",
    "Channel": "HealthUnlocked",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Pegasys",
    "Topic 2 ": "Besmeri",
    "Topic 3": "Besmeri Dosing",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "55",
    "Thread": "a",
    "Quote": "HU failed to keep my numbers down sufficiently on its own so I kept up a frequent phlebotomy schedule.",
    "User Name": "Jackie Sumner",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "55",
    "Thread": "a",
    "Quote": "I put up with the HU side-effects and very low ferritin for a year, then asked to switch to Pegasys, which has been much more tolerable and effective. Ferritin normal now.",
    "User Name": "Jackie Sumner",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "55",
    "Thread": "a",
    "Quote": "I was told that Peg would be much worse, and that was simply not true. Starting Peg on 45mcg and tapering HU, all I noticed was a blessed reduction in HU side-effects😀 I just felt given the HU skin cancer and leg ulcer risks, plus the lack of effect on the disease itself, it would be worth trying Peg. My (new) haematologist said I could always stop if it was too bad. The one thing I'd say is - you need to be very patient with it. It can take months to start working.",
    "User Name": "Jackie Sumner",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "55",
    "Thread": "a",
    "Quote": "I started Peg 2 years ago, then had a tricky year when my hct wouldn't stop rising without venesections, even on a high dose of Peg. I had 3 at 4 weekly intervals finishing in Feb, but also started 3 x HU weekly a year ago. This weird combination has kept my hct stable at .42 ever since. I couldn't be happier. Good luck!",
    "User Name": "Jackie Sumner",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "55",
    "Thread": "a",
    "Quote": " I'm on Apixaban after a bilateral PE in 2019. I am on 180mcg Peg these days, and I can get slightly off days after my injection, but when I was on 45mcg and 90mcg I was not aware of any side-effects- this isn't that uncommon, btw. Some of us don't. My haematologist had not intended my dose to go higher than 90, but I seemed to have a run-away process going on that didn't want to stop. My hct was .35 when I started Peg and had reached .55 10 months later. You might never need more thsn .45, if that, if your hct is usually stable. I got a 2nd opinion on starting Pegasys, and actuallly changed doctors, to do it.",
    "User Name": "Jackie Sumner",
    "Channel": "Facebook",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Treatment search",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "56",
    "Thread": "a",
    "Quote": "Hello my fellow E.T chaps and chappettes,\n\nI’ve have just enrolled in a new clinical trial at the Royal Adelaide Hospital with Dr David Ross, INCA 33989-101,\n\nA Phase 1, Open-Label, Multicenter Study of\n\nINCA033989 Administered as a Mono-therapy🙂. My understanding (The antibody works directly against the mutant protein that’s encoded by the CALR mutation by binding to it, and pushing it off the surface of the cell so it can no longer signal.)\n\nI am patient number 9 in Adelaide.\n\nBackground:\n\nMy experience with E.T, diagnosed in 2007, 6 months after a significant tragedy.\n\nMy platelets were over 12 million. I took a graduating does of hydroxyurea for 10 years until the side effects of 4 a day outweighed any benefit. Then anagrelide for approx. 2 years, the heart palpitations were very disconcerting, but there were no other viable alternative treatments available for me at the time in Adelaide.\n\nMy platelet levels rarely dipped below 600,000, on both drugs prior.\n\nI was then enrolled in the trial for BOMADEMSTAT for over 2 years. I ended that trial with 200,000 platelets, after struggling with side effects for some time. Dysgeusia, which morphed from altered taste, to imaginary strong smells, this is still abating. My personal issue that was the most difficult were the large raised hematomas if I bumped myself, and the spontaneous bruising, this was often extensive, 50 cent piece size, arms, legs, torso, which had no correlation to pressure, but specifically to a lower platelet count, below 280,000. My assumption was that the quality of platelets that I was producing was very poor. Bone pain was significant and steady. Bomademstat ended April 2025.\n\n2025 June: The trial INCA033989.\n\nI then waited to clear my system of Bomademstat, have my BMB, ECG and MRI in preparation for the INCA trial. My platelets had no trouble rising past the minimum for trial participants in a matter of weeks.\n\nI had my first infusion a week ago. The infusion doesn’t take long, but one must remain to be observed for any side effects for 4 hours. I was unaware of any. My blood pressure remained in the range I am used to.\n\nUnfortunately, my bloods, 9 vials, were only collected for the company lab in Singapore,\n\nso, we have no record on the day, of my platelet count, although prior to the infusion, 7 days earlier, they were in the 820.000 range.\n\nWhat we do have, is a week after the infusion, a platelet reading of 700.000, Haem was 119,\n\nAnd best of all, my inflammatory markers were within the normal range. This would explain why, I had some sudden and unexpected relief of pain, that manifests as pain in major joints and bones, stiffness after sitting, and on waking etc.\n\nI had another ECG a week later, (yesterday) all normal, and bloods taken and met with David Ross and the clinical trial coordinator.\n\nNext week, I will have another set of bloods taken, ECG, have the infusion, and another ECG following that, and remain for 4 hours to be observed. I have asked for a record of the blood results from now on, so we can map the results going forward.\n\nThe expected course of treatment will remain fortnightly infusions for the foreseeable future.\n",
    "User Name": "CalrAustHooman",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Clinical trial participation",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "Somewhat positive",
    "URL": ""
  },
  {
    "Entry": "56",
    "Thread": "b",
    "Quote": "I’m currently considering joining the BOMADEMSTAT Phase 3 clinical trial. My platelet count is around 1.2 million, and I’m currently on Interferon injections. I do struggle with quite a lot of bone pain, so reading about your experience with similar side effects while on BOMADEMSTAT has made me a bit concerned.\n\nDo you have any advice or insights you’d be willing to share?\n\nWishing you all the very best with the new trial! 😊\n",
    "User Name": "Pinktulips",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Clinical trial consideration",
    "Topic 2 ": "Side effects",
    "Topic 3": "BOMADEMSTAT",
    "Sentiment": "Somewhat negative",
    "URL": ""
  },
  {
    "Entry": "56",
    "Thread": "c",
    "Quote": "Hi, thanks for your message, it's so good you asked that question about Bomademstat and bone pain. So many others in my trial group had great relief from a range of disease symptoms. After 12 months on Bomademstat ,my first bone marrow biopsy revealed some improvement, some healing.\n\nThe bone pain was getting bad toward the end of my 2+year stint, and while my platelets were under 400,000 consistently, it was other drug side effects that sealed the deal in leaving the trial. Apparently I had problems that no one else had in my group, that's so important to remember. I would say, if what your taking now, isn't lifting the disease burden of symptoms, then be willing to try something else. I'm 18 years into this disease, my body has been through the mill, your experience might be great. I wish you all the best in Making a decision that's best for you. Kind regards, Sally.\n",
    "User Name": "CalrAustHooman",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "AU",
    "Topic 1": "Clinical trial participation",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "Somewhat positive",
    "URL": ""
  },
  {
    "Entry": "56",
    "Thread": "d",
    "Quote": "\nThank you so much for taking the time to share your experience. It really means a lot, especially hearing from someone who’s actually been through the Bomedemstat trial.\n\nIt’s encouraging to hear that you saw some improvement and even healing on your bone marrow biopsy after 12 months—that gives me a lot to think about. I really appreciate your honesty about the bone pain and side effects too. It’s helpful to be reminded that everyone’s experience can be very different.\n\nI’ve received the trial leaflet and will read through it thoroughly before making any decisions. I’m currently on Besremi and live with a fair amount of fatigue, bone discomfort, and brain fog—so your point about being open to trying something new if the current treatment isn’t lifting the burden really resonates.\n\nWishing you continued strength and better days ahead. Thank you again.\n\n",
    "User Name": "Pinktulips",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Clinical trial consideration",
    "Topic 2 ": "Side effects",
    "Topic 3": "BOMADEMSTAT",
    "Sentiment": "Mostly positive",
    "URL": ""
  },
  {
    "Entry": "57",
    "Thread": "a",
    "Quote": "I wanted to share an update on my progress. I had my 12th infusion yesterday, and I'm happy to report that my platelet count has been in the normal range since March 3rd. Yesterday, my count was 311,000, and most of my other bloodwork was also within the normal range. My energy has significantly increased, and I'm almost symptom-free, which makes me realize how much fatigue I was experiencing before.\n\nI still experience severe motion sickness and get dizzy if I move my head too much or stand up too quickly. I'm seeing a Neuro-Ophthalmologist on August 28th, as we suspect this might be related to my eyes. I will also be getting a heart holter monitor next week (checking all the boxes). Thankfully, the swaying sensation I occasionally felt before the trial is almost completely gone.\n\nMy current regimen involves a 750mg infusion every two weeks at Stanford. On August 4th, I'll have another bone marrow biopsy (BMB) and MRI. I'm hopeful that the results will show a reversal of the disease and continued decrease in my spleen size. This is a marathon, and those results might take some time. Since my spleen has gone down, I've also noticed that I don't feel full as quickly.\n\nFor the next phase of the trial, patients will receive a starting dose of 750mg. Here is a link to the most recent results thus far. library.ehaweb.org/eha/2025...\n\nI will provide another update once I have my results from all the testing on 8/4. Stay tuned!\n",
    "User Name": "Zeppelin11",
    "Channel": "HealthUnlocked",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical trial participation",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "58",
    "Thread": "a",
    "Quote": "After careful consideration, I decided to join this trial. Since I was diagnosed in 2017 I have been on Hydrea, Interferon and Angerlide. Recently my platelets spiked over the millions so my MPN Specialist, Dr Gotlib at Stanford, suggested this trial. I was hesitant at first but the more research I did, I realized I didn't want to pass up this opportunity. So I muscled through the screening process and was approved. They did notice in my BMB, a slight progression, but my diagnosis was still the same. All the more reason to move forward with the trial. After my first dose, I'm happy to report that my platelets have gone from 1 million to 618,000 and my LDH level went down 50% in just one week. Wow! I've never seen my numbers shift this much. I feel great, just dealing with some fatigue. Because my numbers were excellent, Dr. Shomali (head of the trial) took me off of Anagrelide. What a relief! My next infusion is this Monday and going forward I will receive infusions every 2 weeks. In 6 months I will get another BMB to see if the disease is essentially reversing.\n\nStanford is looking for more patients to join phase one of the trial. If you live in California, or are willing to travel and are interested in this opportunity, below is the link.\n",
    "User Name": "Zeppelin11",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Clinical trial participation",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "58",
    "Thread": "b",
    "Quote": "My Dr and I planned to start last Friday but due to logistics with my insurance we are starting Jan 10th. I'm currently taking 1500mg of Hydrea and my Hematologist wants me to keep taking it while starting a Pegasys dose of 180mcg. I told him I thought that was too high and prefer to start with 45mcg and work my way up if need be. So I will continue the 3 pills of Hydrea with 45mcg of Pegasys. If my numbers are looking good we will start to take off one pill at a time to taper me off. The other option is for me to start 90mcg. The syringe comes in 180mcg and I can't use it twice so I will be burning a lot, however I'm reluctant to start with 90mcg because the other side effects and I don't want to give my liver too much to handle.\n\nQuestion for anyone taking Pegasys, what dose did you take when you first started?\n\nSide note: Make sure to always be your own advocate. My Hematologist is wonderful, however he is very tough and aggressive with his treatment, and because of the information I have discovered, I ultimately choose what is best for me when it came to my medication and dosage.\n",
    "User Name": "Zeppelin11",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Clinical trial participation",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "58",
    "Thread": "c",
    "Quote": "NCA033989 Trial - 2nd Infusion Update\n\n\nOn Monday, I had my second infusion. My pre-lab results showed my platelets at 326,000 and my LDH was normal – numbers I haven't seen since before my ET diagnosis. So far, I'm only experiencing fatigue, which is to be expected as my body adjusts. Depending on how my platelet count responds, my doctor may take me off low-dose aspirin. I'll have updated numbers next week and we'll adjust my treatment plan accordingly. Currently, I'm receiving a 750mg infusion every two weeks, which will continue indefinitely. My platelet count dropped significantly in just two weeks, so I'm interested to see what dosage will be most effective long-term.\n\nMy coordinator mentioned that Stanford will likely start phase two of the trial at the end of the year and expand the criteria for qualification. If anyone is interested in this trial, it might be worth considering.\n\n",
    "User Name": "Zeppelin11",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "59",
    "Thread": "a",
    "Quote": "That’s fantastic, I’m so pleased for you, and thank you for sharing, it gives me hope in dark times. Does anyone know if that’s the same phase one trial that is being run by Guys? I thought of volunteering for it but difficult to get to London on a weekly basis, I’m hoping to join it at phase 2.",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "60",
    "Thread": "a",
    "Quote": "You are absolutely correct that hematology providers should be providing patients with education and resources to make good decisions. The reality is that the quality of MPN care from different hematology providers is enormous. It is more than provider knowledge about MPNs. It is also about a commitment to shared decision making, which involves ensuring that patients are treated with respect and educated about their condition. Sadly, not all providers are committed to providing this type of optimal care to patients. It is more work to actively engage patients and provide them with the resources they need to make informed decisions. Fortunately, there are providers who are committed to shared decision making and ensuring high quality care. It is our responsibility as patients to seek out the providers who will provide high quality care. We each must assert our right to choose a care team who will treat us with respect and provide us with the resources to make good decisions.\n",
    "User Name": "hunter5582",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Care team dissatisfaction",
    "Topic 2 ": "Need for specialist",
    "Topic 3": "",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "60",
    "Thread": "b",
    "Quote": "It is good news to hear this is moving forward. Sapablursen is an antisense oligonucleotide (ASO) therapy that would modify gene expression at the RNA level blocking the production of a protein, transmembrane protease serine 6. By inhibiting TMPRSS6, sapablursen would increase the expression of hepcidin. Increasing hepcidin express would decrease production of RBCs. A similar approach to rusfertide, a hepcidin mimetic, but a different mechanism of action.\n\nIt is very promising to see a variety of different approaches to treating PV moving forward.\n",
    "User Name": "hunter5582",
    "Channel": "HealthUnlocked",
    "Demo": "50s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Sapablursen",
    "Topic 2 ": "Treatment option",
    "Topic 3": "",
    "Sentiment": "Entirely positive",
    "URL": ""
  },
  {
    "Entry": "61",
    "Thread": "a",
    "Quote": "Hello, I am very grateful for this forum. By reading the many posts I have gained much better insight into the disease. I was diagnosed with PV 2 years ago. I am 52 years old and have no history of thrombosis. As a result I belong to the low risk group and I only started with aspirin and phlebotomy. Since February of this year I have been participating in the clinical trial phase 3 of Rusfertide. I do not have official confirmation yet but I suspect that I have been on the drug (and not placebo) since the beginning since I have not needed phlebotomy since the start. My hematocrit remains below 45% with a dose increase from 20 to 30 and now 45 mg. On the other hand my platelets did go up (1.020), as did my white blood cells (17.65). Apart from fatigue and hair loss, I have few symptoms. My AB was tested 2 years ago via bone marrow puncture and was 43.8%. A year later, this was found to be 78.5% in a blood test from the study. This may not be a 1-on-1 comparison due to a different measurement method.\n\nIn any case, I would like to discuss the option of Besremi with my hematologist. Since September, this is reimbursed in my country (Belgium). Pegasys has never really been an option here because it was not eligible for reimbursement as an off-label drug. As a result, hematologists have little experience with the use of IFN. My hematologist has doubts because she judges that I, as a low-risk patient, do not actually need medication. In theory, phlebotomy would suffice. In addition, I would also like to point out that I have had periods of mild depression in the past. I have Vitiligo and therefore have a greater risk of an autoimmune disease in the thyroid. I had 3 periods of severe hives and my liver values ​​are also disturbed (unknown cause). In order to prepare my case to my doctor, I would like to ask you the following questions:\n\n",
    "User Name": "AnPV",
    "Channel": "HealthUnlocked",
    "Demo": "50s M",
    "Persona": "Patient",
    "Country": "BE",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "61",
    "Thread": "b",
    "Quote": "It’s a trial for Rusfertide. Here is a little of what they sent me. They called me today too. Its done in Southern Florida and there would be several visits. It is supposed to lower HCT so less phlebotomies are needed. (I think.) To keep iron up- I guess. Ep Guy? Hunter? What can you tell me?\n\nThe several visits would be difficult for me. They did say that they might be able to reimburse for travel though.\n\n",
    "User Name": "Barbiebreath",
    "Channel": "HealthUnlocked",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Rusfertide",
    "Topic 2 ": "Clinical trial consideration",
    "Topic 3": "Travel requirement",
    "Sentiment": "Somewhat negative",
    "URL": "https://healthunlocked.com/mpnvoice/posts/148214212/remember-the-trial-i-inquired-about"
  },
  {
    "Entry": "62",
    "Thread": "a",
    "Quote": "They seem to be hiding something. Not my preferred way to gain confidence.\n\nI think it's an agency that coordinates various studies.\n\nIt has this description, with the wrong disease, is it mysterious:\n\n<<Your participation could help other people in the future with the same disease, by contributing to advancing Diabetes research.>>\n\nBut it's good to know there are more researchers working hard on our conditions.\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "63",
    "Thread": "a",
    "Quote": "I don't fancy messing with my treatment plan at this point. Of course if it turns out they just want to interview, monitor and follow people, i might be interested. Particularly if it involves an all-expense trip to Florida with a little money on the side. I could do with a couple of good seafood dinners and a trip to the beach! Seems it is not far from Ft. Lauderdale. Maybe a bunch of us could go and have a PV Beach Party!\nSeriously though, I do hope that people interested will be willing to access clinical trials for PV. It is the only way things will move forward.\n\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "64",
    "Thread": "a",
    "Quote": "Oh my goodness! There was no comparison to the level of care I’ve been receiving and what I experienced today. Thank you all so much for encouraging me to see a specialist. Special shout outs to Hunter and EP Guy!\n\nI went to UNC Chapel Hill Cancer Hospital. I saw Dr Brandi Reeves. She was amazing. From the moment I walked in the door everyone was so nice and went out of their way to introduce themselves and made me feel “taken care of.” There was bloodwork done in the lab first.\n\nNext I met with the pharmacist who went through all of my meds and supplements with me. Dr Reeves came in and spent a solid hour or MORE going over my history and what led up to my PV diagnosis. She listened to me, talked to me about medication options, my bloodwork, her research, gave me a treatment plan, seemed excited that I had researched and had some “knowledge” about my condition and praised you all on this wonderful support group for educating me!\n\nI personally feel that this group might have literally saved my life. I am now with a brilliant doctor that is probably the smartest person I’ve ever met. She tried to explain the research she is doing using blood that I donated. Hunter, I wish you had been there so you could explain it to everyone else!\n\nNo matter what happens at least now I have a team that is taking care of me. I don’t know why I was so hesitant to make this happen sooner.\n\nI will be getting some phlebotomies, taking low dose aspirin AND my first medicine will hopefully be Besremi. The “team” seemed confident they can make that happen.\n\nSo much better than my last oncologist who only said- “Do nothing or take HU” and left that decision to me - with no explanations or even a pamphlet. Described PV as a blood disorder that I was lucky to have and to just “Go out and live my life!” 👎👎👎👎👎\n",
    "User Name": "Barbiebreath",
    "Channel": "HealthUnlocked",
    "Demo": "60s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Specialist care",
    "Topic 2 ": "Care team dissatisfaction",
    "Topic 3": "Treatment consideration",
    "Sentiment": "Somewhat negative",
    "URL": "https://healthunlocked.com/mpnvoice/posts/147998117/first-visit-with-my-mpn-specialist"
  },
  {
    "Entry": "65",
    "Thread": "a",
    "Quote": "Congratulations! Having an MPN specialist in your corner makes such a big difference! My experience was very similar in that my specialist was excited I had done so much of my own research thanks to the great community here!Interesting on metformin..my MPN specialist had mentioned some recent work on the subject which surprised me - my only experience with metformin was my wife was prescribed it for help with PCOS about 20 years ago...one of the \"side effects\" can be weight loss :-) - I will follow up with him on my next appointment and see if he has anything new...\n\n",
    "User Name": "Solyesh",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Specialist care",
    "Topic 2 ": "Care team dissatisfaction",
    "Topic 3": "Treatment consideration",
    "Sentiment": "Entirely Positive",
    "URL": ""
  },
  {
    "Entry": "66",
    "Thread": "a",
    "Quote": "With that in mind, I no longer need the four-hour monitoring period. From now on, the pharmacy needs about 45 minutes to prepare the medication after I check in, and the actual infusion takes around 30 minutes. On infusion days, I also see my doctor for a check-in and have labs drawn an hour before the infusion. Considering the two-hour commute each way, it does take up the entire day. I'm not complaining, of course, just highlighting the time commitment involved in participating in the trial. Fortunately, my experience has been positive so far, making it all worthwhile.\n\nUnless anything significant comes up, I'll start spacing out my updates. I'm planning to have my next Bone Marrow Biopsy (BMB) in August, as I'm opting to wait six months instead of doing one at three months.\n",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "67",
    "Thread": "a",
    "Quote": "On my 7th week (7th dose at 90mcg per dose) of Pegasys and noticing massive fatigue and some mood swings. Has anyone experience similar side effects and how early did they occur? Not sure how fast side effects can occur with this medication.",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Side effects",
    "Topic 2 ": "Pegasys",
    "Topic 3": "Treatment consideration",
    "Sentiment": "Mostly negative",
    "URL": ""
  },
  {
    "Entry": "68",
    "Thread": "a",
    "Quote": "I look back fondly on the days when I was only worried about having n MPN. In the past few weeks I developed a blood clot. That has led to initiation of hydroxyurea. Fortunately, I am tolerating that well and platelets are starting to come down. Then I asked that intermittent pain on my left side be investigated. An ultrasound revealed a very large mass along with a small focus on the liver. This past week I met with an oncologist who gave me hope that the tumor is benign. Subsequent bloodwork shows that all tumor markers are negative for cancer. Major surgery is in my futre however. Two MRIs are scheduled for tomorrow. One cannot make these things up and I still have difficulty believing I have all this going on at once. Prayers requestd. Beth\n\n",
    "User Name": "Mtnlife",
    "Channel": "HealthUnlocked",
    "Demo": "70s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Comorbities ",
    "Topic 2 ": "Blood clot",
    "Topic 3": "",
    "Sentiment": "Entirely negative",
    "URL": ""
  },
  {
    "Entry": "68",
    "Thread": "b",
    "Quote": "I have not posted for a long time. There is not much to say. I am pleased to report that as of today my blood counts are all within normal range and I feel well. I have been taking HU since early March. At first I had a bit of fatigue. Now, none. I did not want to take this drug but after having a blood clot in my leg this past February, it does seem advisable.\n\nI try to control as many factors as I can with this disease such as diet, exercise, being careful in the sun, etc. and then just taking each day at a time. Honestly, if it not for the medication I take for this disease along with other health conditions I would not know I was ill!\n",
    "User Name": "Mtnlife",
    "Channel": "HealthUnlocked",
    "Demo": "70s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Hydroxyurea",
    "Topic 2 ": "Treatment satisfaction",
    "Topic 3": "",
    "Sentiment": "Entirely Positive",
    "URL": ""
  }
]