{
  "Caregiver": {
    "motivators": {
      "Access to new treatment": [
        "We’ve tried everything else—this could be our best shot.",
        "I just want to know we’ve done all we can.",
        "If it helps him feel better, I’d do it in a heartbeat.",
        "A new treatment gives us hope when nothing else has.",
        "Maybe this trial has something that works better."
      ],
      "Close monitoring by specialists": [
        "Having experts check on her more often is reassuring.",
        "I like that someone will really be watching her progress.",
        "They said the team includes pediatric specialists, which matters to us.",
        "It’s hard to get appointments normally—this trial offers more support.",
        "It’s comforting knowing she’ll be in a structured care plan."
      ],
      "Support with logistics": [
        "They offered help with travel—that made a difference.",
        "It’s huge that they’ll cover hotel and transportation.",
        "Having someone coordinate everything lifts a huge weight.",
        "If they help manage the visits, it becomes doable.",
        "I wouldn’t consider it if they didn’t provide support for logistics."
      ]
    },
    "concerns": {
      "Time away from school/work": [
        "He’s already missing so much school—how can we do more?",
        "I’d have to take time off work again, and it’s not paid.",
        "We can’t afford the lost hours every week.",
        "This would mean asking the school for more leniency, again.",
        "The appointments are during school hours—it’s a problem."
      ],
      "Procedural stress for child": [
        "She hates needles—it turns into a trauma every time.",
        "Another scan? She’s terrified of those machines.",
        "He shuts down when things get too medical.",
        "It’s hard watching her go through these tests again and again.",
        "The tests are exhausting for both of us."
      ],
      "Uncertainty about outcomes": [
        "What if it doesn’t work? Then what?",
        "I’m scared we’ll regret putting him through all this.",
        "They said it’s experimental. That makes me nervous.",
        "We’re not sure what the long-term effects are.",
        "I just wish there were more guarantees."
      ]
    }
  },
  "Patient": {
    "motivators": {
      "Hope for improvement": [
        "I just want to feel better again.",
        "What if this actually helps?",
        "I’m tired of being tired—maybe this is a step forward.",
        "If this means fewer seizures, it’s worth a try.",
        "They said it might make a difference—I’m holding onto that."
      ],
      "Being part of something bigger": [
        "Even if it doesn’t help me, it might help someone else.",
        "I like the idea of contributing to something that matters.",
        "Maybe what they learn from me can help others like me.",
        "It feels good to be useful in some way.",
        "I know they need people like me to move things forward."
      ],
      "More attention and care": [
        "It’s nice to have people checking in on me regularly.",
        "I feel like I’ll be more than just a number here.",
        "They seem like they really care.",
        "This feels more personal than my usual appointments.",
        "It’s like having a team behind me."
      ]
    },
    "concerns": {
      "Side effects": [
        "What if the side effects are worse than my symptoms?",
        "I’ve had bad reactions before—what if it happens again?",
        "They said nausea was common, and that scares me.",
        "What if it makes me feel worse?",
        "I don’t want to deal with new problems on top of everything else."
      ],
      "Feeling like a test subject": [
        "I don’t want to feel like a guinea pig.",
        "Are they really doing this for me—or just the data?",
        "It sounds a bit like being experimented on.",
        "What if I get the placebo?",
        "I’m not sure I trust the process fully."
      ],
      "Disruption to daily life": [
        "It’s hard to plan my week around so many appointments.",
        "This could mess up my school schedule.",
        "I don’t want to rearrange everything for this.",
        "It’s already hard enough without adding more.",
        "The travel time alone is draining."
      ]
    }
  }
}