[
  {
    "Entry": "1",
    "Thread": "a",
    "Quote": "This is good news. Hopefully it will be approved for PV in 2026. A better treatment option for folks with PV who need too many phlebotomies.",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Phlebotomy",
    "Sentiment": "Entirely Positive",
    "URL": ""
  },
  {
    "Entry": "2",
    "Thread": "a",
    "Quote": "Here's my story. 12 years to diagnosis so it's a doozy.\n\nI still have the 2009 handwritten note from my primary care physician that my blood test showed high platelets. I call this primary care physician the Magic Doctor because he would do a magic trick for his patients at every visit. I found it weird and awkward at the time, but it makes me laugh now. Anyway, he referred me to Hematologist #1.\n\nHematologist #1 said, \"What are you doing here?\" I told him, I don't know, wasn't my idea, my doctor sent me. He said, \"I need to have a talk with your doctor about that.\" He ran some blood tests - I have no idea which.\n\nThe Magic Doctor ran another CBC, a bit higher, and sent me back to Hematologist #1. The same routine occurred.\n\nThen I was sent to him a third time. At this visit, I had my husband with me (so of course I was taken more seriously) and I asked him - what is the magic number? He said 600. (Btw, even though this was 2009, that wasn't following the WHO diagnostic criteria, it was 450 in the 2008 revision.)\n\nIn 2009, there was zero info online about MPNs. At that time, MPNs had only been recently reclassified as a blood cancer, and the CalR mutation hadn't even been discovered yet. I think I was only able to find a couple people online with high platelets - but they had extreme thrombocytosis, like 2 million, and were getting plateletpheresis (removing platelets from the blood - btw, it doesn't work in the long run because in MPNs, your bone marrow cranks out a bunch more immediately). But when I saw their blood counts were that high, I thought: well I was told not to worry by a hematologist, and my count is only 500....So I promptly forgot about it.\n\nAt every single annual physical I had, my CBC was done and my platelets were high. I had 2 subsequent primary care physicians. With both of them, I'd ask about the high platelets and they'd tell me - \"That's just the way you are.\" The only medical record I have from this period is in 2017, my platelets were in the 600s.\n\nIn 2017, I had total knee replacement surgery (TKR). TKR has a very high risk of blood clots. My platelets were in the 700s. Those pre-op reports are viewed by the surgeon, anesthesiologist, and other medical professionals and no one said a word to me about my platelets. Thank God I was given lovenox (blood thinner) after the surgery.\n\nAround that time - it's hard to pinpoint - I started having a lot of symptoms. I feel like my MPN reached some sort of tipping point. Like one year I was asymptomatic, and the next I had a boatload of symptoms. And they were debilitating. By far the worst was fatigue and headaches. I saw neurologists, a zillion physical therapists, pain management, acupuncture, you name it - nothing helped with the headaches. I never once complained about fatigue because I thought - what are they gonna do? Tell me to drink more coffee? My primary didn't know - and he was shocked when I told him about my symptoms later on.\n\nIn 2019, I had a Patient Portal! After my annual physical, I looked at my CBC and my platelets were at 1,000 and some other blood counts were high too - hematocrit, basophils, monocytes. My primary had marked it as \"normal\". I wrote him a message in the portal and said, \"my platelets have never been so high, I think something is wrong.\" He apologized to me for overlooking it and referred me to Hematologist #2.\n\nHematologist #2 was my husband's oncologist. She ran the mutation test and it came back positive for JAK2. After that, she left her position and literally vanished. Didn't take another job, just disappeared. Weird.\n\nBy this time, I've communicated with a Facebook group and was told to get an MPN Specialist, so I found one and made an appointment. In the meantime, I kept the appointment with Hematologist #2's replacement, Hematologist #3. Heme #3 wasn't too thrilled that I already had an appointment with the MPN Specialist, but I had so many questions. He told me I had ET. I asked him if I should have a bone marrow biopsy. He said no. (Wrong. ) I told him I was extremely tired and had lots of debilitating headaches. He told me that MPNs have no symptoms. (Wrong.) After he answered my questions, he'd say in a snarky tone: \"Why don't you ask Dr. ___ that?\" Turned out he'd done residency with her and I think he was jealous since she was in a much more prestigious hospital and position. Ironically, he's now the director of the cancer center at that local hospital.\n\nIn 2020, I finally see my MPN Specialist. She did a bone marrow biopsy on the first visit. And she noted that my hematocrit was high (although it wasn't incredibly high and had only recently gotten high). I brought my husband to that visit too, and he told her how sick I was. I just expected not to be believed, but she believed me.\n\nLo and behold, my BMB report comes back and my diagnosis is not ET - it's PV. My PV is weird and my platelets predominate. Because it took so long to get diagnosed, I'll never know whether I had ET that progressed to PV, or had PV all along. I'm in a clinical trial on the maximum dose of Jakafi which has more or less given me my life back, but my stubborn platelets remain in the 800s.\n\nAll told, it was roughly 12 years from the first record of a high blood count to misdiagnosis to correct diagnosis. Fortunately, I'm an outlier when it comes to this. Most people on this sub are getting diagnosed fairly quickly (even if they don't see it that way).\n\nI asked my MPN Specialist - how could this happen? How could so many doctors miss this? She said, \"I don't know.\" I started thinking a lot about it, and I realized - if it's one doctor, that's just an incompetent doctor - but when it's lots of doctors, it's a systemic problem. They don't know about MPNs. They don't know it was reclassified as cancer. They only worry when blood counts are low, not high. I have no way of changing how doctors think, but it occured to me that I could try to empower other patients. So this led to me becoming the mod here, writing the Wiki, and now the upcoming website. It's all just paying it forward. We have to have the knowledge. We have to advocate for ourselves.\n\nP.S. This is also why - unlike other medical subs - I allow diagnosis questions. I know they can be annoying, but I don't want this to happen to anyone else if I can help it. I try to answer every single one, whether I feel like it or not.",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Misdiagnosis",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1jhct4f/tell_us_your_diagnosis_story/"
  },
  {
    "Entry": "3",
    "Thread": "a",
    "Quote": "Here’s my story. In 2015, my platelets started going up, and it was the first time I had hit the “high” range. Didn’t think anything of it.\n\nFast forward to 2022 (I’m 35 going on 36). I tear my labrum in my shoulder. Doctor gives me a steroid injection and a 7 day dose of prednisone. Little did I know, they carry an increased clot risk. I start the prednisone, and I start getting a headache. Headache gets worse and worse as the week goes on. Finally, on like day 5 or 6, it’s unbearable. I still think it’s just a headache.\n\nI have a beer league softball game that night. I normally play outfield, but because of my shoulder, I pitch. I barely get through the game. I luckily only live about 3/4 mile from the complex. I get home, and my wife is trying to get our 6 month old son to sleep. At this point, it feels like a bomb has gone off in my head. I sit on the stairs for about 30 minutes in the fetal position. I finally say fuck it and power through a shower and flop down on the bed.\n\nAlmost immediately, I feel the urge to vomit. So I go throw up everything in my stomach. And my body still won’t stop retching. It goes on and on. I spend the rest of the night shaking not really sleeping. My wife decides something is wrong, finds someone to watch our son, and tries to get me to the hospital. She said I couldn’t get my pants on or walk down the stairs.\n\nShe gets me to the hospital, and they tell me I have a migraine and they try to send me home with some medicine. My wife says hell no, scan his head. They say ok, and come back and ask her if I hit my head because I am having a brain bleed…aka a stroke. The headache was the clot forming. The bleed started right after my softball game when I felt like a bomb went off in my head.\n\nI’m transported to another hospital, and my wife happens to tell the hematologist that I have elevated platelets. So a light bulb goes off, and they put me on blood thinners and do some testing. Platelets were only around 650 at this time. They find out I have ET JAK2+. Spent 8 days in the ICU.\n\nThat’s how I found out I had ET. ICU doctor wanted to put me on HU. But me and my wife read about the side effects, especially around fertility, and we both said hell no. And I got a referral to my current hematologist, who got me on Pegasys (my wife, god bless her, actually found this doctor). And I’m so thankful. Pegasys has been great. My platelets are down to 299, and my allele burden is 1.7% (1.4% is undetectable), down from 6% at initial diagnosis.\n\nPrior to diagnosis, I was in excellent physical shape. I worked out every day, and was in very good cardiovascular shape. Not trying to brag or anything, but I just bring it up because that is what likely saved my life (in addition to who I married). The doctor credited my quick recovery to me being in excellent shape. Protocol for a stroke was 14 days in the ICU, but I was able to get out in 8. And with my particular type of stroke, 1/3 of people die, 1/3 have debilitating effects, and 1/3 have minimal effects. I fall into that last third.\n\nI’ve commented on parts of my story, but I’ve never actually spelled it all out before and given the full story. Thank you so much for creating this topic. Writing this out (and really this entire community) has been very helpful to me.",
    "": "",
    "User Name": "u/No-Employment2539",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Misdiagnosis",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1jhct4f/tell_us_your_diagnosis_story/"
  },
  {
    "Entry": "4",
    "Thread": "a",
    "Quote": "Love reading everyone's stories here! As much as it sucks, it's comforting in a weird way to know about others struggling with the same thing.\n\nFor me, it really started in 2020 (23 at the time) I believe, I just hadn't realized it yet. I was on my computer one night in November 2020 and saw a large blind spot with scintillating scotoma (flashing colorful zig-zag patterns in periferials). This was the first time it had happened to me so obviously was freaked out. I told my girlfriend at the time about this but she was rather dismissive and as it began to resolve without other symptoms I began to calm down. Did more research shortly after and realized this was a classic migraine aura symptom, but scheduled a doctors appointment to be sure.\n\nFast forward a few weeks, at the doctors, had blood work and head MRI ordered. Everything was normal except my platelets (740) and HCT (52%). I even messaged my doctor about the platelets being so high in particular but he was dismissive about it and assured me everything was fine. Looked like it was just migraine with aura coinciding with starting a new job at the time and all the stress associated with that.\n\nLife went on as normal for the next 4 years, I'd have occasional migranes and itching after showers (assumed it was just dry skin, had been that way for as long as I can remember) but nothing else worrying. So assuming I was young and healthy I didn't go to the doctor at all over that period of time. This would change soon though.\n\nOctober 2024, I'm on a 3 week long work trip to Montreal. I'm out being a tourist one weekend when I notice more bloating than usual after eating. The next day I wake up, and after stopping by a cafe on the way to a museum for a pastry get very bad lower back and epigastric pain.\n\nAssume I just got some stomach bug and my lower back is tired from doing so much walking or lifting the wrong way at the hotel gym etc. Over the next couple of days this gets a bit better and I had back home to Chicago.\n\nHowever, it keeps flaring up again. Especially after eating, get back/epigastric pain and bloating. Finally decide after a month of this that I should go to the ER.\n\nFindings? Platelets and HCT about where they were the last time I had bloodwork in 2020 still. alkaline phosphatase is elevated (low 200s). CT is normal besides enlarged spleen at 15cm. Get sent home with a GI referral.\n\nI feel somewhat relieved, but there's still so many questions that didn’t quite add up. On top of that, symptoms continue to get worse and worse, I'm barely eating at this point because of how much pain I'm in afterwards. Manage to get an appointment with a GI a week early that my mom knew (she works in hospital administration). He orders a liver ultrasound and additional bloodwork. Go the same day for both. Now almost all my liver enzymes are elevated on bloodwork, not just alk phos. Get a call back right away after the ultrasound saying I have portal vein thrombosis, enlarged liver/gallbladder/pancreas/billary duct and to go to the ER immediately.\n\nTrying to shorten this already excessively long story: I spent a total of 3 weeks in the hospital. This is where I finally had a MPN panel done showing JAK2+ with 24.5% VAF. TIPS procedure to relieve portal hypertension and subsequent thrombectomy to clear things out. Liver biopsy to make sure that was normal as it became enlarged and appeared cirrhotic on CT from portal hypertension (still SO thankful it came back normal)\n\nIt's odd that despite all this I feel greatful it's \"just\" an MPN. I'm especially grateful I had the right people to help me figure out what was going on before it got worse. Intervential radiologist especially was such a huge advocate for me at the time. But when cirrhosis/liver failure and malignant tumors are in the differential diagnosis, it's kind of a relief that its \"just\" a chronic blood cancer and complications from it being untreated for so long.\n\nI recently posted my BMB results here because they were a bit confusing and go to follow up with my MPN specialist Tuesday. The bone marrow pathology notes they favor a diagnosis of ET, but my MPN specialist thinks it's PV based on blood work. So still waiting on \"final\" diagnosis as it's not too clear cut.\n\nIf you made it this far thanks for reading, really ended up typing way more than I thought I would. It was therapeutic to put it all down though regardless.",
    "": "",
    "User Name": "u/WhaleSmacker17",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Misdiagnosis",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1jhct4f/tell_us_your_diagnosis_story/"
  },
  {
    "Entry": "5",
    "Thread": "a",
    "Quote": "\nHi there, first time posting and wondering if anyone has had a similar experience and might be able to guide me in the next direction. I'm 44/f living in the USA.\n\nMy WBC/RBC/Hematocrit/Hemaglobin levels have been elevated for a few years now, but my PCP never saw cause for concern (another story there…he’s a doctor I’m not going to anymore!) After eating healthier and working out for a while, I raised this concern again with another doctor when my bloods came back with WBC at 12.4, RBC 5.56, HGB 16.4 and HCT 47.8 (platelets were within normal range, 369). I booked an appointment with a haematologist after this pcp suspected Polycythemia Vera. I don’t know how we got to that conclusion with such vague bloodwork but I went for the follow up. I’d been drinking a LOT more water and herbal tea before my haematologist appointment, and my levels dropped a bit: WBC 11.3, RBC 5.45, HGB 15.5, HCT 45.4, platelets 335. Right at the start he said he strongly felt this might be secondary Polycythemia based on my levels dropping from hydration and ran the further tests that required external labs. Ferritin came back normal (32), EPO 3.9, for the most part everything normal. JAK2 negative however that blood test did return an RUNX1 gene mutation result (under “unknown clinical significance”). Seeking advice on what my next steps would be. A bone marrow biopsy has not been run. I was left sort of hanging, to figure out what is causing the raised levels on my own, and I don't know what the RUNX1 mutation is about.\n\nDoes this require further exploration with an MPN specialist? I do experience fatigue, very frequent migraines, burning/tingling in the fingertips sometimes (running them under hot water seems to alleviate this), and chest pain (chest pain is not a regular thing, only happening occasionally…baby aspirin seems to help). Thanks, and apologies for the long post!\n\n*To add to this, I do not smoke/never have, no sleep apnea (I'm pretty sure!), I rarely eat meat, haven't drank alcohol in over 7 years!\n\n\n\n",
    "": "",
    "User Name": "u/greatredditname212\n",
    "Channel": "Reddit",
    "Demo": "44 F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Diganostic Journey",
    "Topic 2 ": "Pre-diagnosis",
    "Topic 3": "Community Support",
    "Sentiment": "Neutral",
    "URL": "https://www.reddit.com/r/MPN/comments/1bgh9yq/prediagnosis_megathread_comment_here_if_you_are/"
  },
  {
    "Entry": "6",
    "Thread": "a",
    "Quote": "Brisk walking 45min + daily helps me too. I can tell when I miss it. I also know that if I have a really busy day, I'll be tanked the next day, so I plan around it (busy day followed by a rest day) whenever possible. Naps sometimes help, but not always. I prioritize the most important tasks on any given day, and anything else I get done is gravy. Every day I re-assess/prioritize my tasks. Simplifying my life and saying \"no\" as much as I need to is also very helpful.\n",
    "": "",
    "User Name": "u/katiespecies647",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Symptom Management ",
    "Topic 2 ": "Excercise ",
    "Topic 3": "Fatigue",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1czlgxh/fatigue_i_need_your_tips/"
  },
  {
    "Entry": "7",
    "Thread": "a",
    "Quote": "I find that at least 40 minutes of moderate exercise each day keep my symptoms at a minimum. This includes fatigue. Running or brisk walking works the best for me. 47M, PV (JAK2, high platelet count), Pegasys + Jakavi.\n",
    "": "",
    "User Name": "u/ToreKjellow",
    "Channel": "Reddit",
    "Demo": "48 M",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Symptom Management ",
    "Topic 2 ": "Excercise ",
    "Topic 3": "Fatigue",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1czlgxh/fatigue_i_need_your_tips/"
  },
  {
    "Entry": "8",
    "Thread": "a",
    "Quote": "ChatGPT is not allowed to say \"I don't know\" because people perceive that as unhelpful, so it will make a guess instead and pass that off as factual. I have seen it give so many wrong answers to people about MPNs. I figured out a way to prevent this somewhat by giving it permission to say \"I don't know\".\n\nI'm not thrilled about ChatGPT for medical questions, but this is the real world and telling people not to use it is like telling them not to Google. They're gonna do it anyway. IMO it can be a good tool for coming up with a list of questions for your next doctor visit, but it cannot be a substitute for a real doctor.\n\n",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Digital Experience",
    "Topic 2 ": "AI",
    "Topic 3": "Community Support",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1ltwy41/if_you_must_use_chatgpt_heres_a_trick_always/"
  },
  {
    "Entry": "8",
    "Thread": "b",
    "Quote": "Great advice. Large language models that power chatbots like ChatGPT aim to please, so they’ll give an answer but it may not be accurate.\n\nSimilarly, when asking a question, don’t share what you think the answer is because it will try to respond with something similar to what you suggested, even if it’s not the best answer. You’re better off giving as much context as possible without sharing assumptions. It’s not perfect either so it’s also worth checking the sources from the response to ensure ChatGPT correctly interpreted the source.\n",
    "": "",
    "User Name": "u/brennanx1",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Digital Experience",
    "Topic 2 ": "AI",
    "Topic 3": "Community Support",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1ltwy41/if_you_must_use_chatgpt_heres_a_trick_always/"
  },
  {
    "Entry": "8",
    "Thread": "c",
    "Quote": "And it doesn't have a good track record for medical sources. I shared one study a while back that showed only 40% of the sources were relevant. I think Google's search AI is the worst when it comes to that.\n",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Digital Experience",
    "Topic 2 ": "AI",
    "Topic 3": "Community Support",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1ltwy41/if_you_must_use_chatgpt_heres_a_trick_always/"
  },
  {
    "Entry": "9",
    "Thread": "a",
    "Quote": "I'm in NM and the healthcare system here, overall, is an embarrassment to the profession. Thru all my health issues, working has been hard & I'm now on medicaid. Any clue how to get them to pay for NGS & or going out of state to see a specialist?  If not, any idea who is most affordable near NM or \"scholarships/grants\" for low income?\n",
    "": "",
    "User Name": "@jenniferfuertes2668",
    "Channel": "Youtube",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Access to Care",
    "Topic 2 ": "Financial Coverage",
    "Topic 3": "Systematic Hurdels",
    "Sentiment": "Entirely Negative",
    "URL": "A Conversation with an MPN Specialist: Polycythemia Vera - YouTube"
  },
  {
    "Entry": "10",
    "Thread": "a",
    "Quote": "Looks like the trial is getting good results and even helped with symptoms. Rusfertide is not chemo. It's a hepcidin mimetic. Hepcidin is a hormone that helps regulate iron. Iron is needed to create red blood cells, so this drug slows the release of iron into the bone marrow for red blood cell production and lowers hematocrit. I've yet to hear anything bad about this drug from trial participants.\n\nIf you are tired of phlebotomies, check out the trial. https://www.polycythemiavera-clinicaltrial.com/\n",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "10",
    "Thread": "b",
    "Quote": "I check on this drug everyday….waiting on its approval\n",
    "": "",
    "User Name": "u/OrangeChicknTender\n",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "10",
    "Thread": "c",
    "Quote": "Have you seen the latest trial info? A lot more locations.\nhttps://clinicaltrials.gov/study/NCT05210790",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "New treatment",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "10",
    "Thread": "d",
    "Quote": "I guess I get it, but not gonna say it didn’t hurt a little.\nYes. I’ve emailed protagonist therapeutics to try and get into a trial. My husband needs to iron out before he can receive a BMT. The senior vice president emailed back and said there was no trial for him. That was it, no other information or any suggestions were given. I guess I get it, but not gonna say it didn’t hurt a little.",
    "": "",
    "User Name": "u/OrangeChicknTender\n",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Access to Care",
    "Topic 2 ": "Takeda",
    "Topic 3": "Clinical Trial",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1awwn0e/results_of_phase_2_clinical_trial_of_rusfertide/"
  },
  {
    "Entry": "11",
    "Thread": "a",
    "Quote": "Doctor just asked me if I want to go this trial and he hopes I get rux as my hct is going up again plus white cells and I’ve got very low iron prob due to phlebotomy my ferritin level was 13 and interferon have noticed that I’m feeling down more days than not also I have enlarged spleen at 14.9 cm last time it was checked just wondering what’s ppls thoughts",
    "": "",
    "User Name": "u/Mission-Cancel609",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "Clinical trial consideration",
    "Topic 2 ": "Ruxolitinib",
    "Topic 3": "Novartis",
    "Sentiment": "Neutral",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "11",
    "Thread": "b",
    "Quote": "\nIs this the one? https://www.birmingham.ac.uk/research/crctu/trials/mithridate\n\nI'd say go for it. Make sure you talk over all your concerns, of course. The decision is a deeply personal one. But to me, this looks like a well designed trial. It will be an interesting experience, and you might end up getting some tangible benefits.",
    "": "",
    "User Name": "u/WhisperINTJ\n",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "11",
    "Thread": "c",
    "Quote": "Yes that is the one I’m just worried if I get put in the hydoxy group\n",
    "": "",
    "User Name": "u/Mission-Cancel609",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "11",
    "Thread": "d",
    "Quote": "In a lot of trials, once the trial reaches its end date, you have the option of going on the trial drug.\n\nFor example, in the Rusfertide trial, for 8 months one group received current treatment plus Rusfertide and the other group received current treatment plus placebo. At the end of 8 months, patients were free to receive Rusfertide only or Rusfertide plus their current treatment (known as a crossover trial).\n\nSo ask whether you would get that option if you ended up in the hydroxyurea group.",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1kh1iui/mithridate_phase_3_trial/"
  },
  {
    "Entry": "12",
    "Thread": "a",
    "Quote": "I am a 38-year-old male based in Denver, Colorado USA who was recently diagnosed with ET by the first hematologist I saw and with PV by the second (Condition was discovered when I went to the ER with an enlarged spleen, I have platelets in the 800 - 900 range but also have hematocrit of 50 and hemoglobin of 16-16.5, leading the second doctor to suspect PV).\n\nI am scheduled to see a local MPN specialist and will likely start an interferon soon to reduce symptoms and hopefully fibrosis over time. My insurance (United Healthcare) requires you to try Pegasys first and will only approve Besremi if you have an adverse reaction to Pegasys. The did deny our prior authorization request for Besremi. I have two questions for you all about this:\n\nAre there reasons to prefer Besremi other than its more favorable side effect profile and the need to administer it just once every two weeks?\n\nDoes anyone have strategies for getting your insurance company to cover Besremi from the start if they deny it initially?\n\nThank you all—very glad to have found this community.\n\n",
    "": "",
    "User Name": "u/nelophonecall",
    "Channel": "Reddit",
    "Demo": "38 M",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Diagnostic Jounrey",
    "Topic 2 ": "Insurance Coverage",
    "Topic 3": "Pegasys",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1c8c433/getting_insurance_to_cover_besremi/"
  },
  {
    "Entry": "12",
    "Thread": "b",
    "Quote": "Hey! I have United Healthcare and my doctor is switching me to Besremi from Pegasys. United Healthcare wouldn’t pay for it even with the pre authorization, so the manufacturer ended up paying for it, $0 out of pocket.\n\nHave you tried Pegasys? It worked really well for me.\n\n\n\n",
    "": "",
    "User Name": "u/Origamishi",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Insurance Coverage",
    "Topic 3": "Pegasys",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1c8c433/getting_insurance_to_cover_besremi/"
  },
  {
    "Entry": "12",
    "Thread": "c",
    "Quote": "If you are diagnosed with PV, Besremi was made a first-line treatment last year at the American society of Hematology conference, and was then put into the 2024 NCCN guidelines (the NCCN makes all the official protocols for diagnosis and treatment of cancer in the USA). Most of the work is done by your doctor. They need to fight it out with United but insurance companies usually abide by the NCCN guidelines.\n\nI also recommend contacting the manufacturer, they will give you a case manager to help you get approval and help with costs. https://www.pharmaessentiasource.com/\n\n",
    "": "",
    "User Name": "u/funkygrrl",
    "Channel": "Reddit",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Insurance Coverage",
    "Topic 3": "Pegasys",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1c8c433/getting_insurance_to_cover_besremi/"
  },
  {
    "Entry": "13",
    "Thread": "a",
    "Quote": "I recently had an ultrasound of my liver done & the results came back showing damage to my liver. Has anyone else struggled with their liver being on Besremi? What was the game plan with your doctor? I’m currently on 250 every 2 weeks. I would hate to have to stop the besremi since it has helped with my symptoms SO much, but I don’t want to cause permanent damage to my liver.\n\n",
    "": "",
    "User Name": "u/States_",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Besremi",
    "Topic 3": "Liver impact",
    "Sentiment": "Somewhat Negative",
    "URL": "https://www.reddit.com/r/MPN/comments/1lufpj1/et_on_besremi_liver_concerns/"
  },
  {
    "Entry": "13",
    "Thread": "b",
    "Quote": "My husband had liver toxicity so he unfortunately cannot handle Besremi. They switched him to Jakafi instead as his ET progressed to PV. Before Besremi he was on anagrelide with ET and that was helpful in managing his symptoms. Hope that helps!",
    "": "",
    "User Name": "u/bawdy-awdy-awdy-awdy",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Caregiver",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Besremi",
    "Topic 3": "Liver impact",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1lufpj1/et_on_besremi_liver_concerns/"
  },
  {
    "Entry": "13",
    "Thread": "c",
    "Quote": "I’ve been taking a milk thistle supplement when my enzymes got high from Besremi. Went in about a month later and my enzymes are perfect again. I asked my MPN specialist if it’s okay to take and she wasn’t against it. They shouldn’t be taken daily consistently, so I’m stopping for a while and I’ll start up again. Maybe ask your MPN specialist if that’s okay for you too. Also, avoid alcohol.\n",
    "": "",
    "User Name": "u/z_iiiiii",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Treatment Options",
    "Topic 2 ": "Besremi",
    "Topic 3": "Liver impact",
    "Sentiment": "Somewhat Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1lufpj1/et_on_besremi_liver_concerns/"
  },
  {
    "Entry": "14",
    "Thread": "a",
    "Quote": "Thank you for this MPN journal. Using the tool helps with my anxiety. \n",
    "": "",
    "User Name": "u/Epeeist_Esquire",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Digital experience",
    "Topic 2 ": "Journal app",
    "Topic 3": "Mental Health",
    "Sentiment": "Entirely Positive",
    "URL": "https://www.reddit.com/r/MPN/comments/1lxyd71/mpn_journal_endorsed_by_ruben_mesa/"
  },
  {
    "Entry": "15",
    "Thread": "a",
    "Quote": "In the MPN Journal app, 50% of patients report experiencing considerable or extreme difficulty due to their fear of disease progression or worsening of their MPN. Half of these patients rate these concerns as 8 out of 10 or higher. This issue receives little attention, yet its impact is therefore enormous. What are your experiences? Is this ever discussed during consultations? Is any action taken there?",
    "": "",
    "User Name": "u/johnhoogland",
    "Channel": "Reddit",
    "Demo": "",
    "Persona": "Patient",
    "Country": "UK",
    "Topic 1": "Fear RE: Progression",
    "Topic 2 ": "Mental health",
    "Topic 3": "",
    "Sentiment": "",
    "URL": "https://www.reddit.com/r/MPN/comments/1lsv0lh/comment/n1zjzrw/?context=3"
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "",
    "Thread": "",
    "Quote": "",
    "": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "",
    "Topic 2 ": "",
    "Topic 3": "",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "16",
    "Thread": "a",
    "Quote": "Does anyone use a home hematocrit testing kit? And if so what brands and how well do they work? I’m looking at buying one because my hematocrit level was 45.7 yesterday so I went to get a phlebotomy today and my hematocrit level was down to 38. So I want to start monitoring it at home.",
    "": "",
    "User Name": "",
    "Channel": "",
    "Demo": "",
    "Persona": "",
    "Country": "",
    "Topic 1": "Home Tests",
    "Topic 2 ": "Device Preference",
    "Topic 3": "Hematocrit",
    "Sentiment": "",
    "URL": ""
  },
  {
    "Entry": "17",
    "Thread": "a",
    "Quote": "So went to specialist on Thursday, I'm in the clinical trial for my Polycythemia Vera. Got my first injection then.  \nWent to work today feeling pretty good, possible side effects; flu like symptoms for a couple days? Went home at lunch feeling a little achy. Thought I would take a quick nap, woke up 7 hours later. Felt better though.",
    "": "",
    "User Name": "Monica Crowe",
    "Channel": "Facebook",
    "Demo": "40s F",
    "Persona": "Patient",
    "Country": "USA",
    "Topic 1": "Clinical Trial",
    "Topic 2 ": "Participant Experience",
    "Topic 3": "",
    "Sentiment": "Somewhat positive",
    "URL": "https://www.facebook.com/profile/100000258958181/search/?q=trial"
  }
]