[
  {
    "id": "patient-1",
    "name": "Emma J.",
    "type": "Patient",
    "category": "Teen Patient",
    "color": "#059669",
    "avatar": "/assets/TEENPATIENT.svg",
    "age": 16,
    "location": "Urban",
    "expanded": false,
    "background": "A 16-year-old high school student who was recently diagnosed with a rare neurological condition. Lives with supportive parents in a suburban area with good access to healthcare facilities.",
    "key_challenges": [
      "Missing school for appointments",
      "Needle anxiety and procedure discomfort",
      "Social isolation from peers",
      "Body image concerns"
    ],
    "quotes_by_phase": {
      "pre_study_screening": [
        "I'm scared but also hopeful this could help me feel normal again. My friends don't really understand what I'm going through.",
        "The blood draws make me really anxious, but if it means getting better treatment, I'll try to be brave about it.",
        "Mom says this study could change everything for people like me. I just hope it doesn't take over my whole life."
      ],
      "early_visits": [
        "Missing school is the worst part. Everyone asks where I was and I don't know how to explain without making it sound scary.",
        "The nurses are really nice, but I still hate the needles. At least they let me bring my headphones.",
        "I'm starting to understand what all these tests are for. It makes me feel like I'm doing something important."
      ],
      "mid_study": [
        "Some days I feel like the treatment is working, other days I'm not sure. It's hard to tell what's different.",
        "I've gotten used to the routine, but I miss hanging out with friends after school. They're starting to make plans without me.",
        "The diary thing is actually kind of helpful. It makes me pay attention to how I'm feeling each day."
      ],
      "late_study": [
        "I'm so tired of all the appointments. I just want to be a normal teenager for once.",
        "Sometimes I wonder if all this is worth it. The side effects are getting harder to deal with.",
        "I know I'm helping future patients, but some days I just want to quit and pretend I'm fine."
      ],
      "post_study_reflection": [
        "Looking back, I'm glad I stuck with it even when it was hard. I learned a lot about myself.",
        "I hope the data I provided helps other kids like me get better treatments sooner.",
        "The experience taught me I'm stronger than I thought, but I'm ready to focus on just being a teenager again."
      ]
    }
  },
  {
    "id": "caregiver-1",
    "name": "Michele Johnson",
    "type": "Caregiver",
    "category": "Rural Working Mother",
    "color": "#0369a1",
    "avatar": "/assets/RURALMOTHER.svg",
    "age": 42,
    "location": "Rural",
    "expanded": false,
    "background": "Mother of Emma, works part-time as a nurse while caring for two children. Lives in a rural area 2 hours from the study site, requiring significant travel for appointments.",
    "key_challenges": [
      "Long travel distances to study site",
      "Balancing work and care responsibilities", 
      "Managing child's anxiety during long car rides",
      "Lost wages from time off work",
      "Limited childcare options in rural area"
    ],
    "quotes_by_phase": {
      "pre_study_screening": [
        "The 4-hour round trip to the hospital is going to be tough with my work schedule and Emma's brother to care for.",
        "As a nurse, I understand the importance of this research, but the logistics of rural life make everything more complicated.",
        "I'm worried about the gas money and taking unpaid time off, but if this could help Emma and other kids like her..."
      ],
      "early_visits": [
        "Emma gets carsick on the long drive, which makes these trips even harder. I pack snacks and games, but 2 hours is a lot for a sick kid.",
        "My supervisor at the clinic is understanding, but I can't keep calling in for these appointments without it affecting my hours.",
        "Finding someone to watch Emma's brother during these trips is a constant challenge. My mom helps when she can, but it's a lot to ask."
      ],
      "mid_study": [
        "The early morning drives mean we're both exhausted by the time we get to the appointment. Emma often sleeps in the car.",
        "I've gotten to know some of the other rural families in the waiting room. We share tips about the drive and support each other.",
        "Between the gas, lost wages, and childcare costs, this study is straining our budget more than I expected."
      ],
      "late_study": [
        "Emma's brother is starting to resent all the attention Emma gets and the times I'm away. It's affecting our whole family dynamic.",
        "The wear and tear on my car from all these trips is becoming a real concern. I can't afford a breakdown halfway to the hospital.",
        "Some days I wonder if we should have stayed with local care, but I know Emma is getting the best possible treatment here."
      ],
      "post_study_reflection": [
        "Despite all the challenges, I'm grateful we had the opportunity to participate. Emma's progress has been remarkable.",
        "I hope future studies will have satellite sites or telemedicine options to make participation more accessible for rural families.",
        "This experience taught me to be a stronger advocate for my daughter and showed me the importance of persistence in healthcare."
      ]
    }
  },
  {
    "id": "urban-professional-1",
    "name": "David Chen",
    "type": "Patient",
    "category": "Urban Professional",
    "color": "#7c3aed",
    "avatar": "👨‍💻",
    "age": 28,
    "location": "Urban",
    "expanded": false,
    "background": "A young professional working in finance, diagnosed with a rare autoimmune condition. Lives alone in the city with good healthcare access but demanding work schedule.",
    "key_challenges": [
      "High-pressure work environment",
      "Disclosure concerns at workplace",
      "Side effects affecting work performance",
      "Social isolation due to fatigue"
    ],
    "quotes_by_phase": {
      "pre_study_screening": [
        "I haven't told my boss about my diagnosis yet. I'm hoping this study can help me manage symptoms better so work doesn't suffer.",
        "The appointment times during business hours are tough. I'm running out of excuses for leaving early.",
        "My friends think I'm just stressed from work, but this is so much more than that."
      ],
      "early_visits": [
        "I had to reschedule two client meetings for today's appointment. I can't keep doing this without explaining what's going on.",
        "The blood draws make me dizzy sometimes, and I have to go straight back to work. It's not ideal.",
        "I'm grateful the study site is downtown. At least I don't have to travel far."
      ],
      "mid_study": [
        "I finally told my manager about my condition. She's been more understanding than I expected about flexible hours.",
        "Some days the treatment makes me feel great, other days I can barely function. It's hard to predict.",
        "Dating has become complicated. How do you explain all these medical appointments to someone new?"
      ],
      "late_study": [
        "The fatigue is getting worse, not better. I'm worried this treatment isn't working for me.",
        "I've become the person who always cancels social plans. My friends are starting to give up on inviting me.",
        "Work is suffering despite everyone's understanding. I'm not performing at my usual level."
      ],
      "post_study_reflection": [
        "The study taught me to prioritize my health over work achievements. That's a lesson I'll carry forward.",
        "I built relationships with other patients in the waiting room. Having that support network was invaluable.",
        "Even though my symptoms aren't completely resolved, I have a better understanding of my condition and how to manage it."
      ]
    }
  }
] 