{
    "executive_summary": "Pompe disease patients navigate treatment with a mix of resilience and exhaustion. While the availability of enzyme therapies offers a critical lifeline, the day-to-day realities—logistical, emotional, and physical—often undermine that sense of progress. In other words, the Pompe commmunity feel positively about their treatment options, though they wish a true cure, rather than treatments to manage symptoms, was available. But they feel just as negatively about the frequent requirement for dosing, difficult interactions with insurance, and the overall logistical burden of treatment.",
    "drug_sentiment": {
      "positive_drivers": {
        "themes": [
          "Patients frequently expressed gratitude for the availability of enzyme replacement therapies (ERTs) like Lumizyme and Nexviazyme, especially given the lack of treatment options for many rare diseases. Many noted feelings of relief, stability, and hope after beginning treatment."
        ],
        "quotes": [
          "This is the first time in 20 years that [my liver enzymes] have been normal! I’m so excited that the infusions are helping.",
          "So here’s ‘cheers’ to seeing the next 300+ infusions, son. Keep up that fight!!",
          "I’ve actually experienced an improvement in muscle strength after a few months."
        ]
      },
      "negative_drivers": {
        "themes": [
          "Despite broad appreciation, some patients voiced skepticism or doubt about efficacy, particularly when they experienced a plateau in progress or new symptoms despite years of infusions. There was also concern about switch denials and limited access to newer drugs like Nexviazyme."
        ],
        "quotes": [
          "I plateaued on Lumizyme and the muscle weakness began to creep back in.",
          "Insurance denied me switching [to Nexviazyme]... They said my lung function ‘wasn’t bad enough.’",
          "I had an allergic reaction… itching head to toe, hives on chest, neck, face."
        ]
      }
    },
    "infusion_experience": {
      "positive_drivers": {
        "themes": [
            "When infusions were well-managed—with responsive staff, proper pre-medication, and consistent routines—patients expressed relief, trust, and a sense of being cared for. Many praised their infusion teams."
        ],
        "quotes": [
          "My nurse was an ex-medic… she set everything in motion to ward off all the bad vibes!",
          "I’ve formed genuine friendships with several [infusion nurses], and our conversations help the 4–5 hours fly by."
        ]
      },
      "negative_drivers": {
        "themes": [
          "The most common complaints centered on the time burden of infusions—often lasting up to eight hours—along with disruptions to work, school, and the challenges of travel. Several patients also experienced side effects shortly after infusions, further extending the time needed for recovery and symptom management."
        ],
        "quotes": [
          "That 3-hour infusion lasted 8 hours!",
          "Within a few mins I had an allergic reaction… itching head to toe, hives on chest, neck, face.",
          "This will be the second time Desi has missed a dose… and as of right now we have no med and no pharmacy."
        ]
      }
    }
  }